1>------ Build started: Project: steamhook, Configuration: Debug Win32 ------
1>stdafx.cpp
1>
1>class _PMD	size(12):
1>	+---
1> 0	| mdisp
1> 4	| pdisp
1> 8	| vdisp
1>	+---
1>
1>class _TypeDescriptor	size(8):
1>	+---
1> 0	| pVFTable
1> 4	| spare
1> 8	| name
1>	+---
1>
1>class _s__CatchableType	size(28):
1>	+---
1> 0	| properties
1> 4	| pType
1> 8	| _PMD thisDisplacement
1>20	| sizeOrOffset
1>24	| copyFunction
1>	+---
1>
1>class _s__CatchableTypeArray	size(4):
1>	+---
1> 0	| nCatchableTypes
1> 4	| arrayOfCatchableTypes
1>	+---
1>
1>class _s__ThrowInfo	size(16):
1>	+---
1> 0	| attributes
1> 4	| pmfnUnwind
1> 8	| pForwardCompat
1>12	| pCatchableTypeArray
1>	+---
1>
1>class _s__RTTIBaseClassDescriptor2	size(28):
1>	+---
1> 0	| pTypeDescriptor
1> 4	| numContainedBases
1> 8	| _PMD where
1>20	| attributes
1>24	| pClassDescriptor
1>	+---
1>
1>class _s__RTTIBaseClassArray	size(1):
1>	+---
1> 0	| arrayOfBaseClassDescriptors
1>	+---
1>
1>class _s__RTTIClassHierarchyDescriptor	size(16):
1>	+---
1> 0	| signature
1> 4	| attributes
1> 8	| numBaseClasses
1>12	| pBaseClassArray
1>	+---
1>
1>class _s__RTTICompleteObjectLocator	size(20):
1>	+---
1> 0	| signature
1> 4	| offset
1> 8	| cdOffset
1>12	| pTypeDescriptor
1>16	| pClassDescriptor
1>	+---
1>
1>class __s_GUID	size(16):
1>	+---
1> 0	| Data1
1> 4	| Data2
1> 6	| Data3
1> 8	| Data4
1>	+---
1>
1>class __crt_locale_data_public	size(12):
1>	+---
1> 0	| _locale_pctype
1> 4	| _locale_mb_cur_max
1> 8	| _locale_lc_codepage
1>	+---
1>
1>class __crt_locale_pointers	size(8):
1>	+---
1> 0	| locinfo
1> 4	| mbcinfo
1>	+---
1>
1>class _Mbstatet	size(8):
1>	+---
1> 0	| _Wchar
1> 4	| _Byte
1> 6	| _State
1>	+---
1>
1>class _PROCESSOR_NUMBER	size(4):
1>	+---
1> 0	| Group
1> 2	| Number
1> 3	| Reserved
1>	+---
1>
1>class _GROUP_AFFINITY	size(12):
1>	+---
1> 0	| Mask
1> 4	| Group
1> 6	| Reserved
1>	+---
1>
1>class _FLOAT128	size(16):
1>	+---
1> 0	| LowPart
1> 8	| HighPart
1>	+---
1>
1>class _LARGE_INTEGER::<unnamed-tag>	size(8):
1>	+---
1> 0	| LowPart
1> 4	| HighPart
1>	+---
1>
1>class _LARGE_INTEGER::<unnamed-tag>	size(8):
1>	+---
1> 0	| LowPart
1> 4	| HighPart
1>	+---
1>
1>class _LARGE_INTEGER	size(8):
1>	+---
1> 0	| LowPart
1> 4	| HighPart
1> 0	| <unnamed-type-u> u
1> 0	| QuadPart
1>	+---
1>
1>class _ULARGE_INTEGER::<unnamed-tag>	size(8):
1>	+---
1> 0	| LowPart
1> 4	| HighPart
1>	+---
1>
1>class _ULARGE_INTEGER::<unnamed-tag>	size(8):
1>	+---
1> 0	| LowPart
1> 4	| HighPart
1>	+---
1>
1>class _ULARGE_INTEGER	size(8):
1>	+---
1> 0	| LowPart
1> 4	| HighPart
1> 0	| <unnamed-type-u> u
1> 0	| QuadPart
1>	+---
1>
1>class _LUID	size(8):
1>	+---
1> 0	| LowPart
1> 4	| HighPart
1>	+---
1>
1>class _LIST_ENTRY	size(8):
1>	+---
1> 0	| Flink
1> 4	| Blink
1>	+---
1>
1>class _SINGLE_LIST_ENTRY	size(4):
1>	+---
1> 0	| Next
1>	+---
1>
1>class LIST_ENTRY32	size(8):
1>	+---
1> 0	| Flink
1> 4	| Blink
1>	+---
1>
1>class LIST_ENTRY64	size(16):
1>	+---
1> 0	| Flink
1> 8	| Blink
1>	+---
1>
1>class _GUID	size(16):
1>	+---
1> 0	| Data1
1> 4	| Data2
1> 6	| Data3
1> 8	| Data4
1>	+---
1>
1>class _OBJECTID	size(20):
1>	+---
1> 0	| _GUID Lineage
1>16	| Uniquifier
1>	+---
1>
1>class _ENUM_FLAG_INTEGER_FOR_SIZE<1>	size(1):
1>	+---
1>	+---
1>
1>class _ENUM_FLAG_INTEGER_FOR_SIZE<2>	size(1):
1>	+---
1>	+---
1>
1>class _ENUM_FLAG_INTEGER_FOR_SIZE<4>	size(1):
1>	+---
1>	+---
1>
1>class _ENUM_FLAG_INTEGER_FOR_SIZE<8>	size(1):
1>	+---
1>	+---
1>
1>class _M128A	size(16):
1>	+---
1> 0	| Low
1> 8	| High
1>	+---
1>
1>class _XSAVE_FORMAT	size(512):
1>	+---
1> 0	| ControlWord
1> 2	| StatusWord
1> 4	| TagWord
1> 5	| Reserved1
1> 6	| ErrorOpcode
1> 8	| ErrorOffset
1>12	| ErrorSelector
1>14	| Reserved2
1>16	| DataOffset
1>20	| DataSelector
1>22	| Reserved3
1>24	| MxCsr
1>28	| MxCsr_Mask
1>32	| FloatRegisters
1>160	| XmmRegisters
1>288	| Reserved4
1>	+---
1>
1>class _XSAVE_AREA_HEADER	size(64):
1>	+---
1> 0	| Mask
1> 8	| CompactionMask
1>16	| Reserved2
1>	+---
1>
1>class _XSAVE_AREA	size(576):
1>	+---
1> 0	| _XSAVE_FORMAT LegacyState
1>512	| _XSAVE_AREA_HEADER Header
1>	+---
1>
1>class _XSTATE_CONTEXT	size(32):
1>	+---
1> 0	| Mask
1> 8	| Length
1>12	| Reserved1
1>16	| Area
1>20	| Reserved2
1>24	| Buffer
1>28	| Reserved3
1>	+---
1>
1>class _SCOPE_TABLE_AMD64::<unnamed-tag>	size(16):
1>	+---
1> 0	| BeginAddress
1> 4	| EndAddress
1> 8	| HandlerAddress
1>12	| JumpTarget
1>	+---
1>
1>class _SCOPE_TABLE_AMD64	size(20):
1>	+---
1> 0	| Count
1> 4	| ScopeRecord
1>	+---
1>
1>class _SCOPE_TABLE_ARM::<unnamed-tag>	size(16):
1>	+---
1> 0	| BeginAddress
1> 4	| EndAddress
1> 8	| HandlerAddress
1>12	| JumpTarget
1>	+---
1>
1>class _SCOPE_TABLE_ARM	size(20):
1>	+---
1> 0	| Count
1> 4	| ScopeRecord
1>	+---
1>
1>class _SCOPE_TABLE_ARM64::<unnamed-tag>	size(16):
1>	+---
1> 0	| BeginAddress
1> 4	| EndAddress
1> 8	| HandlerAddress
1>12	| JumpTarget
1>	+---
1>
1>class _SCOPE_TABLE_ARM64	size(20):
1>	+---
1> 0	| Count
1> 4	| ScopeRecord
1>	+---
1>
1>class _KNONVOLATILE_CONTEXT_POINTERS_ARM64	size(80):
1>	+---
1> 0	| X19
1> 4	| X20
1> 8	| X21
1>12	| X22
1>16	| X23
1>20	| X24
1>24	| X25
1>28	| X26
1>32	| X27
1>36	| X28
1>40	| Fp
1>44	| Lr
1>48	| D8
1>52	| D9
1>56	| D10
1>60	| D11
1>64	| D12
1>68	| D13
1>72	| D14
1>76	| D15
1>	+---
1>
1>class _FLOATING_SAVE_AREA	size(112):
1>	+---
1> 0	| ControlWord
1> 4	| StatusWord
1> 8	| TagWord
1>12	| ErrorOffset
1>16	| ErrorSelector
1>20	| DataOffset
1>24	| DataSelector
1>28	| RegisterArea
1>108	| Spare0
1>	+---
1>
1>class _CONTEXT	size(716):
1>	+---
1> 0	| ContextFlags
1> 4	| Dr0
1> 8	| Dr1
1>12	| Dr2
1>16	| Dr3
1>20	| Dr6
1>24	| Dr7
1>28	| _FLOATING_SAVE_AREA FloatSave
1>140	| SegGs
1>144	| SegFs
1>148	| SegEs
1>152	| SegDs
1>156	| Edi
1>160	| Esi
1>164	| Ebx
1>168	| Edx
1>172	| Ecx
1>176	| Eax
1>180	| Ebp
1>184	| Eip
1>188	| SegCs
1>192	| EFlags
1>196	| Esp
1>200	| SegSs
1>204	| ExtendedRegisters
1>	+---
1>
1>class _LDT_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| BaseMid
1> 1	| Flags1
1> 2	| Flags2
1> 3	| BaseHi
1>	+---
1>
1>class _LDT_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| BaseMid (bitstart=0,nbits=8)
1> 0.	| Type (bitstart=8,nbits=5)
1> 0.	| Dpl (bitstart=13,nbits=2)
1> 0.	| Pres (bitstart=15,nbits=1)
1> 0.	| LimitHi (bitstart=16,nbits=4)
1> 0.	| Sys (bitstart=20,nbits=1)
1> 0.	| Reserved_0 (bitstart=21,nbits=1)
1> 0.	| Default_Big (bitstart=22,nbits=1)
1> 0.	| Granularity (bitstart=23,nbits=1)
1> 0.	| BaseHi (bitstart=24,nbits=8)
1>	+---
1>
1>class _LDT_ENTRY::<unnamed-tag>	size(4):
1>	+---
1> 0	| <unnamed-type-Bytes> Bytes
1> 0	| <unnamed-type-Bits> Bits
1>	+---
1>
1>class _LDT_ENTRY	size(8):
1>	+---
1> 0	| LimitLow
1> 2	| BaseLow
1> 4	| <unnamed-type-HighWord> HighWord
1>	+---
1>
1>class _WOW64_FLOATING_SAVE_AREA	size(112):
1>	+---
1> 0	| ControlWord
1> 4	| StatusWord
1> 8	| TagWord
1>12	| ErrorOffset
1>16	| ErrorSelector
1>20	| DataOffset
1>24	| DataSelector
1>28	| RegisterArea
1>108	| Cr0NpxState
1>	+---
1>
1>class _WOW64_CONTEXT	size(716):
1>	+---
1> 0	| ContextFlags
1> 4	| Dr0
1> 8	| Dr1
1>12	| Dr2
1>16	| Dr3
1>20	| Dr6
1>24	| Dr7
1>28	| _WOW64_FLOATING_SAVE_AREA FloatSave
1>140	| SegGs
1>144	| SegFs
1>148	| SegEs
1>152	| SegDs
1>156	| Edi
1>160	| Esi
1>164	| Ebx
1>168	| Edx
1>172	| Ecx
1>176	| Eax
1>180	| Ebp
1>184	| Eip
1>188	| SegCs
1>192	| EFlags
1>196	| Esp
1>200	| SegSs
1>204	| ExtendedRegisters
1>	+---
1>
1>class _WOW64_LDT_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| BaseMid
1> 1	| Flags1
1> 2	| Flags2
1> 3	| BaseHi
1>	+---
1>
1>class _WOW64_LDT_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| BaseMid (bitstart=0,nbits=8)
1> 0.	| Type (bitstart=8,nbits=5)
1> 0.	| Dpl (bitstart=13,nbits=2)
1> 0.	| Pres (bitstart=15,nbits=1)
1> 0.	| LimitHi (bitstart=16,nbits=4)
1> 0.	| Sys (bitstart=20,nbits=1)
1> 0.	| Reserved_0 (bitstart=21,nbits=1)
1> 0.	| Default_Big (bitstart=22,nbits=1)
1> 0.	| Granularity (bitstart=23,nbits=1)
1> 0.	| BaseHi (bitstart=24,nbits=8)
1>	+---
1>
1>class _WOW64_LDT_ENTRY::<unnamed-tag>	size(4):
1>	+---
1> 0	| <unnamed-type-Bytes> Bytes
1> 0	| <unnamed-type-Bits> Bits
1>	+---
1>
1>class _WOW64_LDT_ENTRY	size(8):
1>	+---
1> 0	| LimitLow
1> 2	| BaseLow
1> 4	| <unnamed-type-HighWord> HighWord
1>	+---
1>
1>class _WOW64_DESCRIPTOR_TABLE_ENTRY	size(12):
1>	+---
1> 0	| Selector
1> 4	| _WOW64_LDT_ENTRY Descriptor
1>	+---
1>
1>class _EXCEPTION_RECORD	size(80):
1>	+---
1> 0	| ExceptionCode
1> 4	| ExceptionFlags
1> 8	| ExceptionRecord
1>12	| ExceptionAddress
1>16	| NumberParameters
1>20	| ExceptionInformation
1>	+---
1>
1>class _EXCEPTION_RECORD32	size(80):
1>	+---
1> 0	| ExceptionCode
1> 4	| ExceptionFlags
1> 8	| ExceptionRecord
1>12	| ExceptionAddress
1>16	| NumberParameters
1>20	| ExceptionInformation
1>	+---
1>
1>class _EXCEPTION_RECORD64	size(152):
1>	+---
1> 0	| ExceptionCode
1> 4	| ExceptionFlags
1> 8	| ExceptionRecord
1>16	| ExceptionAddress
1>24	| NumberParameters
1>28	| __unusedAlignment
1>32	| ExceptionInformation
1>	+---
1>
1>class _EXCEPTION_POINTERS	size(8):
1>	+---
1> 0	| ExceptionRecord
1> 4	| ContextRecord
1>	+---
1>
1>class _GENERIC_MAPPING	size(16):
1>	+---
1> 0	| GenericRead
1> 4	| GenericWrite
1> 8	| GenericExecute
1>12	| GenericAll
1>	+---
1>
1>class _LUID_AND_ATTRIBUTES	size(12):
1>	+---
1> 0	| _LUID Luid
1> 8	| Attributes
1>	+---
1>
1>class _SID_IDENTIFIER_AUTHORITY	size(6):
1>	+---
1> 0	| Value
1>	+---
1>
1>class _SID	size(12):
1>	+---
1> 0	| Revision
1> 1	| SubAuthorityCount
1> 2	| _SID_IDENTIFIER_AUTHORITY IdentifierAuthority
1> 8	| SubAuthority
1>	+---
1>
1>class _SE_SID	size(68):
1>	+---
1> 0	| _SID Sid
1> 0	| Buffer
1>	+---
1>
1>class _SID_AND_ATTRIBUTES	size(8):
1>	+---
1> 0	| Sid
1> 4	| Attributes
1>	+---
1>
1>class _SID_AND_ATTRIBUTES_HASH	size(136):
1>	+---
1> 0	| SidCount
1> 4	| SidAttr
1> 8	| Hash
1>	+---
1>
1>class _ACL	size(8):
1>	+---
1> 0	| AclRevision
1> 1	| Sbz1
1> 2	| AclSize
1> 4	| AceCount
1> 6	| Sbz2
1>	+---
1>
1>class _ACE_HEADER	size(4):
1>	+---
1> 0	| AceType
1> 1	| AceFlags
1> 2	| AceSize
1>	+---
1>
1>class _ACCESS_ALLOWED_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _ACCESS_DENIED_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_AUDIT_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_ALARM_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_RESOURCE_ATTRIBUTE_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_SCOPED_POLICY_ID_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_MANDATORY_LABEL_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_PROCESS_TRUST_LABEL_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_ACCESS_FILTER_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _ACCESS_ALLOWED_OBJECT_ACE	size(48):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| Flags
1>12	| _GUID ObjectType
1>28	| _GUID InheritedObjectType
1>44	| SidStart
1>	+---
1>
1>class _ACCESS_DENIED_OBJECT_ACE	size(48):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| Flags
1>12	| _GUID ObjectType
1>28	| _GUID InheritedObjectType
1>44	| SidStart
1>	+---
1>
1>class _SYSTEM_AUDIT_OBJECT_ACE	size(48):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| Flags
1>12	| _GUID ObjectType
1>28	| _GUID InheritedObjectType
1>44	| SidStart
1>	+---
1>
1>class _SYSTEM_ALARM_OBJECT_ACE	size(48):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| Flags
1>12	| _GUID ObjectType
1>28	| _GUID InheritedObjectType
1>44	| SidStart
1>	+---
1>
1>class _ACCESS_ALLOWED_CALLBACK_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _ACCESS_DENIED_CALLBACK_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_AUDIT_CALLBACK_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _SYSTEM_ALARM_CALLBACK_ACE	size(12):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| SidStart
1>	+---
1>
1>class _ACCESS_ALLOWED_CALLBACK_OBJECT_ACE	size(48):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| Flags
1>12	| _GUID ObjectType
1>28	| _GUID InheritedObjectType
1>44	| SidStart
1>	+---
1>
1>class _ACCESS_DENIED_CALLBACK_OBJECT_ACE	size(48):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| Flags
1>12	| _GUID ObjectType
1>28	| _GUID InheritedObjectType
1>44	| SidStart
1>	+---
1>
1>class _SYSTEM_AUDIT_CALLBACK_OBJECT_ACE	size(48):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| Flags
1>12	| _GUID ObjectType
1>28	| _GUID InheritedObjectType
1>44	| SidStart
1>	+---
1>
1>class _SYSTEM_ALARM_CALLBACK_OBJECT_ACE	size(48):
1>	+---
1> 0	| _ACE_HEADER Header
1> 4	| Mask
1> 8	| Flags
1>12	| _GUID ObjectType
1>28	| _GUID InheritedObjectType
1>44	| SidStart
1>	+---
1>
1>class _ACL_REVISION_INFORMATION	size(4):
1>	+---
1> 0	| AclRevision
1>	+---
1>
1>class _ACL_SIZE_INFORMATION	size(12):
1>	+---
1> 0	| AceCount
1> 4	| AclBytesInUse
1> 8	| AclBytesFree
1>	+---
1>
1>class _SECURITY_DESCRIPTOR_RELATIVE	size(20):
1>	+---
1> 0	| Revision
1> 1	| Sbz1
1> 2	| Control
1> 4	| Owner
1> 8	| Group
1>12	| Sacl
1>16	| Dacl
1>	+---
1>
1>class _SECURITY_DESCRIPTOR	size(20):
1>	+---
1> 0	| Revision
1> 1	| Sbz1
1> 2	| Control
1> 4	| Owner
1> 8	| Group
1>12	| Sacl
1>16	| Dacl
1>	+---
1>
1>class _SECURITY_OBJECT_AI_PARAMS	size(8):
1>	+---
1> 0	| Size
1> 4	| ConstraintMask
1>	+---
1>
1>class _OBJECT_TYPE_LIST	size(8):
1>	+---
1> 0	| Level
1> 2	| Sbz
1> 4	| ObjectType
1>	+---
1>
1>class _PRIVILEGE_SET	size(20):
1>	+---
1> 0	| PrivilegeCount
1> 4	| Control
1> 8	| Privilege
1>	+---
1>
1>class _ACCESS_REASONS	size(128):
1>	+---
1> 0	| Data
1>	+---
1>
1>class _SE_SECURITY_DESCRIPTOR	size(12):
1>	+---
1> 0	| Size
1> 4	| Flags
1> 8	| SecurityDescriptor
1>	+---
1>
1>class _SE_ACCESS_REQUEST	size(32):
1>	+---
1> 0	| Size
1> 4	| SeSecurityDescriptor
1> 8	| DesiredAccess
1>12	| PreviouslyGrantedAccess
1>16	| PrincipalSelfSid
1>20	| GenericMapping
1>24	| ObjectTypeListCount
1>28	| ObjectTypeList
1>	+---
1>
1>class _SE_ACCESS_REPLY	size(24):
1>	+---
1> 0	| Size
1> 4	| ResultListCount
1> 8	| GrantedAccess
1>12	| AccessStatus
1>16	| AccessReason
1>20	| Privileges
1>	+---
1>
1>class _TOKEN_USER	size(8):
1>	+---
1> 0	| _SID_AND_ATTRIBUTES User
1>	+---
1>
1>class _SE_TOKEN_USER::<unnamed-tag>	size(8):
1>	+---
1> 0	| _TOKEN_USER TokenUser
1> 0	| _SID_AND_ATTRIBUTES User
1>	+---
1>
1>class _SE_TOKEN_USER::<unnamed-tag>	size(68):
1>	+---
1> 0	| _SID Sid
1> 0	| Buffer
1>	+---
1>
1>class _SE_TOKEN_USER	size(76):
1>	+---
1> 0	| _TOKEN_USER TokenUser
1> 0	| _SID_AND_ATTRIBUTES User
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| _SID Sid
1> 8	| Buffer
1>	+---
1>
1>class _TOKEN_GROUPS	size(12):
1>	+---
1> 0	| GroupCount
1> 4	| Groups
1>	+---
1>
1>class _TOKEN_PRIVILEGES	size(16):
1>	+---
1> 0	| PrivilegeCount
1> 4	| Privileges
1>	+---
1>
1>class _TOKEN_OWNER	size(4):
1>	+---
1> 0	| Owner
1>	+---
1>
1>class _TOKEN_PRIMARY_GROUP	size(4):
1>	+---
1> 0	| PrimaryGroup
1>	+---
1>
1>class _TOKEN_DEFAULT_DACL	size(4):
1>	+---
1> 0	| DefaultDacl
1>	+---
1>
1>class _TOKEN_USER_CLAIMS	size(4):
1>	+---
1> 0	| UserClaims
1>	+---
1>
1>class _TOKEN_DEVICE_CLAIMS	size(4):
1>	+---
1> 0	| DeviceClaims
1>	+---
1>
1>class _TOKEN_GROUPS_AND_PRIVILEGES	size(44):
1>	+---
1> 0	| SidCount
1> 4	| SidLength
1> 8	| Sids
1>12	| RestrictedSidCount
1>16	| RestrictedSidLength
1>20	| RestrictedSids
1>24	| PrivilegeCount
1>28	| PrivilegeLength
1>32	| Privileges
1>36	| _LUID AuthenticationId
1>	+---
1>
1>class _TOKEN_LINKED_TOKEN	size(4):
1>	+---
1> 0	| LinkedToken
1>	+---
1>
1>class _TOKEN_ELEVATION	size(4):
1>	+---
1> 0	| TokenIsElevated
1>	+---
1>
1>class _TOKEN_MANDATORY_LABEL	size(8):
1>	+---
1> 0	| _SID_AND_ATTRIBUTES Label
1>	+---
1>
1>class _TOKEN_MANDATORY_POLICY	size(4):
1>	+---
1> 0	| Policy
1>	+---
1>
1>class _TOKEN_ACCESS_INFORMATION	size(56):
1>	+---
1> 0	| SidHash
1> 4	| RestrictedSidHash
1> 8	| Privileges
1>12	| _LUID AuthenticationId
1>20	| _TOKEN_TYPE TokenType
1>24	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
1>28	| _TOKEN_MANDATORY_POLICY MandatoryPolicy
1>32	| Flags
1>36	| AppContainerNumber
1>40	| PackageSid
1>44	| CapabilitiesHash
1>48	| TrustLevelSid
1>52	| SecurityAttributes
1>	+---
1>
1>class _TOKEN_AUDIT_POLICY	size(30):
1>	+---
1> 0	| PerUserPolicy
1>	+---
1>
1>class _TOKEN_SOURCE	size(16):
1>	+---
1> 0	| SourceName
1> 8	| _LUID SourceIdentifier
1>	+---
1>
1>class _TOKEN_STATISTICS	size(56):
1>	+---
1> 0	| _LUID TokenId
1> 8	| _LUID AuthenticationId
1>16	| _LARGE_INTEGER ExpirationTime
1>24	| _TOKEN_TYPE TokenType
1>28	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
1>32	| DynamicCharged
1>36	| DynamicAvailable
1>40	| GroupCount
1>44	| PrivilegeCount
1>48	| _LUID ModifiedId
1>	+---
1>
1>class _TOKEN_CONTROL	size(40):
1>	+---
1> 0	| _LUID TokenId
1> 8	| _LUID AuthenticationId
1>16	| _LUID ModifiedId
1>24	| _TOKEN_SOURCE TokenSource
1>	+---
1>
1>class _TOKEN_ORIGIN	size(8):
1>	+---
1> 0	| _LUID OriginatingLogonSession
1>	+---
1>
1>class _TOKEN_APPCONTAINER_INFORMATION	size(4):
1>	+---
1> 0	| TokenAppContainer
1>	+---
1>
1>class _TOKEN_SID_INFORMATION	size(4):
1>	+---
1> 0	| Sid
1>	+---
1>
1>class _TOKEN_BNO_ISOLATION_INFORMATION	size(8):
1>	+---
1> 0	| IsolationPrefix
1> 4	| IsolationEnabled
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _CLAIM_SECURITY_ATTRIBUTE_FQBN_VALUE	size(16):
1>	+---
1> 0	| Version
1> 8	| Name
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class _CLAIM_SECURITY_ATTRIBUTE_OCTET_STRING_VALUE	size(8):
1>	+---
1> 0	| pValue
1> 4	| ValueLength
1>	+---
1>
1>class _CLAIM_SECURITY_ATTRIBUTE_V1::<unnamed-tag>	size(4):
1>	+---
1> 0	| pInt64
1> 0	| pUint64
1> 0	| ppString
1> 0	| pFqbn
1> 0	| pOctetString
1>	+---
1>
1>class _CLAIM_SECURITY_ATTRIBUTE_V1	size(20):
1>	+---
1> 0	| Name
1> 4	| ValueType
1> 6	| Reserved
1> 8	| Flags
1>12	| ValueCount
1>16	| <unnamed-type-Values> Values
1>	+---
1>
1>class _CLAIM_SECURITY_ATTRIBUTE_RELATIVE_V1::<unnamed-tag>	size(4):
1>	+---
1> 0	| pInt64
1> 0	| pUint64
1> 0	| ppString
1> 0	| pFqbn
1> 0	| pOctetString
1>	+---
1>
1>class _CLAIM_SECURITY_ATTRIBUTE_RELATIVE_V1	size(20):
1>	+---
1> 0	| Name
1> 4	| ValueType
1> 6	| Reserved
1> 8	| Flags
1>12	| ValueCount
1>16	| <unnamed-type-Values> Values
1>	+---
1>
1>class _CLAIM_SECURITY_ATTRIBUTES_INFORMATION::<unnamed-tag>	size(4):
1>	+---
1> 0	| pAttributeV1
1>	+---
1>
1>class _CLAIM_SECURITY_ATTRIBUTES_INFORMATION	size(12):
1>	+---
1> 0	| Version
1> 2	| Reserved
1> 4	| AttributeCount
1> 8	| <unnamed-type-Attribute> Attribute
1>	+---
1>
1>class _SECURITY_QUALITY_OF_SERVICE	size(12):
1>	+---
1> 0	| Length
1> 4	| _SECURITY_IMPERSONATION_LEVEL ImpersonationLevel
1> 8	| ContextTrackingMode
1> 9	| EffectiveOnly
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _SE_IMPERSONATION_STATE	size(12):
1>	+---
1> 0	| Token
1> 4	| CopyOnOpen
1> 5	| EffectiveOnly
1>  	| <alignment member> (size=2)
1> 8	| _SECURITY_IMPERSONATION_LEVEL Level
1>	+---
1>
1>class _SECURITY_CAPABILITIES	size(16):
1>	+---
1> 0	| AppContainerSid
1> 4	| Capabilities
1> 8	| CapabilityCount
1>12	| Reserved
1>	+---
1>
1>class _JOB_SET_ARRAY	size(12):
1>	+---
1> 0	| JobHandle
1> 4	| MemberLevel
1> 8	| Flags
1>	+---
1>
1>class _EXCEPTION_REGISTRATION_RECORD	size(8):
1>	+---
1> 0	| Next
1> 4	| Handler
1>	+---
1>
1>class _NT_TIB::<unnamed-tag>	size(4):
1>	+---
1> 0	| FiberData
1> 0	| Version
1>	+---
1>
1>class _NT_TIB	size(28):
1>	+---
1> 0	| ExceptionList
1> 4	| StackBase
1> 8	| StackLimit
1>12	| SubSystemTib
1>  	| <unnamed-tag> <alignment member> (size=16)
1>16	| FiberData
1>16	| Version
1>20	| ArbitraryUserPointer
1>24	| Self
1>	+---
1>
1>class _NT_TIB32::<unnamed-tag>	size(4):
1>	+---
1> 0	| FiberData
1> 0	| Version
1>	+---
1>
1>class _NT_TIB32	size(28):
1>	+---
1> 0	| ExceptionList
1> 4	| StackBase
1> 8	| StackLimit
1>12	| SubSystemTib
1>  	| <unnamed-tag> <alignment member> (size=16)
1>16	| FiberData
1>16	| Version
1>20	| ArbitraryUserPointer
1>24	| Self
1>	+---
1>
1>class _NT_TIB64::<unnamed-tag>	size(8):
1>	+---
1> 0	| FiberData
1> 0	| Version
1>	+---
1>
1>class _NT_TIB64	size(56):
1>	+---
1> 0	| ExceptionList
1> 8	| StackBase
1>16	| StackLimit
1>24	| SubSystemTib
1>  	| <unnamed-tag> <alignment member> (size=32)
1>32	| FiberData
1>32	| Version
1>40	| ArbitraryUserPointer
1>48	| Self
1>	+---
1>
1>class _UMS_CREATE_THREAD_ATTRIBUTES	size(12):
1>	+---
1> 0	| UmsVersion
1> 4	| UmsContext
1> 8	| UmsCompletionList
1>	+---
1>
1>class _WOW64_ARCHITECTURE_INFORMATION	size(4):
1>	+---
1> 0.	| Machine (bitstart=0,nbits=16)
1> 0.	| KernelMode (bitstart=16,nbits=1)
1> 0.	| UserMode (bitstart=17,nbits=1)
1> 0.	| Native (bitstart=18,nbits=1)
1> 0.	| Process (bitstart=19,nbits=1)
1> 0.	| ReservedZero0 (bitstart=20,nbits=12)
1>	+---
1>
1>class _QUOTA_LIMITS	size(32):
1>	+---
1> 0	| PagedPoolLimit
1> 4	| NonPagedPoolLimit
1> 8	| MinimumWorkingSetSize
1>12	| MaximumWorkingSetSize
1>16	| PagefileLimit
1>  	| <alignment member> (size=4)
1>24	| _LARGE_INTEGER TimeLimit
1>	+---
1>
1>class _RATE_QUOTA_LIMIT::<unnamed-tag>	size(4):
1>	+---
1> 0.	| RatePercent (bitstart=0,nbits=7)
1> 0.	| Reserved0 (bitstart=7,nbits=25)
1>	+---
1>
1>class _RATE_QUOTA_LIMIT	size(4):
1>	+---
1> 0	| RateData
1> 0.	| RatePercent (bitstart=0,nbits=7)
1> 0.	| Reserved0 (bitstart=7,nbits=25)
1>	+---
1>
1>class _QUOTA_LIMITS_EX	size(56):
1>	+---
1> 0	| PagedPoolLimit
1> 4	| NonPagedPoolLimit
1> 8	| MinimumWorkingSetSize
1>12	| MaximumWorkingSetSize
1>16	| PagefileLimit
1>  	| <alignment member> (size=4)
1>24	| _LARGE_INTEGER TimeLimit
1>32	| WorkingSetLimit
1>36	| Reserved2
1>40	| Reserved3
1>44	| Reserved4
1>48	| Flags
1>52	| _RATE_QUOTA_LIMIT CpuRateLimit
1>	+---
1>
1>class _IO_COUNTERS	size(48):
1>	+---
1> 0	| ReadOperationCount
1> 8	| WriteOperationCount
1>16	| OtherOperationCount
1>24	| ReadTransferCount
1>32	| WriteTransferCount
1>40	| OtherTransferCount
1>	+---
1>
1>class _PROCESS_MITIGATION_ASLR_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
1> 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
1> 0.	| EnableHighEntropy (bitstart=2,nbits=1)
1> 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_ASLR_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
1> 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
1> 0.	| EnableHighEntropy (bitstart=2,nbits=1)
1> 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_ASLR_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| EnableBottomUpRandomization (bitstart=0,nbits=1)
1> 0.	| EnableForceRelocateImages (bitstart=1,nbits=1)
1> 0.	| EnableHighEntropy (bitstart=2,nbits=1)
1> 0.	| DisallowStrippedImages (bitstart=3,nbits=1)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_DEP_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| Enable (bitstart=0,nbits=1)
1> 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_DEP_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| Enable (bitstart=0,nbits=1)
1> 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_DEP_POLICY	size(8):
1>	+---
1> 0	| Flags
1> 0.	| Enable (bitstart=0,nbits=1)
1> 0.	| DisableAtlThunkEmulation (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1> 4	| Permanent
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
1> 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
1> 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_STRICT_HANDLE_CHECK_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| RaiseExceptionOnInvalidHandleReference (bitstart=0,nbits=1)
1> 0.	| HandleExceptionsPermanentlyEnabled (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
1> 0.	| AuditDisallowWin32kSystemCalls (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
1> 0.	| AuditDisallowWin32kSystemCalls (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_SYSTEM_CALL_DISABLE_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| DisallowWin32kSystemCalls (bitstart=0,nbits=1)
1> 0.	| AuditDisallowWin32kSystemCalls (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
1> 0.	| ReservedFlags (bitstart=1,nbits=31)
1>	+---
1>
1>class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
1> 0.	| ReservedFlags (bitstart=1,nbits=31)
1>	+---
1>
1>class _PROCESS_MITIGATION_EXTENSION_POINT_DISABLE_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| DisableExtensionPoints (bitstart=0,nbits=1)
1> 0.	| ReservedFlags (bitstart=1,nbits=31)
1>	+---
1>
1>class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
1> 0.	| AllowThreadOptOut (bitstart=1,nbits=1)
1> 0.	| AllowRemoteDowngrade (bitstart=2,nbits=1)
1> 0.	| AuditProhibitDynamicCode (bitstart=3,nbits=1)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
1> 0.	| AllowThreadOptOut (bitstart=1,nbits=1)
1> 0.	| AllowRemoteDowngrade (bitstart=2,nbits=1)
1> 0.	| AuditProhibitDynamicCode (bitstart=3,nbits=1)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_DYNAMIC_CODE_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| ProhibitDynamicCode (bitstart=0,nbits=1)
1> 0.	| AllowThreadOptOut (bitstart=1,nbits=1)
1> 0.	| AllowRemoteDowngrade (bitstart=2,nbits=1)
1> 0.	| AuditProhibitDynamicCode (bitstart=3,nbits=1)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
1> 0.	| EnableExportSuppression (bitstart=1,nbits=1)
1> 0.	| StrictMode (bitstart=2,nbits=1)
1> 0.	| ReservedFlags (bitstart=3,nbits=29)
1>	+---
1>
1>class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
1> 0.	| EnableExportSuppression (bitstart=1,nbits=1)
1> 0.	| StrictMode (bitstart=2,nbits=1)
1> 0.	| ReservedFlags (bitstart=3,nbits=29)
1>	+---
1>
1>class _PROCESS_MITIGATION_CONTROL_FLOW_GUARD_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| EnableControlFlowGuard (bitstart=0,nbits=1)
1> 0.	| EnableExportSuppression (bitstart=1,nbits=1)
1> 0.	| StrictMode (bitstart=2,nbits=1)
1> 0.	| ReservedFlags (bitstart=3,nbits=29)
1>	+---
1>
1>class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
1> 0.	| StoreSignedOnly (bitstart=1,nbits=1)
1> 0.	| MitigationOptIn (bitstart=2,nbits=1)
1> 0.	| AuditMicrosoftSignedOnly (bitstart=3,nbits=1)
1> 0.	| AuditStoreSignedOnly (bitstart=4,nbits=1)
1> 0.	| ReservedFlags (bitstart=5,nbits=27)
1>	+---
1>
1>class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
1> 0.	| StoreSignedOnly (bitstart=1,nbits=1)
1> 0.	| MitigationOptIn (bitstart=2,nbits=1)
1> 0.	| AuditMicrosoftSignedOnly (bitstart=3,nbits=1)
1> 0.	| AuditStoreSignedOnly (bitstart=4,nbits=1)
1> 0.	| ReservedFlags (bitstart=5,nbits=27)
1>	+---
1>
1>class _PROCESS_MITIGATION_BINARY_SIGNATURE_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| MicrosoftSignedOnly (bitstart=0,nbits=1)
1> 0.	| StoreSignedOnly (bitstart=1,nbits=1)
1> 0.	| MitigationOptIn (bitstart=2,nbits=1)
1> 0.	| AuditMicrosoftSignedOnly (bitstart=3,nbits=1)
1> 0.	| AuditStoreSignedOnly (bitstart=4,nbits=1)
1> 0.	| ReservedFlags (bitstart=5,nbits=27)
1>	+---
1>
1>class _PROCESS_MITIGATION_FONT_DISABLE_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
1> 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_FONT_DISABLE_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
1> 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_FONT_DISABLE_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| DisableNonSystemFonts (bitstart=0,nbits=1)
1> 0.	| AuditNonSystemFontLoading (bitstart=1,nbits=1)
1> 0.	| ReservedFlags (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| NoRemoteImages (bitstart=0,nbits=1)
1> 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
1> 0.	| PreferSystem32Images (bitstart=2,nbits=1)
1> 0.	| AuditNoRemoteImages (bitstart=3,nbits=1)
1> 0.	| AuditNoLowMandatoryLabelImages (bitstart=4,nbits=1)
1> 0.	| ReservedFlags (bitstart=5,nbits=27)
1>	+---
1>
1>class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| NoRemoteImages (bitstart=0,nbits=1)
1> 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
1> 0.	| PreferSystem32Images (bitstart=2,nbits=1)
1> 0.	| AuditNoRemoteImages (bitstart=3,nbits=1)
1> 0.	| AuditNoLowMandatoryLabelImages (bitstart=4,nbits=1)
1> 0.	| ReservedFlags (bitstart=5,nbits=27)
1>	+---
1>
1>class _PROCESS_MITIGATION_IMAGE_LOAD_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| NoRemoteImages (bitstart=0,nbits=1)
1> 0.	| NoLowMandatoryLabelImages (bitstart=1,nbits=1)
1> 0.	| PreferSystem32Images (bitstart=2,nbits=1)
1> 0.	| AuditNoRemoteImages (bitstart=3,nbits=1)
1> 0.	| AuditNoLowMandatoryLabelImages (bitstart=4,nbits=1)
1> 0.	| ReservedFlags (bitstart=5,nbits=27)
1>	+---
1>
1>class _PROCESS_MITIGATION_SYSTEM_CALL_FILTER_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| FilterId (bitstart=0,nbits=4)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_SYSTEM_CALL_FILTER_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| FilterId (bitstart=0,nbits=4)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_SYSTEM_CALL_FILTER_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| FilterId (bitstart=0,nbits=4)
1> 0.	| ReservedFlags (bitstart=4,nbits=28)
1>	+---
1>
1>class _PROCESS_MITIGATION_PAYLOAD_RESTRICTION_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| EnableExportAddressFilter (bitstart=0,nbits=1)
1> 0.	| AuditExportAddressFilter (bitstart=1,nbits=1)
1> 0.	| EnableExportAddressFilterPlus (bitstart=2,nbits=1)
1> 0.	| AuditExportAddressFilterPlus (bitstart=3,nbits=1)
1> 0.	| EnableImportAddressFilter (bitstart=4,nbits=1)
1> 0.	| AuditImportAddressFilter (bitstart=5,nbits=1)
1> 0.	| EnableRopStackPivot (bitstart=6,nbits=1)
1> 0.	| AuditRopStackPivot (bitstart=7,nbits=1)
1> 0.	| EnableRopCallerCheck (bitstart=8,nbits=1)
1> 0.	| AuditRopCallerCheck (bitstart=9,nbits=1)
1> 0.	| EnableRopSimExec (bitstart=10,nbits=1)
1> 0.	| AuditRopSimExec (bitstart=11,nbits=1)
1> 0.	| ReservedFlags (bitstart=12,nbits=20)
1>	+---
1>
1>class _PROCESS_MITIGATION_PAYLOAD_RESTRICTION_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| EnableExportAddressFilter (bitstart=0,nbits=1)
1> 0.	| AuditExportAddressFilter (bitstart=1,nbits=1)
1> 0.	| EnableExportAddressFilterPlus (bitstart=2,nbits=1)
1> 0.	| AuditExportAddressFilterPlus (bitstart=3,nbits=1)
1> 0.	| EnableImportAddressFilter (bitstart=4,nbits=1)
1> 0.	| AuditImportAddressFilter (bitstart=5,nbits=1)
1> 0.	| EnableRopStackPivot (bitstart=6,nbits=1)
1> 0.	| AuditRopStackPivot (bitstart=7,nbits=1)
1> 0.	| EnableRopCallerCheck (bitstart=8,nbits=1)
1> 0.	| AuditRopCallerCheck (bitstart=9,nbits=1)
1> 0.	| EnableRopSimExec (bitstart=10,nbits=1)
1> 0.	| AuditRopSimExec (bitstart=11,nbits=1)
1> 0.	| ReservedFlags (bitstart=12,nbits=20)
1>	+---
1>
1>class _PROCESS_MITIGATION_PAYLOAD_RESTRICTION_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| EnableExportAddressFilter (bitstart=0,nbits=1)
1> 0.	| AuditExportAddressFilter (bitstart=1,nbits=1)
1> 0.	| EnableExportAddressFilterPlus (bitstart=2,nbits=1)
1> 0.	| AuditExportAddressFilterPlus (bitstart=3,nbits=1)
1> 0.	| EnableImportAddressFilter (bitstart=4,nbits=1)
1> 0.	| AuditImportAddressFilter (bitstart=5,nbits=1)
1> 0.	| EnableRopStackPivot (bitstart=6,nbits=1)
1> 0.	| AuditRopStackPivot (bitstart=7,nbits=1)
1> 0.	| EnableRopCallerCheck (bitstart=8,nbits=1)
1> 0.	| AuditRopCallerCheck (bitstart=9,nbits=1)
1> 0.	| EnableRopSimExec (bitstart=10,nbits=1)
1> 0.	| AuditRopSimExec (bitstart=11,nbits=1)
1> 0.	| ReservedFlags (bitstart=12,nbits=20)
1>	+---
1>
1>class _PROCESS_MITIGATION_CHILD_PROCESS_POLICY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| NoChildProcessCreation (bitstart=0,nbits=1)
1> 0.	| AuditNoChildProcessCreation (bitstart=1,nbits=1)
1> 0.	| AllowSecureProcessCreation (bitstart=2,nbits=1)
1> 0.	| ReservedFlags (bitstart=3,nbits=29)
1>	+---
1>
1>class _PROCESS_MITIGATION_CHILD_PROCESS_POLICY::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| NoChildProcessCreation (bitstart=0,nbits=1)
1> 0.	| AuditNoChildProcessCreation (bitstart=1,nbits=1)
1> 0.	| AllowSecureProcessCreation (bitstart=2,nbits=1)
1> 0.	| ReservedFlags (bitstart=3,nbits=29)
1>	+---
1>
1>class _PROCESS_MITIGATION_CHILD_PROCESS_POLICY	size(4):
1>	+---
1> 0	| Flags
1> 0.	| NoChildProcessCreation (bitstart=0,nbits=1)
1> 0.	| AuditNoChildProcessCreation (bitstart=1,nbits=1)
1> 0.	| AllowSecureProcessCreation (bitstart=2,nbits=1)
1> 0.	| ReservedFlags (bitstart=3,nbits=29)
1>	+---
1>
1>class _JOBOBJECT_BASIC_ACCOUNTING_INFORMATION	size(48):
1>	+---
1> 0	| _LARGE_INTEGER TotalUserTime
1> 8	| _LARGE_INTEGER TotalKernelTime
1>16	| _LARGE_INTEGER ThisPeriodTotalUserTime
1>24	| _LARGE_INTEGER ThisPeriodTotalKernelTime
1>32	| TotalPageFaultCount
1>36	| TotalProcesses
1>40	| ActiveProcesses
1>44	| TotalTerminatedProcesses
1>	+---
1>
1>class _JOBOBJECT_BASIC_LIMIT_INFORMATION	size(48):
1>	+---
1> 0	| _LARGE_INTEGER PerProcessUserTimeLimit
1> 8	| _LARGE_INTEGER PerJobUserTimeLimit
1>16	| LimitFlags
1>20	| MinimumWorkingSetSize
1>24	| MaximumWorkingSetSize
1>28	| ActiveProcessLimit
1>32	| Affinity
1>36	| PriorityClass
1>40	| SchedulingClass
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class _JOBOBJECT_EXTENDED_LIMIT_INFORMATION	size(112):
1>	+---
1> 0	| _JOBOBJECT_BASIC_LIMIT_INFORMATION BasicLimitInformation
1>48	| _IO_COUNTERS IoInfo
1>96	| ProcessMemoryLimit
1>100	| JobMemoryLimit
1>104	| PeakProcessMemoryUsed
1>108	| PeakJobMemoryUsed
1>	+---
1>
1>class _JOBOBJECT_BASIC_PROCESS_ID_LIST	size(12):
1>	+---
1> 0	| NumberOfAssignedProcesses
1> 4	| NumberOfProcessIdsInList
1> 8	| ProcessIdList
1>	+---
1>
1>class _JOBOBJECT_BASIC_UI_RESTRICTIONS	size(4):
1>	+---
1> 0	| UIRestrictionsClass
1>	+---
1>
1>class _JOBOBJECT_SECURITY_LIMIT_INFORMATION	size(20):
1>	+---
1> 0	| SecurityLimitFlags
1> 4	| JobToken
1> 8	| SidsToDisable
1>12	| PrivilegesToDelete
1>16	| RestrictedSids
1>	+---
1>
1>class _JOBOBJECT_END_OF_JOB_TIME_INFORMATION	size(4):
1>	+---
1> 0	| EndOfJobTimeAction
1>	+---
1>
1>class _JOBOBJECT_ASSOCIATE_COMPLETION_PORT	size(8):
1>	+---
1> 0	| CompletionKey
1> 4	| CompletionPort
1>	+---
1>
1>class _JOBOBJECT_BASIC_AND_IO_ACCOUNTING_INFORMATION	size(96):
1>	+---
1> 0	| _JOBOBJECT_BASIC_ACCOUNTING_INFORMATION BasicInfo
1>48	| _IO_COUNTERS IoInfo
1>	+---
1>
1>class _JOBOBJECT_JOBSET_INFORMATION	size(4):
1>	+---
1> 0	| MemberLevel
1>	+---
1>
1>class _JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION	size(48):
1>	+---
1> 0	| IoReadBytesLimit
1> 8	| IoWriteBytesLimit
1>16	| _LARGE_INTEGER PerJobUserTimeLimit
1>24	| JobMemoryLimit
1>32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
1>36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
1>40	| LimitFlags
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<unnamed-tag>	size(8):
1>	+---
1> 0	| JobHighMemoryLimit
1> 0	| JobMemoryLimit
1>	+---
1>
1>class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<unnamed-tag>	size(4):
1>	+---
1> 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
1> 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
1>	+---
1>
1>class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2::<unnamed-tag>	size(4):
1>	+---
1> 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
1> 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL CpuRateControlToleranceInterval
1>	+---
1>
1>class JOBOBJECT_NOTIFICATION_LIMIT_INFORMATION_2	size(72):
1>	+---
1> 0	| IoReadBytesLimit
1> 8	| IoWriteBytesLimit
1>16	| _LARGE_INTEGER PerJobUserTimeLimit
1>  	| <unnamed-tag> <alignment member> (size=24)
1>24	| JobHighMemoryLimit
1>24	| JobMemoryLimit
1>  	| <unnamed-tag> <alignment member> (size=32)
1>32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
1>32	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
1>  	| <unnamed-tag> <alignment member> (size=36)
1>36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL RateControlToleranceInterval
1>36	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL CpuRateControlToleranceInterval
1>40	| LimitFlags
1>44	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlTolerance
1>48	| JobLowMemoryLimit
1>56	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL IoRateControlToleranceInterval
1>60	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlTolerance
1>64	| _JOBOBJECT_RATE_CONTROL_TOLERANCE_INTERVAL NetRateControlToleranceInterval
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class _JOBOBJECT_LIMIT_VIOLATION_INFORMATION	size(80):
1>	+---
1> 0	| LimitFlags
1> 4	| ViolationLimitFlags
1> 8	| IoReadBytes
1>16	| IoReadBytesLimit
1>24	| IoWriteBytes
1>32	| IoWriteBytesLimit
1>40	| _LARGE_INTEGER PerJobUserTime
1>48	| _LARGE_INTEGER PerJobUserTimeLimit
1>56	| JobMemory
1>64	| JobMemoryLimit
1>72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
1>76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
1>	+---
1>
1>class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<unnamed-tag>	size(8):
1>	+---
1> 0	| JobHighMemoryLimit
1> 0	| JobMemoryLimit
1>	+---
1>
1>class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<unnamed-tag>	size(4):
1>	+---
1> 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
1> 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
1>	+---
1>
1>class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2::<unnamed-tag>	size(4):
1>	+---
1> 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
1> 0	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlToleranceLimit
1>	+---
1>
1>class JOBOBJECT_LIMIT_VIOLATION_INFORMATION_2	size(104):
1>	+---
1> 0	| LimitFlags
1> 4	| ViolationLimitFlags
1> 8	| IoReadBytes
1>16	| IoReadBytesLimit
1>24	| IoWriteBytes
1>32	| IoWriteBytesLimit
1>40	| _LARGE_INTEGER PerJobUserTime
1>48	| _LARGE_INTEGER PerJobUserTimeLimit
1>56	| JobMemory
1>  	| <unnamed-tag> <alignment member> (size=64)
1>64	| JobHighMemoryLimit
1>64	| JobMemoryLimit
1>  	| <unnamed-tag> <alignment member> (size=72)
1>72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlTolerance
1>72	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlTolerance
1>  	| <unnamed-tag> <alignment member> (size=76)
1>76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE RateControlToleranceLimit
1>76	| _JOBOBJECT_RATE_CONTROL_TOLERANCE CpuRateControlToleranceLimit
1>80	| JobLowMemoryLimit
1>88	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlTolerance
1>92	| _JOBOBJECT_RATE_CONTROL_TOLERANCE IoRateControlToleranceLimit
1>96	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlTolerance
1>100	| _JOBOBJECT_RATE_CONTROL_TOLERANCE NetRateControlToleranceLimit
1>	+---
1>
1>class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| MinRate
1> 2	| MaxRate
1>	+---
1>
1>class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION::<unnamed-tag>	size(4):
1>	+---
1> 0	| CpuRate
1> 0	| Weight
1> 0	| MinRate
1> 2	| MaxRate
1>	+---
1>
1>class _JOBOBJECT_CPU_RATE_CONTROL_INFORMATION	size(8):
1>	+---
1> 0	| ControlFlags
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| CpuRate
1> 4	| Weight
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| MinRate
1> 6	| MaxRate
1>  	| <unnamed-tag> <alignment member> (size=4)
1>	+---
1>
1>class _ENUM_FLAG_SIZED_INTEGER<enum JOB_OBJECT_NET_RATE_CONTROL_FLAGS>	size(1):
1>	+---
1>	+---
1>
1>class JOBOBJECT_NET_RATE_CONTROL_INFORMATION	size(16):
1>	+---
1> 0	| MaxBandwidth
1> 8	| JOB_OBJECT_NET_RATE_CONTROL_FLAGS ControlFlags
1>12	| DscpTag
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _ENUM_FLAG_SIZED_INTEGER<enum JOB_OBJECT_IO_RATE_CONTROL_FLAGS>	size(1):
1>	+---
1>	+---
1>
1>class JOBOBJECT_IO_RATE_CONTROL_INFORMATION_NATIVE	size(40):
1>	+---
1> 0	| MaxIops
1> 8	| MaxBandwidth
1>16	| ReservationIops
1>24	| VolumeName
1>28	| BaseIoSize
1>32	| JOB_OBJECT_IO_RATE_CONTROL_FLAGS ControlFlags
1>36	| VolumeNameLength
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class JOBOBJECT_IO_RATE_CONTROL_INFORMATION_NATIVE_V2	size(88):
1>	+---
1> 0	| MaxIops
1> 8	| MaxBandwidth
1>16	| ReservationIops
1>24	| VolumeName
1>28	| BaseIoSize
1>32	| JOB_OBJECT_IO_RATE_CONTROL_FLAGS ControlFlags
1>36	| VolumeNameLength
1>  	| <alignment member> (size=2)
1>40	| CriticalReservationIops
1>48	| ReservationBandwidth
1>56	| CriticalReservationBandwidth
1>64	| MaxTimePercent
1>72	| ReservationTimePercent
1>80	| CriticalReservationTimePercent
1>	+---
1>
1>class JOBOBJECT_IO_RATE_CONTROL_INFORMATION_NATIVE_V3	size(136):
1>	+---
1> 0	| MaxIops
1> 8	| MaxBandwidth
1>16	| ReservationIops
1>24	| VolumeName
1>28	| BaseIoSize
1>32	| JOB_OBJECT_IO_RATE_CONTROL_FLAGS ControlFlags
1>36	| VolumeNameLength
1>  	| <alignment member> (size=2)
1>40	| CriticalReservationIops
1>48	| ReservationBandwidth
1>56	| CriticalReservationBandwidth
1>64	| MaxTimePercent
1>72	| ReservationTimePercent
1>80	| CriticalReservationTimePercent
1>88	| SoftMaxIops
1>96	| SoftMaxBandwidth
1>104	| SoftMaxTimePercent
1>112	| LimitExcessNotifyIops
1>120	| LimitExcessNotifyBandwidth
1>128	| LimitExcessNotifyTimePercent
1>	+---
1>
1>class _JOBOBJECT_IO_ATTRIBUTION_STATS	size(32):
1>	+---
1> 0	| IoCount
1>  	| <alignment member> (size=4)
1> 8	| TotalNonOverlappedQueueTime
1>16	| TotalNonOverlappedServiceTime
1>24	| TotalSize
1>	+---
1>
1>class _JOBOBJECT_IO_ATTRIBUTION_INFORMATION	size(72):
1>	+---
1> 0	| ControlFlags
1>  	| <alignment member> (size=4)
1> 8	| _JOBOBJECT_IO_ATTRIBUTION_STATS ReadStats
1>40	| _JOBOBJECT_IO_ATTRIBUTION_STATS WriteStats
1>	+---
1>
1>class _SILOOBJECT_BASIC_INFORMATION	size(16):
1>	+---
1> 0	| SiloId
1> 4	| SiloParentId
1> 8	| NumberOfProcesses
1>12	| IsInServerSilo
1>13	| Reserved
1>	+---
1>
1>class _SERVERSILO_BASIC_INFORMATION	size(12):
1>	+---
1> 0	| ServiceSessionId
1> 4	| _SERVERSILO_STATE State
1> 8	| ExitStatus
1>	+---
1>
1>class _CACHE_DESCRIPTOR	size(12):
1>	+---
1> 0	| Level
1> 1	| Associativity
1> 2	| LineSize
1> 4	| Size
1> 8	| _PROCESSOR_CACHE_TYPE Type
1>	+---
1>
1>class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(1):
1>	+---
1> 0	| Flags
1>	+---
1>
1>class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| NodeNumber
1>	+---
1>
1>class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION::<unnamed-tag>	size(16):
1>	+---
1> 0	| <unnamed-type-ProcessorCore> ProcessorCore
1>  	| <alignment member> (size=3)
1> 0	| <unnamed-type-NumaNode> NumaNode
1> 0	| _CACHE_DESCRIPTOR Cache
1>  	| <alignment member> (size=4)
1> 0	| Reserved
1>	+---
1>
1>class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION	size(24):
1>	+---
1> 0	| ProcessorMask
1> 4	| _LOGICAL_PROCESSOR_RELATIONSHIP Relationship
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| <unnamed-type-ProcessorCore> ProcessorCore
1>  	| <alignment member> (size=3)
1> 8	| <unnamed-type-NumaNode> NumaNode
1> 8	| _CACHE_DESCRIPTOR Cache
1>  	| <alignment member> (size=4)
1> 8	| Reserved
1>	+---
1>
1>class _PROCESSOR_RELATIONSHIP	size(36):
1>	+---
1> 0	| Flags
1> 1	| EfficiencyClass
1> 2	| Reserved
1>22	| GroupCount
1>24	| GroupMask
1>	+---
1>
1>class _NUMA_NODE_RELATIONSHIP	size(36):
1>	+---
1> 0	| NodeNumber
1> 4	| Reserved
1>24	| _GROUP_AFFINITY GroupMask
1>	+---
1>
1>class _CACHE_RELATIONSHIP	size(44):
1>	+---
1> 0	| Level
1> 1	| Associativity
1> 2	| LineSize
1> 4	| CacheSize
1> 8	| _PROCESSOR_CACHE_TYPE Type
1>12	| Reserved
1>32	| _GROUP_AFFINITY GroupMask
1>	+---
1>
1>class _PROCESSOR_GROUP_INFO	size(44):
1>	+---
1> 0	| MaximumProcessorCount
1> 1	| ActiveProcessorCount
1> 2	| Reserved
1>40	| ActiveProcessorMask
1>	+---
1>
1>class _GROUP_RELATIONSHIP	size(68):
1>	+---
1> 0	| MaximumGroupCount
1> 2	| ActiveGroupCount
1> 4	| Reserved
1>24	| GroupInfo
1>	+---
1>
1>class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX::<unnamed-tag>	size(68):
1>	+---
1> 0	| _PROCESSOR_RELATIONSHIP Processor
1> 0	| _NUMA_NODE_RELATIONSHIP NumaNode
1> 0	| _CACHE_RELATIONSHIP Cache
1> 0	| _GROUP_RELATIONSHIP Group
1>	+---
1>
1>class _SYSTEM_LOGICAL_PROCESSOR_INFORMATION_EX	size(76):
1>	+---
1> 0	| _LOGICAL_PROCESSOR_RELATIONSHIP Relationship
1> 4	| Size
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| _PROCESSOR_RELATIONSHIP Processor
1> 8	| _NUMA_NODE_RELATIONSHIP NumaNode
1> 8	| _CACHE_RELATIONSHIP Cache
1> 8	| _GROUP_RELATIONSHIP Group
1>	+---
1>
1>class _SYSTEM_CPU_SET_INFORMATION::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(1):
1>	+---
1> 0.	| Parked (bitstart=0,nbits=1)
1> 0.	| Allocated (bitstart=1,nbits=1)
1> 0.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
1> 0.	| RealTime (bitstart=3,nbits=1)
1> 0.	| ReservedFlags (bitstart=4,nbits=4)
1>	+---
1>
1>class _SYSTEM_CPU_SET_INFORMATION::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(1):
1>	+---
1> 0	| AllFlags
1> 0.	| Parked (bitstart=0,nbits=1)
1> 0.	| Allocated (bitstart=1,nbits=1)
1> 0.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
1> 0.	| RealTime (bitstart=3,nbits=1)
1> 0.	| ReservedFlags (bitstart=4,nbits=4)
1>	+---
1>
1>class _SYSTEM_CPU_SET_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(24):
1>	+---
1> 0	| Id
1> 4	| Group
1> 6	| LogicalProcessorIndex
1> 7	| CoreIndex
1> 8	| LastLevelCacheIndex
1> 9	| NumaNodeIndex
1>10	| EfficiencyClass
1>  	| <unnamed-tag> <alignment member> (size=11)
1>11	| AllFlags
1>  	| <unnamed-tag> <alignment member> (size=11)
1>11.	| Parked (bitstart=0,nbits=1)
1>11.	| Allocated (bitstart=1,nbits=1)
1>11.	| AllocatedToTargetProcess (bitstart=2,nbits=1)
1>11.	| RealTime (bitstart=3,nbits=1)
1>11.	| ReservedFlags (bitstart=4,nbits=4)
1>  	| <unnamed-tag> <alignment member> (size=11)
1>12	| Reserved
1>16	| AllocationTag
1>	+---
1>
1>class _SYSTEM_CPU_SET_INFORMATION::<unnamed-tag>	size(24):
1>	+---
1> 0	| <unnamed-type-CpuSet> CpuSet
1>	+---
1>
1>class _SYSTEM_CPU_SET_INFORMATION	size(32):
1>	+---
1> 0	| Size
1> 4	| _CPU_SET_INFORMATION_TYPE Type
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| <unnamed-type-CpuSet> CpuSet
1>	+---
1>
1>class _SYSTEM_PROCESSOR_CYCLE_TIME_INFORMATION	size(8):
1>	+---
1> 0	| CycleTime
1>	+---
1>
1>class _XSTATE_FEATURE	size(8):
1>	+---
1> 0	| Offset
1> 4	| Size
1>	+---
1>
1>class _XSTATE_CONFIGURATION::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| OptimizedSave (bitstart=0,nbits=1)
1> 0.	| CompactionEnabled (bitstart=1,nbits=1)
1>	+---
1>
1>class _XSTATE_CONFIGURATION::<unnamed-tag>	size(4):
1>	+---
1> 0	| ControlFlags
1> 0.	| OptimizedSave (bitstart=0,nbits=1)
1> 0.	| CompactionEnabled (bitstart=1,nbits=1)
1>	+---
1>
1>class _XSTATE_CONFIGURATION	size(816):
1>	+---
1> 0	| EnabledFeatures
1> 8	| EnabledVolatileFeatures
1>16	| Size
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20	| ControlFlags
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20.	| OptimizedSave (bitstart=0,nbits=1)
1>20.	| CompactionEnabled (bitstart=1,nbits=1)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>24	| Features
1>536	| EnabledSupervisorFeatures
1>544	| AlignedFeatures
1>552	| AllFeatureSize
1>556	| AllFeatures
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class _MEMORY_BASIC_INFORMATION	size(28):
1>	+---
1> 0	| BaseAddress
1> 4	| AllocationBase
1> 8	| AllocationProtect
1>12	| RegionSize
1>16	| State
1>20	| Protect
1>24	| Type
1>	+---
1>
1>class _MEMORY_BASIC_INFORMATION32	size(28):
1>	+---
1> 0	| BaseAddress
1> 4	| AllocationBase
1> 8	| AllocationProtect
1>12	| RegionSize
1>16	| State
1>20	| Protect
1>24	| Type
1>	+---
1>
1>class _MEMORY_BASIC_INFORMATION64	size(48):
1>	+---
1> 0	| BaseAddress
1> 8	| AllocationBase
1>16	| AllocationProtect
1>20	| __alignment1
1>24	| RegionSize
1>32	| State
1>36	| Protect
1>40	| Type
1>44	| __alignment2
1>	+---
1>
1>class _CFG_CALL_TARGET_INFO	size(8):
1>	+---
1> 0	| Offset
1> 4	| Flags
1>	+---
1>
1>class _ENCLAVE_CREATE_INFO_SGX	size(4096):
1>	+---
1> 0	| Secs
1>	+---
1>
1>class _ENCLAVE_INIT_INFO_SGX	size(4096):
1>	+---
1> 0	| SigStruct
1>1808	| Reserved1
1>2048	| EInitToken
1>2352	| Reserved2
1>	+---
1>
1>class _ENCLAVE_CREATE_INFO_VBS	size(36):
1>	+---
1> 0	| Flags
1> 4	| OwnerID
1>	+---
1>
1>class _ENCLAVE_INIT_INFO_VBS	size(8):
1>	+---
1> 0	| Length
1> 4	| ThreadCount
1>	+---
1>
1>class _FILE_ID_128	size(16):
1>	+---
1> 0	| Identifier
1>	+---
1>
1>class _FILE_NOTIFY_INFORMATION	size(16):
1>	+---
1> 0	| NextEntryOffset
1> 4	| Action
1> 8	| FileNameLength
1>12	| FileName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _FILE_NOTIFY_EXTENDED_INFORMATION	size(88):
1>	+---
1> 0	| NextEntryOffset
1> 4	| Action
1> 8	| _LARGE_INTEGER CreationTime
1>16	| _LARGE_INTEGER LastModificationTime
1>24	| _LARGE_INTEGER LastChangeTime
1>32	| _LARGE_INTEGER LastAccessTime
1>40	| _LARGE_INTEGER AllocatedLength
1>48	| _LARGE_INTEGER FileSize
1>56	| FileAttributes
1>60	| ReparsePointTag
1>64	| _LARGE_INTEGER FileId
1>72	| _LARGE_INTEGER ParentFileId
1>80	| FileNameLength
1>84	| FileName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _FILE_SEGMENT_ELEMENT	size(8):
1>	+---
1> 0	| Buffer
1> 0	| Alignment
1>	+---
1>
1>class _REPARSE_GUID_DATA_BUFFER::<unnamed-tag>	size(1):
1>	+---
1> 0	| DataBuffer
1>	+---
1>
1>class _REPARSE_GUID_DATA_BUFFER	size(28):
1>	+---
1> 0	| ReparseTag
1> 4	| ReparseDataLength
1> 6	| Reserved
1> 8	| _GUID ReparseGuid
1>24	| <unnamed-type-GenericReparseBuffer> GenericReparseBuffer
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _SCRUB_DATA_INPUT	size(896):
1>	+---
1> 0	| Size
1> 4	| Flags
1> 8	| MaximumIos
1>12	| ObjectId
1>28	| Reserved
1>80	| ResumeContext
1>	+---
1>
1>class _SCRUB_PARITY_EXTENT	size(16):
1>	+---
1> 0	| Offset
1> 8	| Length
1>	+---
1>
1>class _SCRUB_PARITY_EXTENT_DATA	size(24):
1>	+---
1> 0	| Size
1> 2	| Flags
1> 4	| NumberOfParityExtents
1> 6	| MaximumNumberOfParityExtents
1> 8	| ParityExtents
1>	+---
1>
1>class _SCRUB_DATA_OUTPUT	size(896):
1>	+---
1> 0	| Size
1> 4	| Flags
1> 8	| Status
1>  	| <alignment member> (size=4)
1>16	| ErrorFileOffset
1>24	| ErrorLength
1>32	| NumberOfBytesRepaired
1>40	| NumberOfBytesFailed
1>48	| InternalFileReference
1>56	| ResumeContextLength
1>58	| ParityExtentDataOffset
1>60	| Reserved
1>80	| ResumeContext
1>	+---
1>
1>class _SHARED_VIRTUAL_DISK_SUPPORT	size(8):
1>	+---
1> 0	| _SharedVirtualDiskSupportType SharedVirtualDiskSupport
1> 4	| _SharedVirtualDiskHandleState HandleState
1>	+---
1>
1>class _NETWORK_APP_INSTANCE_EA	size(20):
1>	+---
1> 0	| _GUID AppInstanceID
1>16	| CsvFlags
1>	+---
1>
1>class CM_Power_Data_s	size(56):
1>	+---
1> 0	| PD_Size
1> 4	| _DEVICE_POWER_STATE PD_MostRecentPowerState
1> 8	| PD_Capabilities
1>12	| PD_D1Latency
1>16	| PD_D2Latency
1>20	| PD_D3Latency
1>24	| PD_PowerStateMapping
1>52	| _SYSTEM_POWER_STATE PD_DeepestSystemWake
1>	+---
1>
1>class _POWER_USER_PRESENCE	size(4):
1>	+---
1> 0	| POWER_USER_PRESENCE_TYPE UserPresence
1>	+---
1>
1>class _POWER_SESSION_CONNECT	size(2):
1>	+---
1> 0	| Connected
1> 1	| Console
1>	+---
1>
1>class _POWER_SESSION_TIMEOUTS	size(8):
1>	+---
1> 0	| InputTimeout
1> 4	| DisplayTimeout
1>	+---
1>
1>class _POWER_SESSION_RIT_STATE	size(8):
1>	+---
1> 0	| Active
1>  	| <alignment member> (size=3)
1> 4	| LastInputTime
1>	+---
1>
1>class _POWER_SESSION_WINLOGON	size(8):
1>	+---
1> 0	| SessionId
1> 4	| Console
1> 5	| Locked
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _POWER_IDLE_RESILIENCY	size(8):
1>	+---
1> 0	| CoalescingTimeout
1> 4	| IdleResiliencyPeriod
1>	+---
1>
1>class _POWER_MONITOR_INVOCATION	size(8):
1>	+---
1> 0	| Console
1>  	| <alignment member> (size=3)
1> 4	| POWER_MONITOR_REQUEST_REASON RequestReason
1>	+---
1>
1>class _RESUME_PERFORMANCE	size(24):
1>	+---
1> 0	| PostTimeMs
1>  	| <alignment member> (size=4)
1> 8	| TotalResumeTimeMs
1>16	| ResumeCompleteTimestamp
1>	+---
1>
1>class <unnamed-tag>	size(32):
1>	+---
1> 0	| Version
1> 4	| _GUID Guid
1>20	| SYSTEM_POWER_CONDITION PowerCondition
1>24	| DataLength
1>28	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class <unnamed-tag>	size(16):
1>	+---
1> 0	| _GUID Guid
1>	+---
1>
1>class _APPLICATIONLAUNCH_SETTING_VALUE	size(16):
1>	+---
1> 0	| _LARGE_INTEGER ActivationTime
1> 8	| Flags
1>12	| ButtonInstanceID
1>	+---
1>
1>class _POWER_PLATFORM_INFORMATION	size(1):
1>	+---
1> 0	| AoAc
1>	+---
1>
1>class <unnamed-tag>	size(8):
1>	+---
1> 0	| Granularity
1> 4	| Capacity
1>	+---
1>
1>class <unnamed-tag>	size(12):
1>	+---
1> 0	| Frequency
1> 4	| Flags
1> 8	| PercentFrequency
1>	+---
1>
1>class <unnamed-tag>	size(32):
1>	+---
1> 0	| Latency
1> 4	| Power
1> 8	| TimeCheck
1>12	| PromotePercent
1>13	| DemotePercent
1>14	| StateType
1>15	| Reserved
1>16	| StateFlags
1>20	| Context
1>24	| IdleHandler
1>28	| Reserved1
1>	+---
1>
1>class <unnamed-tag>	size(56):
1>	+---
1> 0	| Type
1> 4	| Count
1> 8	| TargetState
1>12	| OldState
1>16	| TargetProcessors
1>24	| State
1>	+---
1>
1>class <unnamed-tag>	size(52):
1>	+---
1> 0	| Type
1> 4	| Count
1> 8	| TargetState
1>12	| OldState
1>16	| TargetProcessors
1>20	| State
1>	+---
1>
1>class <unnamed-tag>	size(64):
1>	+---
1> 0	| Frequency
1> 4	| Power
1> 8	| PercentFrequency
1> 9	| IncreaseLevel
1>10	| DecreaseLevel
1>11	| Type
1>12	| IncreaseTime
1>16	| DecreaseTime
1>  	| <alignment member> (size=4)
1>24	| Control
1>32	| Status
1>40	| HitCount
1>44	| Reserved1
1>48	| Reserved2
1>56	| Reserved3
1>	+---
1>
1>class <unnamed-tag>	size(144):
1>	+---
1> 0	| Count
1> 4	| MaxFrequency
1> 8	| CurrentState
1>12	| MaxPerfState
1>16	| MinPerfState
1>20	| LowestPerfState
1>24	| ThermalConstraint
1>28	| BusyAdjThreshold
1>29	| PolicyType
1>30	| Type
1>31	| Reserved
1>32	| TimerInterval
1>  	| <alignment member> (size=4)
1>40	| TargetProcessors
1>48	| PStateHandler
1>52	| PStateContext
1>56	| TStateHandler
1>60	| TStateContext
1>64	| FeedbackHandler
1>68	| Reserved1
1>72	| Reserved2
1>80	| State
1>	+---
1>
1>class <unnamed-tag>	size(136):
1>	+---
1> 0	| Count
1> 4	| MaxFrequency
1> 8	| CurrentState
1>12	| MaxPerfState
1>16	| MinPerfState
1>20	| LowestPerfState
1>24	| ThermalConstraint
1>28	| BusyAdjThreshold
1>29	| PolicyType
1>30	| Type
1>31	| Reserved
1>32	| TimerInterval
1>36	| TargetProcessors
1>40	| PStateHandler
1>44	| PStateContext
1>48	| TStateHandler
1>52	| TStateContext
1>56	| FeedbackHandler
1>60	| Reserved1
1>64	| Reserved2
1>72	| State
1>	+---
1>
1>class <unnamed-tag>	size(48):
1>	+---
1> 0	| IdleTransitions
1> 4	| FailedTransitions
1> 8	| InvalidBucketIndex
1>  	| <alignment member> (size=4)
1>16	| TotalTime
1>24	| IdleTimeBuckets
1>	+---
1>
1>class <unnamed-tag>	size(72):
1>	+---
1> 0	| StateCount
1> 4	| TotalTransitions
1> 8	| ResetCount
1>  	| <alignment member> (size=4)
1>16	| StartTime
1>24	| State
1>	+---
1>
1>class <unnamed-tag>	size(24):
1>	+---
1> 0	| TotalTimeUs
1> 8	| MinTimeUs
1>12	| MaxTimeUs
1>16	| Count
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class <unnamed-tag>	size(416):
1>	+---
1> 0	| TotalTime
1> 8	| IdleTransitions
1>12	| FailedTransitions
1>16	| InvalidBucketIndex
1>20	| MinTimeUs
1>24	| MaxTimeUs
1>28	| CancelledTransitions
1>32	| IdleTimeBuckets
1>	+---
1>
1>class <unnamed-tag>	size(440):
1>	+---
1> 0	| StateCount
1> 4	| TotalTransitions
1> 8	| ResetCount
1>12	| AbortCount
1>16	| StartTime
1>24	| State
1>	+---
1>
1>class <unnamed-tag>	size(20):
1>	+---
1> 0	| State
1> 4	| Status
1> 8	| Latency
1>12	| Speed
1>16	| Processor
1>	+---
1>
1>class <unnamed-tag>	size(24):
1>	+---
1> 0	| State
1> 4	| Latency
1> 8	| Speed
1>  	| <alignment member> (size=4)
1>16	| Processors
1>	+---
1>
1>class <unnamed-tag>	size(16):
1>	+---
1> 0	| NewState
1> 4	| OldState
1> 8	| Processors
1>	+---
1>
1>class <unnamed-tag>	size(16):
1>	+---
1> 0	| ThermalConstraint
1>  	| <alignment member> (size=4)
1> 8	| Processors
1>	+---
1>
1>class <unnamed-tag>	size(16):
1>	+---
1> 0	| Mode
1>  	| <alignment member> (size=7)
1> 8	| Processors
1>	+---
1>
1>class <unnamed-tag>	size(12):
1>	+---
1> 0	| POWER_ACTION Action
1> 4	| Flags
1> 8	| EventCode
1>	+---
1>
1>class <unnamed-tag>	size(24):
1>	+---
1> 0	| Enable
1> 1	| Spare
1> 4	| BatteryLevel
1> 8	| POWER_ACTION_POLICY PowerPolicy
1>20	| _SYSTEM_POWER_STATE MinSystemState
1>	+---
1>
1>class _SYSTEM_POWER_POLICY	size(232):
1>	+---
1> 0	| Revision
1> 4	| POWER_ACTION_POLICY PowerButton
1>16	| POWER_ACTION_POLICY SleepButton
1>28	| POWER_ACTION_POLICY LidClose
1>40	| _SYSTEM_POWER_STATE LidOpenWake
1>44	| Reserved
1>48	| POWER_ACTION_POLICY Idle
1>60	| IdleTimeout
1>64	| IdleSensitivity
1>65	| DynamicThrottle
1>66	| Spare2
1>68	| _SYSTEM_POWER_STATE MinSleep
1>72	| _SYSTEM_POWER_STATE MaxSleep
1>76	| _SYSTEM_POWER_STATE ReducedLatencySleep
1>80	| WinLogonFlags
1>84	| Spare3
1>88	| DozeS4Timeout
1>92	| BroadcastCapacityResolution
1>96	| DischargePolicy
1>192	| VideoTimeout
1>196	| VideoDimDisplay
1>  	| <alignment member> (size=3)
1>200	| VideoReserved
1>212	| SpindownTimeout
1>216	| OptimizeForPower
1>217	| FanThrottleTolerance
1>218	| ForcedThrottle
1>219	| MinThrottle
1>220	| POWER_ACTION_POLICY OverThrottled
1>	+---
1>
1>class <unnamed-tag>	size(8):
1>	+---
1> 0	| TimeCheck
1> 4	| DemotePercent
1> 5	| PromotePercent
1> 6	| Spare
1>	+---
1>
1>class <unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(2):
1>	+---
1> 0.	| AllowScaling (bitstart=0,nbits=1)
1> 0.	| Disabled (bitstart=1,nbits=1)
1> 0.	| Reserved (bitstart=2,nbits=14)
1>	+---
1>
1>class <unnamed-tag>::<unnamed-tag>	size(2):
1>	+---
1> 0	| AsWORD
1> 0.	| AllowScaling (bitstart=0,nbits=1)
1> 0.	| Disabled (bitstart=1,nbits=1)
1> 0.	| Reserved (bitstart=2,nbits=14)
1>	+---
1>
1>class <unnamed-tag>	size(32):
1>	+---
1> 0	| Revision
1> 2	| <unnamed-type-Flags> Flags
1> 4	| PolicyCount
1> 8	| Policy
1>	+---
1>
1>class _PROCESSOR_POWER_POLICY_INFO	size(20):
1>	+---
1> 0	| TimeCheck
1> 4	| DemoteLimit
1> 8	| PromoteLimit
1>12	| DemotePercent
1>13	| PromotePercent
1>14	| Spare
1>16.	| AllowDemotion (bitstart=0,nbits=1)
1>16.	| AllowPromotion (bitstart=1,nbits=1)
1>16.	| Reserved (bitstart=2,nbits=30)
1>	+---
1>
1>class _PROCESSOR_POWER_POLICY	size(76):
1>	+---
1> 0	| Revision
1> 4	| DynamicThrottle
1> 5	| Spare
1> 8.	| DisableCStates (bitstart=0,nbits=1)
1> 8.	| Reserved (bitstart=1,nbits=31)
1>12	| PolicyCount
1>16	| Policy
1>	+---
1>
1>class <unnamed-tag>::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(1):
1>	+---
1> 0.	| NoDomainAccounting (bitstart=0,nbits=1)
1> 0.	| IncreasePolicy (bitstart=1,nbits=2)
1> 0.	| DecreasePolicy (bitstart=3,nbits=2)
1> 0.	| Reserved (bitstart=5,nbits=3)
1>	+---
1>
1>class <unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(1):
1>	+---
1> 0	| AsBYTE
1> 0.	| NoDomainAccounting (bitstart=0,nbits=1)
1> 0.	| IncreasePolicy (bitstart=1,nbits=2)
1> 0.	| DecreasePolicy (bitstart=3,nbits=2)
1> 0.	| Reserved (bitstart=5,nbits=3)
1>	+---
1>
1>class <unnamed-tag>::<unnamed-tag>	size(1):
1>	+---
1> 0	| Spare
1> 0	| <unnamed-type-Flags> Flags
1>	+---
1>
1>class <unnamed-tag>	size(28):
1>	+---
1> 0	| Revision
1> 4	| MaxThrottle
1> 5	| MinThrottle
1> 6	| BusyAdjThreshold
1>  	| <unnamed-tag> <alignment member> (size=7)
1> 7	| Spare
1> 7	| <unnamed-type-Flags> Flags
1> 8	| TimeCheck
1>12	| IncreaseTime
1>16	| DecreaseTime
1>20	| IncreasePercent
1>24	| DecreasePercent
1>	+---
1>
1>class _ADMINISTRATOR_POWER_POLICY	size(24):
1>	+---
1> 0	| _SYSTEM_POWER_STATE MinSleep
1> 4	| _SYSTEM_POWER_STATE MaxSleep
1> 8	| MinVideoTimeout
1>12	| MaxVideoTimeout
1>16	| MinSpindownTimeout
1>20	| MaxSpindownTimeout
1>	+---
1>
1>class _HIBERFILE_BUCKET	size(24):
1>	+---
1> 0	| MaxPhysicalMemory
1> 8	| PhysicalMemoryPercent
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class <unnamed-tag>	size(76):
1>	+---
1> 0	| PowerButtonPresent
1> 1	| SleepButtonPresent
1> 2	| LidPresent
1> 3	| SystemS1
1> 4	| SystemS2
1> 5	| SystemS3
1> 6	| SystemS4
1> 7	| SystemS5
1> 8	| HiberFilePresent
1> 9	| FullWake
1>10	| VideoDimPresent
1>11	| ApmPresent
1>12	| UpsPresent
1>13	| ThermalControl
1>14	| ProcessorThrottle
1>15	| ProcessorMinThrottle
1>16	| ProcessorMaxThrottle
1>17	| FastSystemS4
1>18	| Hiberboot
1>19	| WakeAlarmPresent
1>20	| AoAc
1>21	| DiskSpinDown
1>22	| HiberFileType
1>23	| AoAcConnectivitySupported
1>24	| spare3
1>30	| SystemBatteriesPresent
1>31	| BatteriesAreShortTerm
1>32	| BatteryScale
1>56	| _SYSTEM_POWER_STATE AcOnLineWake
1>60	| _SYSTEM_POWER_STATE SoftLidWake
1>64	| _SYSTEM_POWER_STATE RtcWake
1>68	| _SYSTEM_POWER_STATE MinDeviceWakeState
1>72	| _SYSTEM_POWER_STATE DefaultLowLatencyWake
1>	+---
1>
1>class <unnamed-tag>	size(32):
1>	+---
1> 0	| AcOnLine
1> 1	| BatteryPresent
1> 2	| Charging
1> 3	| Discharging
1> 4	| Spare1
1> 7	| Tag
1> 8	| MaxCapacity
1>12	| RemainingCapacity
1>16	| Rate
1>20	| EstimatedTime
1>24	| DefaultAlert1
1>28	| DefaultAlert2
1>	+---
1>
1>class _IMAGE_DOS_HEADER	size(64):
1>	+---
1> 0	| e_magic
1> 2	| e_cblp
1> 4	| e_cp
1> 6	| e_crlc
1> 8	| e_cparhdr
1>10	| e_minalloc
1>12	| e_maxalloc
1>14	| e_ss
1>16	| e_sp
1>18	| e_csum
1>20	| e_ip
1>22	| e_cs
1>24	| e_lfarlc
1>26	| e_ovno
1>28	| e_res
1>36	| e_oemid
1>38	| e_oeminfo
1>40	| e_res2
1>60	| e_lfanew
1>	+---
1>
1>class _IMAGE_OS2_HEADER	size(64):
1>	+---
1> 0	| ne_magic
1> 2	| ne_ver
1> 3	| ne_rev
1> 4	| ne_enttab
1> 6	| ne_cbenttab
1> 8	| ne_crc
1>12	| ne_flags
1>14	| ne_autodata
1>16	| ne_heap
1>18	| ne_stack
1>20	| ne_csip
1>24	| ne_sssp
1>28	| ne_cseg
1>30	| ne_cmod
1>32	| ne_cbnrestab
1>34	| ne_segtab
1>36	| ne_rsrctab
1>38	| ne_restab
1>40	| ne_modtab
1>42	| ne_imptab
1>44	| ne_nrestab
1>48	| ne_cmovent
1>50	| ne_align
1>52	| ne_cres
1>54	| ne_exetyp
1>55	| ne_flagsothers
1>56	| ne_pretthunks
1>58	| ne_psegrefbytes
1>60	| ne_swaparea
1>62	| ne_expver
1>	+---
1>
1>class _IMAGE_VXD_HEADER	size(196):
1>	+---
1> 0	| e32_magic
1> 2	| e32_border
1> 3	| e32_worder
1> 4	| e32_level
1> 8	| e32_cpu
1>10	| e32_os
1>12	| e32_ver
1>16	| e32_mflags
1>20	| e32_mpages
1>24	| e32_startobj
1>28	| e32_eip
1>32	| e32_stackobj
1>36	| e32_esp
1>40	| e32_pagesize
1>44	| e32_lastpagesize
1>48	| e32_fixupsize
1>52	| e32_fixupsum
1>56	| e32_ldrsize
1>60	| e32_ldrsum
1>64	| e32_objtab
1>68	| e32_objcnt
1>72	| e32_objmap
1>76	| e32_itermap
1>80	| e32_rsrctab
1>84	| e32_rsrccnt
1>88	| e32_restab
1>92	| e32_enttab
1>96	| e32_dirtab
1>100	| e32_dircnt
1>104	| e32_fpagetab
1>108	| e32_frectab
1>112	| e32_impmod
1>116	| e32_impmodcnt
1>120	| e32_impproc
1>124	| e32_pagesum
1>128	| e32_datapage
1>132	| e32_preload
1>136	| e32_nrestab
1>140	| e32_cbnrestab
1>144	| e32_nressum
1>148	| e32_autodata
1>152	| e32_debuginfo
1>156	| e32_debuglen
1>160	| e32_instpreload
1>164	| e32_instdemand
1>168	| e32_heapsize
1>172	| e32_res3
1>184	| e32_winresoff
1>188	| e32_winreslen
1>192	| e32_devid
1>194	| e32_ddkver
1>	+---
1>
1>class _IMAGE_FILE_HEADER	size(20):
1>	+---
1> 0	| Machine
1> 2	| NumberOfSections
1> 4	| TimeDateStamp
1> 8	| PointerToSymbolTable
1>12	| NumberOfSymbols
1>16	| SizeOfOptionalHeader
1>18	| Characteristics
1>	+---
1>
1>class _IMAGE_DATA_DIRECTORY	size(8):
1>	+---
1> 0	| VirtualAddress
1> 4	| Size
1>	+---
1>
1>class _IMAGE_OPTIONAL_HEADER	size(224):
1>	+---
1> 0	| Magic
1> 2	| MajorLinkerVersion
1> 3	| MinorLinkerVersion
1> 4	| SizeOfCode
1> 8	| SizeOfInitializedData
1>12	| SizeOfUninitializedData
1>16	| AddressOfEntryPoint
1>20	| BaseOfCode
1>24	| BaseOfData
1>28	| ImageBase
1>32	| SectionAlignment
1>36	| FileAlignment
1>40	| MajorOperatingSystemVersion
1>42	| MinorOperatingSystemVersion
1>44	| MajorImageVersion
1>46	| MinorImageVersion
1>48	| MajorSubsystemVersion
1>50	| MinorSubsystemVersion
1>52	| Win32VersionValue
1>56	| SizeOfImage
1>60	| SizeOfHeaders
1>64	| CheckSum
1>68	| Subsystem
1>70	| DllCharacteristics
1>72	| SizeOfStackReserve
1>76	| SizeOfStackCommit
1>80	| SizeOfHeapReserve
1>84	| SizeOfHeapCommit
1>88	| LoaderFlags
1>92	| NumberOfRvaAndSizes
1>96	| DataDirectory
1>	+---
1>
1>class _IMAGE_ROM_OPTIONAL_HEADER	size(56):
1>	+---
1> 0	| Magic
1> 2	| MajorLinkerVersion
1> 3	| MinorLinkerVersion
1> 4	| SizeOfCode
1> 8	| SizeOfInitializedData
1>12	| SizeOfUninitializedData
1>16	| AddressOfEntryPoint
1>20	| BaseOfCode
1>24	| BaseOfData
1>28	| BaseOfBss
1>32	| GprMask
1>36	| CprMask
1>52	| GpValue
1>	+---
1>
1>class _IMAGE_OPTIONAL_HEADER64	size(240):
1>	+---
1> 0	| Magic
1> 2	| MajorLinkerVersion
1> 3	| MinorLinkerVersion
1> 4	| SizeOfCode
1> 8	| SizeOfInitializedData
1>12	| SizeOfUninitializedData
1>16	| AddressOfEntryPoint
1>20	| BaseOfCode
1>24	| ImageBase
1>32	| SectionAlignment
1>36	| FileAlignment
1>40	| MajorOperatingSystemVersion
1>42	| MinorOperatingSystemVersion
1>44	| MajorImageVersion
1>46	| MinorImageVersion
1>48	| MajorSubsystemVersion
1>50	| MinorSubsystemVersion
1>52	| Win32VersionValue
1>56	| SizeOfImage
1>60	| SizeOfHeaders
1>64	| CheckSum
1>68	| Subsystem
1>70	| DllCharacteristics
1>72	| SizeOfStackReserve
1>80	| SizeOfStackCommit
1>88	| SizeOfHeapReserve
1>96	| SizeOfHeapCommit
1>104	| LoaderFlags
1>108	| NumberOfRvaAndSizes
1>112	| DataDirectory
1>	+---
1>
1>class _IMAGE_NT_HEADERS64	size(264):
1>	+---
1> 0	| Signature
1> 4	| _IMAGE_FILE_HEADER FileHeader
1>24	| _IMAGE_OPTIONAL_HEADER64 OptionalHeader
1>	+---
1>
1>class _IMAGE_NT_HEADERS	size(248):
1>	+---
1> 0	| Signature
1> 4	| _IMAGE_FILE_HEADER FileHeader
1>24	| _IMAGE_OPTIONAL_HEADER OptionalHeader
1>	+---
1>
1>class _IMAGE_ROM_HEADERS	size(76):
1>	+---
1> 0	| _IMAGE_FILE_HEADER FileHeader
1>20	| _IMAGE_ROM_OPTIONAL_HEADER OptionalHeader
1>	+---
1>
1>class ANON_OBJECT_HEADER	size(32):
1>	+---
1> 0	| Sig1
1> 2	| Sig2
1> 4	| Version
1> 6	| Machine
1> 8	| TimeDateStamp
1>12	| _GUID ClassID
1>28	| SizeOfData
1>	+---
1>
1>class ANON_OBJECT_HEADER_V2	size(44):
1>	+---
1> 0	| Sig1
1> 2	| Sig2
1> 4	| Version
1> 6	| Machine
1> 8	| TimeDateStamp
1>12	| _GUID ClassID
1>28	| SizeOfData
1>32	| Flags
1>36	| MetaDataSize
1>40	| MetaDataOffset
1>	+---
1>
1>class ANON_OBJECT_HEADER_BIGOBJ	size(56):
1>	+---
1> 0	| Sig1
1> 2	| Sig2
1> 4	| Version
1> 6	| Machine
1> 8	| TimeDateStamp
1>12	| _GUID ClassID
1>28	| SizeOfData
1>32	| Flags
1>36	| MetaDataSize
1>40	| MetaDataOffset
1>44	| NumberOfSections
1>48	| PointerToSymbolTable
1>52	| NumberOfSymbols
1>	+---
1>
1>class _IMAGE_SECTION_HEADER::<unnamed-tag>	size(4):
1>	+---
1> 0	| PhysicalAddress
1> 0	| VirtualSize
1>	+---
1>
1>class _IMAGE_SECTION_HEADER	size(40):
1>	+---
1> 0	| Name
1> 8	| <unnamed-type-Misc> Misc
1>12	| VirtualAddress
1>16	| SizeOfRawData
1>20	| PointerToRawData
1>24	| PointerToRelocations
1>28	| PointerToLinenumbers
1>32	| NumberOfRelocations
1>34	| NumberOfLinenumbers
1>36	| Characteristics
1>	+---
1>
1>class _IMAGE_SYMBOL::<unnamed-tag>::<unnamed-tag>	size(8):
1>	+---
1> 0	| Short
1> 4	| Long
1>	+---
1>
1>class _IMAGE_SYMBOL::<unnamed-tag>	size(8):
1>	+---
1> 0	| ShortName
1> 0	| <unnamed-type-Name> Name
1> 0	| LongName
1>	+---
1>
1>class _IMAGE_SYMBOL	size(18):
1>	+---
1> 0	| <unnamed-type-N> N
1> 8	| Value
1>12	| SectionNumber
1>14	| Type
1>16	| StorageClass
1>17	| NumberOfAuxSymbols
1>	+---
1>
1>class _IMAGE_SYMBOL_EX::<unnamed-tag>::<unnamed-tag>	size(8):
1>	+---
1> 0	| Short
1> 4	| Long
1>	+---
1>
1>class _IMAGE_SYMBOL_EX::<unnamed-tag>	size(8):
1>	+---
1> 0	| ShortName
1> 0	| <unnamed-type-Name> Name
1> 0	| LongName
1>	+---
1>
1>class _IMAGE_SYMBOL_EX	size(20):
1>	+---
1> 0	| <unnamed-type-N> N
1> 8	| Value
1>12	| SectionNumber
1>16	| Type
1>18	| StorageClass
1>19	| NumberOfAuxSymbols
1>	+---
1>
1>class IMAGE_AUX_SYMBOL_TOKEN_DEF	size(18):
1>	+---
1> 0	| bAuxType
1> 1	| bReserved
1> 2	| SymbolTableIndex
1> 6	| rgbReserved
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| Linenumber
1> 2	| Size
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| <unnamed-type-LnSz> LnSz
1> 0	| TotalSize
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(8):
1>	+---
1> 0	| PointerToLinenumber
1> 4	| PointerToNextFunction
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(8):
1>	+---
1> 0	| Dimension
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>::<unnamed-tag>	size(8):
1>	+---
1> 0	| <unnamed-type-Function> Function
1> 0	| <unnamed-type-Array> Array
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>	size(18):
1>	+---
1> 0	| TagIndex
1> 4	| <unnamed-type-Misc> Misc
1> 8	| <unnamed-type-FcnAry> FcnAry
1>16	| TvIndex
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>	size(18):
1>	+---
1> 0	| Name
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>	size(18):
1>	+---
1> 0	| Length
1> 4	| NumberOfRelocations
1> 6	| NumberOfLinenumbers
1> 8	| CheckSum
1>12	| Number
1>14	| Selection
1>15	| bReserved
1>16	| HighNumber
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL::<unnamed-tag>	size(18):
1>	+---
1> 0	| crc
1> 4	| rgbReserved
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL	size(18):
1>	+---
1> 0	| <unnamed-type-Sym> Sym
1> 0	| <unnamed-type-File> File
1> 0	| <unnamed-type-Section> Section
1> 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
1> 0	| <unnamed-type-CRC> CRC
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
1>	+---
1> 0	| WeakDefaultSymIndex
1> 4	| WeakSearchType
1> 8	| rgbReserved
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
1>	+---
1> 0	| Name
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
1>	+---
1> 0	| Length
1> 4	| NumberOfRelocations
1> 6	| NumberOfLinenumbers
1> 8	| CheckSum
1>12	| Number
1>14	| Selection
1>15	| bReserved
1>16	| HighNumber
1>18	| rgbReserved
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
1>	+---
1> 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
1>18	| rgbReserved
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL_EX::<unnamed-tag>	size(20):
1>	+---
1> 0	| crc
1> 4	| rgbReserved
1>	+---
1>
1>class _IMAGE_AUX_SYMBOL_EX	size(20):
1>	+---
1> 0	| <unnamed-type-Sym> Sym
1> 0	| <unnamed-type-File> File
1> 0	| <unnamed-type-Section> Section
1> 0	| IMAGE_AUX_SYMBOL_TOKEN_DEF TokenDef
1>18	| rgbReserved
1> 0	| <unnamed-type-CRC> CRC
1>	+---
1>
1>class _IMAGE_RELOCATION::<unnamed-tag>	size(4):
1>	+---
1> 0	| VirtualAddress
1> 0	| RelocCount
1>	+---
1>
1>class _IMAGE_RELOCATION	size(10):
1>	+---
1> 0	| VirtualAddress
1> 0	| RelocCount
1> 4	| SymbolTableIndex
1> 8	| Type
1>	+---
1>
1>class _IMAGE_LINENUMBER::<unnamed-tag>	size(4):
1>	+---
1> 0	| SymbolTableIndex
1> 0	| VirtualAddress
1>	+---
1>
1>class _IMAGE_LINENUMBER	size(6):
1>	+---
1> 0	| <unnamed-type-Type> Type
1> 4	| Linenumber
1>	+---
1>
1>class _IMAGE_BASE_RELOCATION	size(8):
1>	+---
1> 0	| VirtualAddress
1> 4	| SizeOfBlock
1>	+---
1>
1>class _IMAGE_ARCHIVE_MEMBER_HEADER	size(60):
1>	+---
1> 0	| Name
1>16	| Date
1>28	| UserID
1>34	| GroupID
1>40	| Mode
1>48	| Size
1>58	| EndHeader
1>	+---
1>
1>class _IMAGE_EXPORT_DIRECTORY	size(40):
1>	+---
1> 0	| Characteristics
1> 4	| TimeDateStamp
1> 8	| MajorVersion
1>10	| MinorVersion
1>12	| Name
1>16	| Base
1>20	| NumberOfFunctions
1>24	| NumberOfNames
1>28	| AddressOfFunctions
1>32	| AddressOfNames
1>36	| AddressOfNameOrdinals
1>	+---
1>
1>class _IMAGE_IMPORT_BY_NAME	size(4):
1>	+---
1> 0	| Hint
1> 2	| Name
1>  	| <alignment member> (size=1)
1>	+---
1>
1>class _IMAGE_THUNK_DATA64::<unnamed-tag>	size(8):
1>	+---
1> 0	| ForwarderString
1> 0	| Function
1> 0	| Ordinal
1> 0	| AddressOfData
1>	+---
1>
1>class _IMAGE_THUNK_DATA64	size(8):
1>	+---
1> 0	| <unnamed-type-u1> u1
1>	+---
1>
1>class _IMAGE_THUNK_DATA32::<unnamed-tag>	size(4):
1>	+---
1> 0	| ForwarderString
1> 0	| Function
1> 0	| Ordinal
1> 0	| AddressOfData
1>	+---
1>
1>class _IMAGE_THUNK_DATA32	size(4):
1>	+---
1> 0	| <unnamed-type-u1> u1
1>	+---
1>
1>class _IMAGE_TLS_DIRECTORY64::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| Reserved0 (bitstart=0,nbits=20)
1> 0.	| Alignment (bitstart=20,nbits=4)
1> 0.	| Reserved1 (bitstart=24,nbits=8)
1>	+---
1>
1>class _IMAGE_TLS_DIRECTORY64::<unnamed-tag>	size(4):
1>	+---
1> 0	| Characteristics
1> 0.	| Reserved0 (bitstart=0,nbits=20)
1> 0.	| Alignment (bitstart=20,nbits=4)
1> 0.	| Reserved1 (bitstart=24,nbits=8)
1>	+---
1>
1>class _IMAGE_TLS_DIRECTORY64	size(40):
1>	+---
1> 0	| StartAddressOfRawData
1> 8	| EndAddressOfRawData
1>16	| AddressOfIndex
1>24	| AddressOfCallBacks
1>32	| SizeOfZeroFill
1>  	| <unnamed-tag> <alignment member> (size=36)
1>36	| Characteristics
1>  	| <unnamed-tag> <alignment member> (size=36)
1>36.	| Reserved0 (bitstart=0,nbits=20)
1>36.	| Alignment (bitstart=20,nbits=4)
1>36.	| Reserved1 (bitstart=24,nbits=8)
1>  	| <unnamed-tag> <alignment member> (size=36)
1>	+---
1>
1>class _IMAGE_TLS_DIRECTORY32::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| Reserved0 (bitstart=0,nbits=20)
1> 0.	| Alignment (bitstart=20,nbits=4)
1> 0.	| Reserved1 (bitstart=24,nbits=8)
1>	+---
1>
1>class _IMAGE_TLS_DIRECTORY32::<unnamed-tag>	size(4):
1>	+---
1> 0	| Characteristics
1> 0.	| Reserved0 (bitstart=0,nbits=20)
1> 0.	| Alignment (bitstart=20,nbits=4)
1> 0.	| Reserved1 (bitstart=24,nbits=8)
1>	+---
1>
1>class _IMAGE_TLS_DIRECTORY32	size(24):
1>	+---
1> 0	| StartAddressOfRawData
1> 4	| EndAddressOfRawData
1> 8	| AddressOfIndex
1>12	| AddressOfCallBacks
1>16	| SizeOfZeroFill
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20	| Characteristics
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20.	| Reserved0 (bitstart=0,nbits=20)
1>20.	| Alignment (bitstart=20,nbits=4)
1>20.	| Reserved1 (bitstart=24,nbits=8)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>	+---
1>
1>class _IMAGE_IMPORT_DESCRIPTOR::<unnamed-tag>	size(4):
1>	+---
1> 0	| Characteristics
1> 0	| OriginalFirstThunk
1>	+---
1>
1>class _IMAGE_IMPORT_DESCRIPTOR	size(20):
1>	+---
1> 0	| Characteristics
1> 0	| OriginalFirstThunk
1> 4	| TimeDateStamp
1> 8	| ForwarderChain
1>12	| Name
1>16	| FirstThunk
1>	+---
1>
1>class _IMAGE_BOUND_IMPORT_DESCRIPTOR	size(8):
1>	+---
1> 0	| TimeDateStamp
1> 4	| OffsetModuleName
1> 6	| NumberOfModuleForwarderRefs
1>	+---
1>
1>class _IMAGE_BOUND_FORWARDER_REF	size(8):
1>	+---
1> 0	| TimeDateStamp
1> 4	| OffsetModuleName
1> 6	| Reserved
1>	+---
1>
1>class _IMAGE_DELAYLOAD_DESCRIPTOR::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| RvaBased (bitstart=0,nbits=1)
1> 0.	| ReservedAttributes (bitstart=1,nbits=31)
1>	+---
1>
1>class _IMAGE_DELAYLOAD_DESCRIPTOR::<unnamed-tag>	size(4):
1>	+---
1> 0	| AllAttributes
1> 0.	| RvaBased (bitstart=0,nbits=1)
1> 0.	| ReservedAttributes (bitstart=1,nbits=31)
1>	+---
1>
1>class _IMAGE_DELAYLOAD_DESCRIPTOR	size(32):
1>	+---
1> 0	| <unnamed-type-Attributes> Attributes
1> 4	| DllNameRVA
1> 8	| ModuleHandleRVA
1>12	| ImportAddressTableRVA
1>16	| ImportNameTableRVA
1>20	| BoundImportAddressTableRVA
1>24	| UnloadInformationTableRVA
1>28	| TimeDateStamp
1>	+---
1>
1>class _IMAGE_RESOURCE_DIRECTORY	size(16):
1>	+---
1> 0	| Characteristics
1> 4	| TimeDateStamp
1> 8	| MajorVersion
1>10	| MinorVersion
1>12	| NumberOfNamedEntries
1>14	| NumberOfIdEntries
1>	+---
1>
1>class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| NameOffset (bitstart=0,nbits=31)
1> 0.	| NameIsString (bitstart=31,nbits=1)
1>	+---
1>
1>class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<unnamed-tag>	size(4):
1>	+---
1> 0.	| NameOffset (bitstart=0,nbits=31)
1> 0.	| NameIsString (bitstart=31,nbits=1)
1> 0	| Name
1> 0	| Id
1>	+---
1>
1>class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| OffsetToDirectory (bitstart=0,nbits=31)
1> 0.	| DataIsDirectory (bitstart=31,nbits=1)
1>	+---
1>
1>class _IMAGE_RESOURCE_DIRECTORY_ENTRY::<unnamed-tag>	size(4):
1>	+---
1> 0	| OffsetToData
1> 0.	| OffsetToDirectory (bitstart=0,nbits=31)
1> 0.	| DataIsDirectory (bitstart=31,nbits=1)
1>	+---
1>
1>class _IMAGE_RESOURCE_DIRECTORY_ENTRY	size(8):
1>	+---
1> 0.	| NameOffset (bitstart=0,nbits=31)
1> 0.	| NameIsString (bitstart=31,nbits=1)
1> 0	| Name
1> 0	| Id
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| OffsetToData
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4.	| OffsetToDirectory (bitstart=0,nbits=31)
1> 4.	| DataIsDirectory (bitstart=31,nbits=1)
1>  	| <unnamed-tag> <alignment member> (size=4)
1>	+---
1>
1>class _IMAGE_RESOURCE_DIRECTORY_STRING	size(4):
1>	+---
1> 0	| Length
1> 2	| NameString
1>  	| <alignment member> (size=1)
1>	+---
1>
1>class _IMAGE_RESOURCE_DIR_STRING_U	size(4):
1>	+---
1> 0	| Length
1> 2	| NameString
1>	+---
1>
1>class _IMAGE_RESOURCE_DATA_ENTRY	size(16):
1>	+---
1> 0	| OffsetToData
1> 4	| Size
1> 8	| CodePage
1>12	| Reserved
1>	+---
1>
1>class _IMAGE_LOAD_CONFIG_CODE_INTEGRITY	size(12):
1>	+---
1> 0	| Flags
1> 2	| Catalog
1> 4	| CatalogOffset
1> 8	| Reserved
1>	+---
1>
1>class _IMAGE_DYNAMIC_RELOCATION_TABLE	size(8):
1>	+---
1> 0	| Version
1> 4	| Size
1>	+---
1>
1>class _IMAGE_DYNAMIC_RELOCATION32	size(8):
1>	+---
1> 0	| Symbol
1> 4	| BaseRelocSize
1>	+---
1>
1>class _IMAGE_DYNAMIC_RELOCATION64	size(12):
1>	+---
1> 0	| Symbol
1> 8	| BaseRelocSize
1>	+---
1>
1>class _IMAGE_DYNAMIC_RELOCATION32_V2	size(20):
1>	+---
1> 0	| HeaderSize
1> 4	| FixupInfoSize
1> 8	| Symbol
1>12	| SymbolGroup
1>16	| Flags
1>	+---
1>
1>class _IMAGE_DYNAMIC_RELOCATION64_V2	size(24):
1>	+---
1> 0	| HeaderSize
1> 4	| FixupInfoSize
1> 8	| Symbol
1>16	| SymbolGroup
1>20	| Flags
1>	+---
1>
1>class _IMAGE_PROLOGUE_DYNAMIC_RELOCATION_HEADER	size(1):
1>	+---
1> 0	| PrologueByteCount
1>	+---
1>
1>class _IMAGE_EPILOGUE_DYNAMIC_RELOCATION_HEADER	size(8):
1>	+---
1> 0	| EpilogueCount
1> 4	| EpilogueByteCount
1> 5	| BranchDescriptorElementSize
1> 6	| BranchDescriptorCount
1>	+---
1>
1>class _IMAGE_LOAD_CONFIG_DIRECTORY32	size(160):
1>	+---
1> 0	| Size
1> 4	| TimeDateStamp
1> 8	| MajorVersion
1>10	| MinorVersion
1>12	| GlobalFlagsClear
1>16	| GlobalFlagsSet
1>20	| CriticalSectionDefaultTimeout
1>24	| DeCommitFreeBlockThreshold
1>28	| DeCommitTotalFreeThreshold
1>32	| LockPrefixTable
1>36	| MaximumAllocationSize
1>40	| VirtualMemoryThreshold
1>44	| ProcessHeapFlags
1>48	| ProcessAffinityMask
1>52	| CSDVersion
1>54	| DependentLoadFlags
1>56	| EditList
1>60	| SecurityCookie
1>64	| SEHandlerTable
1>68	| SEHandlerCount
1>72	| GuardCFCheckFunctionPointer
1>76	| GuardCFDispatchFunctionPointer
1>80	| GuardCFFunctionTable
1>84	| GuardCFFunctionCount
1>88	| GuardFlags
1>92	| _IMAGE_LOAD_CONFIG_CODE_INTEGRITY CodeIntegrity
1>104	| GuardAddressTakenIatEntryTable
1>108	| GuardAddressTakenIatEntryCount
1>112	| GuardLongJumpTargetTable
1>116	| GuardLongJumpTargetCount
1>120	| DynamicValueRelocTable
1>124	| CHPEMetadataPointer
1>128	| GuardRFFailureRoutine
1>132	| GuardRFFailureRoutineFunctionPointer
1>136	| DynamicValueRelocTableOffset
1>140	| DynamicValueRelocTableSection
1>142	| Reserved2
1>144	| GuardRFVerifyStackPointerFunctionPointer
1>148	| HotPatchTableOffset
1>152	| Reserved3
1>156	| EnclaveConfigurationPointer
1>	+---
1>
1>class _IMAGE_LOAD_CONFIG_DIRECTORY64	size(256):
1>	+---
1> 0	| Size
1> 4	| TimeDateStamp
1> 8	| MajorVersion
1>10	| MinorVersion
1>12	| GlobalFlagsClear
1>16	| GlobalFlagsSet
1>20	| CriticalSectionDefaultTimeout
1>24	| DeCommitFreeBlockThreshold
1>32	| DeCommitTotalFreeThreshold
1>40	| LockPrefixTable
1>48	| MaximumAllocationSize
1>56	| VirtualMemoryThreshold
1>64	| ProcessAffinityMask
1>72	| ProcessHeapFlags
1>76	| CSDVersion
1>78	| DependentLoadFlags
1>80	| EditList
1>88	| SecurityCookie
1>96	| SEHandlerTable
1>104	| SEHandlerCount
1>112	| GuardCFCheckFunctionPointer
1>120	| GuardCFDispatchFunctionPointer
1>128	| GuardCFFunctionTable
1>136	| GuardCFFunctionCount
1>144	| GuardFlags
1>148	| _IMAGE_LOAD_CONFIG_CODE_INTEGRITY CodeIntegrity
1>160	| GuardAddressTakenIatEntryTable
1>168	| GuardAddressTakenIatEntryCount
1>176	| GuardLongJumpTargetTable
1>184	| GuardLongJumpTargetCount
1>192	| DynamicValueRelocTable
1>200	| CHPEMetadataPointer
1>208	| GuardRFFailureRoutine
1>216	| GuardRFFailureRoutineFunctionPointer
1>224	| DynamicValueRelocTableOffset
1>228	| DynamicValueRelocTableSection
1>230	| Reserved2
1>232	| GuardRFVerifyStackPointerFunctionPointer
1>240	| HotPatchTableOffset
1>244	| Reserved3
1>248	| EnclaveConfigurationPointer
1>	+---
1>
1>class _IMAGE_HOT_PATCH_INFO	size(24):
1>	+---
1> 0	| Version
1> 4	| Size
1> 8	| SequenceNumber
1>12	| BaseImageList
1>16	| BaseImageCount
1>20	| BufferOffset
1>	+---
1>
1>class _IMAGE_HOT_PATCH_BASE	size(32):
1>	+---
1> 0	| SequenceNumber
1> 4	| Flags
1> 8	| OriginalTimeDateStamp
1>12	| OriginalCheckSum
1>16	| CodeIntegrityInfo
1>20	| CodeIntegritySize
1>24	| PatchTable
1>28	| BufferOffset
1>	+---
1>
1>class _IMAGE_HOT_PATCH_HASHES	size(52):
1>	+---
1> 0	| SHA256
1>32	| SHA1
1>	+---
1>
1>class _IMAGE_CE_RUNTIME_FUNCTION_ENTRY	size(8):
1>	+---
1> 0	| FuncStart
1> 4.	| PrologLen (bitstart=0,nbits=8)
1> 4.	| FuncLen (bitstart=8,nbits=22)
1> 4.	| ThirtyTwoBit (bitstart=30,nbits=1)
1> 4.	| ExceptionFlag (bitstart=31,nbits=1)
1>	+---
1>
1>class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| Flag (bitstart=0,nbits=2)
1> 0.	| FunctionLength (bitstart=2,nbits=11)
1> 0.	| Ret (bitstart=13,nbits=2)
1> 0.	| H (bitstart=15,nbits=1)
1> 0.	| Reg (bitstart=16,nbits=3)
1> 0.	| R (bitstart=19,nbits=1)
1> 0.	| L (bitstart=20,nbits=1)
1> 0.	| C (bitstart=21,nbits=1)
1> 0.	| StackAdjust (bitstart=22,nbits=10)
1>	+---
1>
1>class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>	size(4):
1>	+---
1> 0	| UnwindData
1> 0.	| Flag (bitstart=0,nbits=2)
1> 0.	| FunctionLength (bitstart=2,nbits=11)
1> 0.	| Ret (bitstart=13,nbits=2)
1> 0.	| H (bitstart=15,nbits=1)
1> 0.	| Reg (bitstart=16,nbits=3)
1> 0.	| R (bitstart=19,nbits=1)
1> 0.	| L (bitstart=20,nbits=1)
1> 0.	| C (bitstart=21,nbits=1)
1> 0.	| StackAdjust (bitstart=22,nbits=10)
1>	+---
1>
1>class _IMAGE_ARM_RUNTIME_FUNCTION_ENTRY	size(8):
1>	+---
1> 0	| BeginAddress
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| UnwindData
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4.	| Flag (bitstart=0,nbits=2)
1> 4.	| FunctionLength (bitstart=2,nbits=11)
1> 4.	| Ret (bitstart=13,nbits=2)
1> 4.	| H (bitstart=15,nbits=1)
1> 4.	| Reg (bitstart=16,nbits=3)
1> 4.	| R (bitstart=19,nbits=1)
1> 4.	| L (bitstart=20,nbits=1)
1> 4.	| C (bitstart=21,nbits=1)
1> 4.	| StackAdjust (bitstart=22,nbits=10)
1>  	| <unnamed-tag> <alignment member> (size=4)
1>	+---
1>
1>class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| Flag (bitstart=0,nbits=2)
1> 0.	| FunctionLength (bitstart=2,nbits=11)
1> 0.	| RegF (bitstart=13,nbits=3)
1> 0.	| RegI (bitstart=16,nbits=4)
1> 0.	| H (bitstart=20,nbits=1)
1> 0.	| CR (bitstart=21,nbits=2)
1> 0.	| FrameSize (bitstart=23,nbits=9)
1>	+---
1>
1>class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>	size(4):
1>	+---
1> 0	| UnwindData
1> 0.	| Flag (bitstart=0,nbits=2)
1> 0.	| FunctionLength (bitstart=2,nbits=11)
1> 0.	| RegF (bitstart=13,nbits=3)
1> 0.	| RegI (bitstart=16,nbits=4)
1> 0.	| H (bitstart=20,nbits=1)
1> 0.	| CR (bitstart=21,nbits=2)
1> 0.	| FrameSize (bitstart=23,nbits=9)
1>	+---
1>
1>class _IMAGE_ARM64_RUNTIME_FUNCTION_ENTRY	size(8):
1>	+---
1> 0	| BeginAddress
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| UnwindData
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4.	| Flag (bitstart=0,nbits=2)
1> 4.	| FunctionLength (bitstart=2,nbits=11)
1> 4.	| RegF (bitstart=13,nbits=3)
1> 4.	| RegI (bitstart=16,nbits=4)
1> 4.	| H (bitstart=20,nbits=1)
1> 4.	| CR (bitstart=21,nbits=2)
1> 4.	| FrameSize (bitstart=23,nbits=9)
1>  	| <unnamed-tag> <alignment member> (size=4)
1>	+---
1>
1>class _IMAGE_ALPHA64_RUNTIME_FUNCTION_ENTRY	size(40):
1>	+---
1> 0	| BeginAddress
1> 8	| EndAddress
1>16	| ExceptionHandler
1>24	| HandlerData
1>32	| PrologEndAddress
1>	+---
1>
1>class _IMAGE_ALPHA_RUNTIME_FUNCTION_ENTRY	size(20):
1>	+---
1> 0	| BeginAddress
1> 4	| EndAddress
1> 8	| ExceptionHandler
1>12	| HandlerData
1>16	| PrologEndAddress
1>	+---
1>
1>class _IMAGE_RUNTIME_FUNCTION_ENTRY::<unnamed-tag>	size(4):
1>	+---
1> 0	| UnwindInfoAddress
1> 0	| UnwindData
1>	+---
1>
1>class _IMAGE_RUNTIME_FUNCTION_ENTRY	size(12):
1>	+---
1> 0	| BeginAddress
1> 4	| EndAddress
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| UnwindInfoAddress
1> 8	| UnwindData
1>	+---
1>
1>class _IMAGE_ENCLAVE_CONFIG32	size(76):
1>	+---
1> 0	| Size
1> 4	| MinimumRequiredConfigSize
1> 8	| PolicyFlags
1>12	| NumberOfImports
1>16	| ImportList
1>20	| ImportEntrySize
1>24	| FamilyID
1>40	| ImageID
1>56	| ImageVersion
1>60	| SecurityVersion
1>64	| EnclaveSize
1>68	| NumberOfThreads
1>72	| EnclaveFlags
1>	+---
1>
1>class _IMAGE_ENCLAVE_CONFIG64	size(80):
1>	+---
1> 0	| Size
1> 4	| MinimumRequiredConfigSize
1> 8	| PolicyFlags
1>12	| NumberOfImports
1>16	| ImportList
1>20	| ImportEntrySize
1>24	| FamilyID
1>40	| ImageID
1>56	| ImageVersion
1>60	| SecurityVersion
1>64	| EnclaveSize
1>72	| NumberOfThreads
1>76	| EnclaveFlags
1>	+---
1>
1>class _IMAGE_ENCLAVE_IMPORT	size(80):
1>	+---
1> 0	| MatchType
1> 4	| MinimumSecurityVersion
1> 8	| UniqueOrAuthorID
1>40	| FamilyID
1>56	| ImageID
1>72	| ImportName
1>76	| Reserved
1>	+---
1>
1>class _IMAGE_DEBUG_DIRECTORY	size(28):
1>	+---
1> 0	| Characteristics
1> 4	| TimeDateStamp
1> 8	| MajorVersion
1>10	| MinorVersion
1>12	| Type
1>16	| SizeOfData
1>20	| AddressOfRawData
1>24	| PointerToRawData
1>	+---
1>
1>class _IMAGE_COFF_SYMBOLS_HEADER	size(32):
1>	+---
1> 0	| NumberOfSymbols
1> 4	| LvaToFirstSymbol
1> 8	| NumberOfLinenumbers
1>12	| LvaToFirstLinenumber
1>16	| RvaToFirstByteOfCode
1>20	| RvaToLastByteOfCode
1>24	| RvaToFirstByteOfData
1>28	| RvaToLastByteOfData
1>	+---
1>
1>class _FPO_DATA	size(16):
1>	+---
1> 0	| ulOffStart
1> 4	| cbProcSize
1> 8	| cdwLocals
1>12	| cdwParams
1>14.	| cbProlog (bitstart=0,nbits=8)
1>14.	| cbRegs (bitstart=8,nbits=3)
1>14.	| fHasSEH (bitstart=11,nbits=1)
1>14.	| fUseBP (bitstart=12,nbits=1)
1>14.	| reserved (bitstart=13,nbits=1)
1>14.	| cbFrame (bitstart=14,nbits=2)
1>	+---
1>
1>class _IMAGE_DEBUG_MISC	size(16):
1>	+---
1> 0	| DataType
1> 4	| Length
1> 8	| Unicode
1> 9	| Reserved
1>12	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _IMAGE_FUNCTION_ENTRY	size(12):
1>	+---
1> 0	| StartingAddress
1> 4	| EndingAddress
1> 8	| EndOfPrologue
1>	+---
1>
1>class _IMAGE_FUNCTION_ENTRY64::<unnamed-tag>	size(8):
1>	+---
1> 0	| EndOfPrologue
1> 0	| UnwindInfoAddress
1>	+---
1>
1>class _IMAGE_FUNCTION_ENTRY64	size(24):
1>	+---
1> 0	| StartingAddress
1> 8	| EndingAddress
1>  	| <unnamed-tag> <alignment member> (size=16)
1>16	| EndOfPrologue
1>16	| UnwindInfoAddress
1>	+---
1>
1>class _IMAGE_SEPARATE_DEBUG_HEADER	size(48):
1>	+---
1> 0	| Signature
1> 2	| Flags
1> 4	| Machine
1> 6	| Characteristics
1> 8	| TimeDateStamp
1>12	| CheckSum
1>16	| ImageBase
1>20	| SizeOfImage
1>24	| NumberOfSections
1>28	| ExportedNamesSize
1>32	| DebugDirectorySize
1>36	| SectionAlignment
1>40	| Reserved
1>	+---
1>
1>class _NON_PAGED_DEBUG_INFO	size(32):
1>	+---
1> 0	| Signature
1> 2	| Flags
1> 4	| Size
1> 8	| Machine
1>10	| Characteristics
1>12	| TimeDateStamp
1>16	| CheckSum
1>20	| SizeOfImage
1>24	| ImageBase
1>	+---
1>
1>class _ImageArchitectureHeader	size(8):
1>	+---
1> 0.	| AmaskValue (bitstart=0,nbits=1)
1> 0.	| AmaskShift (bitstart=8,nbits=8)
1> 4	| FirstEntryRVA
1>	+---
1>
1>class _ImageArchitectureEntry	size(8):
1>	+---
1> 0	| FixupInstRVA
1> 4	| NewInst
1>	+---
1>
1>class IMPORT_OBJECT_HEADER::<unnamed-tag>	size(2):
1>	+---
1> 0	| Ordinal
1> 0	| Hint
1>	+---
1>
1>class IMPORT_OBJECT_HEADER	size(20):
1>	+---
1> 0	| Sig1
1> 2	| Sig2
1> 4	| Version
1> 6	| Machine
1> 8	| TimeDateStamp
1>12	| SizeOfData
1>  	| <unnamed-tag> <alignment member> (size=16)
1>16	| Ordinal
1>16	| Hint
1>18.	| Type (bitstart=0,nbits=2)
1>18.	| NameType (bitstart=2,nbits=3)
1>18.	| Reserved (bitstart=5,nbits=11)
1>	+---
1>
1>class IMAGE_COR20_HEADER::<unnamed-tag>	size(4):
1>	+---
1> 0	| EntryPointToken
1> 0	| EntryPointRVA
1>	+---
1>
1>class IMAGE_COR20_HEADER	size(72):
1>	+---
1> 0	| cb
1> 4	| MajorRuntimeVersion
1> 6	| MinorRuntimeVersion
1> 8	| _IMAGE_DATA_DIRECTORY MetaData
1>16	| Flags
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20	| EntryPointToken
1>20	| EntryPointRVA
1>24	| _IMAGE_DATA_DIRECTORY Resources
1>32	| _IMAGE_DATA_DIRECTORY StrongNameSignature
1>40	| _IMAGE_DATA_DIRECTORY CodeManagerTable
1>48	| _IMAGE_DATA_DIRECTORY VTableFixups
1>56	| _IMAGE_DATA_DIRECTORY ExportAddressTableJumps
1>64	| _IMAGE_DATA_DIRECTORY ManagedNativeHeader
1>	+---
1>
1>class _SLIST_HEADER::<unnamed-tag>	size(8):
1>	+---
1> 0	| _SINGLE_LIST_ENTRY Next
1> 4	| Depth
1> 6	| CpuId
1>	+---
1>
1>class _SLIST_HEADER	size(8):
1>	+---
1> 0	| Alignment
1> 0	| _SINGLE_LIST_ENTRY Next
1> 4	| Depth
1> 6	| CpuId
1>	+---
1>
1>class _RTL_RUN_ONCE	size(4):
1>	+---
1> 0	| Ptr
1>	+---
1>
1>class _RTL_BARRIER	size(24):
1>	+---
1> 0	| Reserved1
1> 4	| Reserved2
1> 8	| Reserved3
1>16	| Reserved4
1>20	| Reserved5
1>	+---
1>
1>class _MESSAGE_RESOURCE_ENTRY	size(6):
1>	+---
1> 0	| Length
1> 2	| Flags
1> 4	| Text
1>  	| <alignment member> (size=1)
1>	+---
1>
1>class _MESSAGE_RESOURCE_BLOCK	size(12):
1>	+---
1> 0	| LowId
1> 4	| HighId
1> 8	| OffsetToEntries
1>	+---
1>
1>class _MESSAGE_RESOURCE_DATA	size(16):
1>	+---
1> 0	| NumberOfBlocks
1> 4	| Blocks
1>	+---
1>
1>class _OSVERSIONINFOA	size(148):
1>	+---
1> 0	| dwOSVersionInfoSize
1> 4	| dwMajorVersion
1> 8	| dwMinorVersion
1>12	| dwBuildNumber
1>16	| dwPlatformId
1>20	| szCSDVersion
1>	+---
1>
1>class _OSVERSIONINFOW	size(276):
1>	+---
1> 0	| dwOSVersionInfoSize
1> 4	| dwMajorVersion
1> 8	| dwMinorVersion
1>12	| dwBuildNumber
1>16	| dwPlatformId
1>20	| szCSDVersion
1>	+---
1>
1>class _OSVERSIONINFOEXA	size(156):
1>	+---
1> 0	| dwOSVersionInfoSize
1> 4	| dwMajorVersion
1> 8	| dwMinorVersion
1>12	| dwBuildNumber
1>16	| dwPlatformId
1>20	| szCSDVersion
1>148	| wServicePackMajor
1>150	| wServicePackMinor
1>152	| wSuiteMask
1>154	| wProductType
1>155	| wReserved
1>	+---
1>
1>class _OSVERSIONINFOEXW	size(284):
1>	+---
1> 0	| dwOSVersionInfoSize
1> 4	| dwMajorVersion
1> 8	| dwMinorVersion
1>12	| dwBuildNumber
1>16	| dwPlatformId
1>20	| szCSDVersion
1>276	| wServicePackMajor
1>278	| wServicePackMinor
1>280	| wSuiteMask
1>282	| wProductType
1>283	| wReserved
1>	+---
1>
1>class CORRELATION_VECTOR	size(130):
1>	+---
1> 0	| Version
1> 1	| Vector
1>	+---
1>
1>class _IMAGE_POLICY_ENTRY::<unnamed-tag>	size(8):
1>	+---
1> 0	| None
1> 0	| BoolValue
1> 0	| Int8Value
1> 0	| UInt8Value
1> 0	| Int16Value
1> 0	| UInt16Value
1> 0	| Int32Value
1> 0	| UInt32Value
1>  	| <alignment member> (size=4)
1> 0	| Int64Value
1> 0	| UInt64Value
1> 0	| AnsiStringValue
1> 0	| UnicodeStringValue
1>	+---
1>
1>class _IMAGE_POLICY_ENTRY	size(16):
1>	+---
1> 0	| _IMAGE_POLICY_ENTRY_TYPE Type
1> 4	| _IMAGE_POLICY_ID PolicyId
1> 8	| <unnamed-type-u> u
1>	+---
1>
1>class _IMAGE_POLICY_METADATA	size(16):
1>	+---
1> 0	| Version
1> 1	| Reserved0
1> 8	| ApplicationId
1>16	| Policies
1>	+---
1>
1>class _RTL_CRITICAL_SECTION_DEBUG	size(32):
1>	+---
1> 0	| Type
1> 2	| CreatorBackTraceIndex
1> 4	| CriticalSection
1> 8	| _LIST_ENTRY ProcessLocksList
1>16	| EntryCount
1>20	| ContentionCount
1>24	| Flags
1>28	| CreatorBackTraceIndexHigh
1>30	| SpareWORD
1>	+---
1>
1>class _RTL_CRITICAL_SECTION	size(24):
1>	+---
1> 0	| DebugInfo
1> 4	| LockCount
1> 8	| RecursionCount
1>12	| OwningThread
1>16	| LockSemaphore
1>20	| SpinCount
1>	+---
1>
1>class _RTL_SRWLOCK	size(4):
1>	+---
1> 0	| Ptr
1>	+---
1>
1>class _RTL_CONDITION_VARIABLE	size(4):
1>	+---
1> 0	| Ptr
1>	+---
1>
1>class _HEAP_OPTIMIZE_RESOURCES_INFORMATION	size(8):
1>	+---
1> 0	| Version
1> 4	| Flags
1>	+---
1>
1>class _ACTIVATION_CONTEXT_QUERY_INDEX	size(8):
1>	+---
1> 0	| ulAssemblyIndex
1> 4	| ulFileIndexInAssembly
1>	+---
1>
1>class _ASSEMBLY_FILE_DETAILED_INFORMATION	size(20):
1>	+---
1> 0	| ulFlags
1> 4	| ulFilenameLength
1> 8	| ulPathLength
1>12	| lpFileName
1>16	| lpFilePath
1>	+---
1>
1>class _ACTIVATION_CONTEXT_ASSEMBLY_DETAILED_INFORMATION	size(88):
1>	+---
1> 0	| ulFlags
1> 4	| ulEncodedAssemblyIdentityLength
1> 8	| ulManifestPathType
1>12	| ulManifestPathLength
1>16	| _LARGE_INTEGER liManifestLastWriteTime
1>24	| ulPolicyPathType
1>28	| ulPolicyPathLength
1>32	| _LARGE_INTEGER liPolicyLastWriteTime
1>40	| ulMetadataSatelliteRosterIndex
1>44	| ulManifestVersionMajor
1>48	| ulManifestVersionMinor
1>52	| ulPolicyVersionMajor
1>56	| ulPolicyVersionMinor
1>60	| ulAssemblyDirectoryNameLength
1>64	| lpAssemblyEncodedAssemblyIdentity
1>68	| lpAssemblyManifestPath
1>72	| lpAssemblyPolicyPath
1>76	| lpAssemblyDirectoryName
1>80	| ulFileCount
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class _ACTIVATION_CONTEXT_RUN_LEVEL_INFORMATION	size(12):
1>	+---
1> 0	| ulFlags
1> 4	| ACTCTX_REQUESTED_RUN_LEVEL RunLevel
1> 8	| UiAccess
1>	+---
1>
1>class _COMPATIBILITY_CONTEXT_ELEMENT	size(20):
1>	+---
1> 0	| _GUID Id
1>16	| ACTCTX_COMPATIBILITY_ELEMENT_TYPE Type
1>	+---
1>
1>class _ACTIVATION_CONTEXT_COMPATIBILITY_INFORMATION	size(4):
1>	+---
1> 0	| ElementCount
1> 4	| Elements
1>	+---
1>
1>class _SUPPORTED_OS_INFO	size(4):
1>	+---
1> 0	| MajorVersion
1> 2	| MinorVersion
1>	+---
1>
1>class _ACTIVATION_CONTEXT_DETAILED_INFORMATION	size(48):
1>	+---
1> 0	| dwFlags
1> 4	| ulFormatVersion
1> 8	| ulAssemblyCount
1>12	| ulRootManifestPathType
1>16	| ulRootManifestPathChars
1>20	| ulRootConfigurationPathType
1>24	| ulRootConfigurationPathChars
1>28	| ulAppDirPathType
1>32	| ulAppDirPathChars
1>36	| lpRootManifestPath
1>40	| lpRootConfigurationPath
1>44	| lpAppDirPath
1>	+---
1>
1>class _HARDWARE_COUNTER_DATA	size(16):
1>	+---
1> 0	| _HARDWARE_COUNTER_TYPE Type
1> 4	| Reserved
1> 8	| Value
1>	+---
1>
1>class _PERFORMANCE_DATA	size(288):
1>	+---
1> 0	| Size
1> 2	| Version
1> 3	| HwCountersCount
1> 4	| ContextSwitchCount
1> 8	| WaitReasonBitMap
1>16	| CycleTime
1>24	| RetryCount
1>28	| Reserved
1>32	| HwCounters
1>	+---
1>
1>class _EVENTLOGRECORD	size(56):
1>	+---
1> 0	| Length
1> 4	| Reserved
1> 8	| RecordNumber
1>12	| TimeGenerated
1>16	| TimeWritten
1>20	| EventID
1>24	| EventType
1>26	| NumStrings
1>28	| EventCategory
1>30	| ReservedFlags
1>32	| ClosingRecordNumber
1>36	| StringOffset
1>40	| UserSidLength
1>44	| UserSidOffset
1>48	| DataLength
1>52	| DataOffset
1>	+---
1>
1>class _EVENTSFORLOGFILE	size(520):
1>	+---
1> 0	| ulSize
1> 4	| szLogicalLogFile
1>516	| ulNumRecords
1>520	| pEventLogRecords
1>	+---
1>
1>class _PACKEDEVENTINFO	size(8):
1>	+---
1> 0	| ulSize
1> 4	| ulNumEventsForLogFile
1> 8	| ulOffsets
1>	+---
1>
1>class _TAPE_ERASE	size(8):
1>	+---
1> 0	| Type
1> 4	| Immediate
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _TAPE_PREPARE	size(8):
1>	+---
1> 0	| Operation
1> 4	| Immediate
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _TAPE_WRITE_MARKS	size(12):
1>	+---
1> 0	| Type
1> 4	| Count
1> 8	| Immediate
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _TAPE_GET_POSITION	size(16):
1>	+---
1> 0	| Type
1> 4	| Partition
1> 8	| _LARGE_INTEGER Offset
1>	+---
1>
1>class _TAPE_SET_POSITION	size(24):
1>	+---
1> 0	| Method
1> 4	| Partition
1> 8	| _LARGE_INTEGER Offset
1>16	| Immediate
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class _TAPE_GET_DRIVE_PARAMETERS	size(32):
1>	+---
1> 0	| ECC
1> 1	| Compression
1> 2	| DataPadding
1> 3	| ReportSetmarks
1> 4	| DefaultBlockSize
1> 8	| MaximumBlockSize
1>12	| MinimumBlockSize
1>16	| MaximumPartitionCount
1>20	| FeaturesLow
1>24	| FeaturesHigh
1>28	| EOTWarningZoneSize
1>	+---
1>
1>class _TAPE_SET_DRIVE_PARAMETERS	size(8):
1>	+---
1> 0	| ECC
1> 1	| Compression
1> 2	| DataPadding
1> 3	| ReportSetmarks
1> 4	| EOTWarningZoneSize
1>	+---
1>
1>class _TAPE_GET_MEDIA_PARAMETERS	size(32):
1>	+---
1> 0	| _LARGE_INTEGER Capacity
1> 8	| _LARGE_INTEGER Remaining
1>16	| BlockSize
1>20	| PartitionCount
1>24	| WriteProtected
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class _TAPE_SET_MEDIA_PARAMETERS	size(4):
1>	+---
1> 0	| BlockSize
1>	+---
1>
1>class _TAPE_CREATE_PARTITION	size(12):
1>	+---
1> 0	| Method
1> 4	| Count
1> 8	| Size
1>	+---
1>
1>class _TAPE_WMI_OPERATIONS	size(12):
1>	+---
1> 0	| Method
1> 4	| DataBufferSize
1> 8	| DataBuffer
1>	+---
1>
1>class _TRANSACTION_NOTIFICATION	size(24):
1>	+---
1> 0	| TransactionKey
1> 4	| TransactionNotification
1> 8	| _LARGE_INTEGER TmVirtualClock
1>16	| ArgumentLength
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class _TRANSACTION_NOTIFICATION_RECOVERY_ARGUMENT	size(32):
1>	+---
1> 0	| _GUID EnlistmentId
1>16	| _GUID UOW
1>	+---
1>
1>class _TRANSACTION_NOTIFICATION_TM_ONLINE_ARGUMENT	size(20):
1>	+---
1> 0	| _GUID TmIdentity
1>16	| Flags
1>	+---
1>
1>class _TRANSACTION_NOTIFICATION_SAVEPOINT_ARGUMENT	size(4):
1>	+---
1> 0	| SavepointId
1>	+---
1>
1>class _TRANSACTION_NOTIFICATION_PROPAGATE_ARGUMENT	size(40):
1>	+---
1> 0	| PropagationCookie
1> 4	| _GUID UOW
1>20	| _GUID TmIdentity
1>36	| BufferLength
1>	+---
1>
1>class _TRANSACTION_NOTIFICATION_MARSHAL_ARGUMENT	size(20):
1>	+---
1> 0	| MarshalCookie
1> 4	| _GUID UOW
1>	+---
1>
1>class _KCRM_MARSHAL_HEADER	size(16):
1>	+---
1> 0	| VersionMajor
1> 4	| VersionMinor
1> 8	| NumProtocols
1>12	| Unused
1>	+---
1>
1>class _KCRM_TRANSACTION_BLOB	size(172):
1>	+---
1> 0	| _GUID UOW
1>16	| _GUID TmIdentity
1>32	| IsolationLevel
1>36	| IsolationFlags
1>40	| Timeout
1>44	| Description
1>	+---
1>
1>class _KCRM_PROTOCOL_BLOB	size(32):
1>	+---
1> 0	| _GUID ProtocolId
1>16	| StaticInfoLength
1>20	| TransactionIdInfoLength
1>24	| Unused1
1>28	| Unused2
1>	+---
1>
1>class _TRANSACTION_BASIC_INFORMATION	size(24):
1>	+---
1> 0	| _GUID TransactionId
1>16	| State
1>20	| Outcome
1>	+---
1>
1>class _TRANSACTIONMANAGER_BASIC_INFORMATION	size(24):
1>	+---
1> 0	| _GUID TmIdentity
1>16	| _LARGE_INTEGER VirtualClock
1>	+---
1>
1>class _TRANSACTIONMANAGER_LOG_INFORMATION	size(16):
1>	+---
1> 0	| _GUID LogIdentity
1>	+---
1>
1>class _TRANSACTIONMANAGER_LOGPATH_INFORMATION	size(8):
1>	+---
1> 0	| LogPathLength
1> 4	| LogPath
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _TRANSACTIONMANAGER_RECOVERY_INFORMATION	size(8):
1>	+---
1> 0	| LastRecoveredLsn
1>	+---
1>
1>class _TRANSACTIONMANAGER_OLDEST_INFORMATION	size(16):
1>	+---
1> 0	| _GUID OldestTransactionGuid
1>	+---
1>
1>class _TRANSACTION_PROPERTIES_INFORMATION	size(32):
1>	+---
1> 0	| IsolationLevel
1> 4	| IsolationFlags
1> 8	| _LARGE_INTEGER Timeout
1>16	| Outcome
1>20	| DescriptionLength
1>24	| Description
1>  	| <alignment member> (size=6)
1>	+---
1>
1>class _TRANSACTION_BIND_INFORMATION	size(4):
1>	+---
1> 0	| TmHandle
1>	+---
1>
1>class _TRANSACTION_ENLISTMENT_PAIR	size(32):
1>	+---
1> 0	| _GUID EnlistmentId
1>16	| _GUID ResourceManagerId
1>	+---
1>
1>class _TRANSACTION_ENLISTMENTS_INFORMATION	size(36):
1>	+---
1> 0	| NumberOfEnlistments
1> 4	| EnlistmentPair
1>	+---
1>
1>class _TRANSACTION_SUPERIOR_ENLISTMENT_INFORMATION	size(32):
1>	+---
1> 0	| _TRANSACTION_ENLISTMENT_PAIR SuperiorEnlistmentPair
1>	+---
1>
1>class _RESOURCEMANAGER_BASIC_INFORMATION	size(24):
1>	+---
1> 0	| _GUID ResourceManagerId
1>16	| DescriptionLength
1>20	| Description
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _RESOURCEMANAGER_COMPLETION_INFORMATION	size(8):
1>	+---
1> 0	| IoCompletionPortHandle
1> 4	| CompletionKey
1>	+---
1>
1>class _ENLISTMENT_BASIC_INFORMATION	size(48):
1>	+---
1> 0	| _GUID EnlistmentId
1>16	| _GUID TransactionId
1>32	| _GUID ResourceManagerId
1>	+---
1>
1>class _ENLISTMENT_CRM_INFORMATION	size(48):
1>	+---
1> 0	| _GUID CrmTransactionManagerId
1>16	| _GUID CrmResourceManagerId
1>32	| _GUID CrmEnlistmentId
1>	+---
1>
1>class _TRANSACTION_LIST_ENTRY	size(16):
1>	+---
1> 0	| _GUID UOW
1>	+---
1>
1>class _TRANSACTION_LIST_INFORMATION	size(20):
1>	+---
1> 0	| NumberOfTransactions
1> 4	| TransactionInformation
1>	+---
1>
1>class _KTMOBJECT_CURSOR	size(36):
1>	+---
1> 0	| _GUID LastQuery
1>16	| ObjectIdCount
1>20	| ObjectIds
1>	+---
1>
1>class _TP_POOL_STACK_INFORMATION	size(8):
1>	+---
1> 0	| StackReserve
1> 4	| StackCommit
1>	+---
1>
1>class _TP_CALLBACK_ENVIRON_V3::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| LongFunction (bitstart=0,nbits=1)
1> 0.	| Persistent (bitstart=1,nbits=1)
1> 0.	| Private (bitstart=2,nbits=30)
1>	+---
1>
1>class _TP_CALLBACK_ENVIRON_V3::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0	| <unnamed-type-s> s
1>	+---
1>
1>class _TP_CALLBACK_ENVIRON_V3	size(40):
1>	+---
1> 0	| Version
1> 4	| Pool
1> 8	| CleanupGroup
1>12	| CleanupGroupCancelCallback
1>16	| RaceDll
1>20	| ActivationContext
1>24	| FinalizationCallback
1>28	| <unnamed-type-u> u
1>32	| _TP_CALLBACK_PRIORITY CallbackPriority
1>36	| Size
1>	+---
1>
1>class HKEY__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HMETAFILE__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HINSTANCE__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HRGN__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HRSRC__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HSPRITE__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HLSURF__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HSTR__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HTASK__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HWINSTA__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HKL__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class _FILETIME	size(8):
1>	+---
1> 0	| dwLowDateTime
1> 4	| dwHighDateTime
1>	+---
1>
1>class HWND__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HHOOK__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HACCEL__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HBITMAP__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HBRUSH__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HCOLORSPACE__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HDC__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HGLRC__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HDESK__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HENHMETAFILE__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HFONT__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HICON__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HMENU__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HPALETTE__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HPEN__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HWINEVENTHOOK__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HMONITOR__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HUMPD__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class tagRECT	size(16):
1>	+---
1> 0	| left
1> 4	| top
1> 8	| right
1>12	| bottom
1>	+---
1>
1>class _RECTL	size(16):
1>	+---
1> 0	| left
1> 4	| top
1> 8	| right
1>12	| bottom
1>	+---
1>
1>class tagPOINT	size(8):
1>	+---
1> 0	| x
1> 4	| y
1>	+---
1>
1>class _POINTL	size(8):
1>	+---
1> 0	| x
1> 4	| y
1>	+---
1>
1>class tagSIZE	size(8):
1>	+---
1> 0	| cx
1> 4	| cy
1>	+---
1>
1>class tagPOINTS	size(4):
1>	+---
1> 0	| x
1> 2	| y
1>	+---
1>
1>class DPI_AWARENESS_CONTEXT__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class _SECURITY_ATTRIBUTES	size(12):
1>	+---
1> 0	| nLength
1> 4	| lpSecurityDescriptor
1> 8	| bInheritHandle
1>	+---
1>
1>class _OVERLAPPED::<unnamed-tag>::<unnamed-tag>	size(8):
1>	+---
1> 0	| Offset
1> 4	| OffsetHigh
1>	+---
1>
1>class _OVERLAPPED::<unnamed-tag>	size(8):
1>	+---
1> 0	| Offset
1> 4	| OffsetHigh
1> 0	| Pointer
1>	+---
1>
1>class _OVERLAPPED	size(20):
1>	+---
1> 0	| Internal
1> 4	| InternalHigh
1>  	| <unnamed-tag> <alignment member> (size=8)
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| Offset
1>12	| OffsetHigh
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| Pointer
1>16	| hEvent
1>	+---
1>
1>class _OVERLAPPED_ENTRY	size(16):
1>	+---
1> 0	| lpCompletionKey
1> 4	| lpOverlapped
1> 8	| Internal
1>12	| dwNumberOfBytesTransferred
1>	+---
1>
1>class _SYSTEMTIME	size(16):
1>	+---
1> 0	| wYear
1> 2	| wMonth
1> 4	| wDayOfWeek
1> 6	| wDay
1> 8	| wHour
1>10	| wMinute
1>12	| wSecond
1>14	| wMilliseconds
1>	+---
1>
1>class _WIN32_FIND_DATAA	size(320):
1>	+---
1> 0	| dwFileAttributes
1> 4	| _FILETIME ftCreationTime
1>12	| _FILETIME ftLastAccessTime
1>20	| _FILETIME ftLastWriteTime
1>28	| nFileSizeHigh
1>32	| nFileSizeLow
1>36	| dwReserved0
1>40	| dwReserved1
1>44	| cFileName
1>304	| cAlternateFileName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _WIN32_FIND_DATAW	size(592):
1>	+---
1> 0	| dwFileAttributes
1> 4	| _FILETIME ftCreationTime
1>12	| _FILETIME ftLastAccessTime
1>20	| _FILETIME ftLastWriteTime
1>28	| nFileSizeHigh
1>32	| nFileSizeLow
1>36	| dwReserved0
1>40	| dwReserved1
1>44	| cFileName
1>564	| cAlternateFileName
1>	+---
1>
1>class _PROCESS_HEAP_ENTRY::<unnamed-tag>::<unnamed-tag>	size(16):
1>	+---
1> 0	| hMem
1> 4	| dwReserved
1>	+---
1>
1>class _PROCESS_HEAP_ENTRY::<unnamed-tag>::<unnamed-tag>	size(16):
1>	+---
1> 0	| dwCommittedSize
1> 4	| dwUnCommittedSize
1> 8	| lpFirstBlock
1>12	| lpLastBlock
1>	+---
1>
1>class _PROCESS_HEAP_ENTRY::<unnamed-tag>	size(16):
1>	+---
1> 0	| <unnamed-type-Block> Block
1> 0	| <unnamed-type-Region> Region
1>	+---
1>
1>class _PROCESS_HEAP_ENTRY	size(28):
1>	+---
1> 0	| lpData
1> 4	| cbData
1> 8	| cbOverhead
1> 9	| iRegionIndex
1>10	| wFlags
1>  	| <unnamed-tag> <alignment member> (size=12)
1>12	| <unnamed-type-Block> Block
1>12	| <unnamed-type-Region> Region
1>	+---
1>
1>class _REASON_CONTEXT::<unnamed-tag>::<unnamed-tag>	size(16):
1>	+---
1> 0	| LocalizedReasonModule
1> 4	| LocalizedReasonId
1> 8	| ReasonStringCount
1>12	| ReasonStrings
1>	+---
1>
1>class _REASON_CONTEXT::<unnamed-tag>	size(16):
1>	+---
1> 0	| <unnamed-type-Detailed> Detailed
1> 0	| SimpleReasonString
1>	+---
1>
1>class _REASON_CONTEXT	size(24):
1>	+---
1> 0	| Version
1> 4	| Flags
1> 8	| <unnamed-type-Reason> Reason
1>	+---
1>
1>class _EXCEPTION_DEBUG_INFO	size(84):
1>	+---
1> 0	| _EXCEPTION_RECORD ExceptionRecord
1>80	| dwFirstChance
1>	+---
1>
1>class _CREATE_THREAD_DEBUG_INFO	size(12):
1>	+---
1> 0	| hThread
1> 4	| lpThreadLocalBase
1> 8	| lpStartAddress
1>	+---
1>
1>class _CREATE_PROCESS_DEBUG_INFO	size(40):
1>	+---
1> 0	| hFile
1> 4	| hProcess
1> 8	| hThread
1>12	| lpBaseOfImage
1>16	| dwDebugInfoFileOffset
1>20	| nDebugInfoSize
1>24	| lpThreadLocalBase
1>28	| lpStartAddress
1>32	| lpImageName
1>36	| fUnicode
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _EXIT_THREAD_DEBUG_INFO	size(4):
1>	+---
1> 0	| dwExitCode
1>	+---
1>
1>class _EXIT_PROCESS_DEBUG_INFO	size(4):
1>	+---
1> 0	| dwExitCode
1>	+---
1>
1>class _LOAD_DLL_DEBUG_INFO	size(24):
1>	+---
1> 0	| hFile
1> 4	| lpBaseOfDll
1> 8	| dwDebugInfoFileOffset
1>12	| nDebugInfoSize
1>16	| lpImageName
1>20	| fUnicode
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _UNLOAD_DLL_DEBUG_INFO	size(4):
1>	+---
1> 0	| lpBaseOfDll
1>	+---
1>
1>class _OUTPUT_DEBUG_STRING_INFO	size(8):
1>	+---
1> 0	| lpDebugStringData
1> 4	| fUnicode
1> 6	| nDebugStringLength
1>	+---
1>
1>class _RIP_INFO	size(8):
1>	+---
1> 0	| dwError
1> 4	| dwType
1>	+---
1>
1>class _DEBUG_EVENT::<unnamed-tag>	size(84):
1>	+---
1> 0	| _EXCEPTION_DEBUG_INFO Exception
1> 0	| _CREATE_THREAD_DEBUG_INFO CreateThread
1> 0	| _CREATE_PROCESS_DEBUG_INFO CreateProcessInfo
1> 0	| _EXIT_THREAD_DEBUG_INFO ExitThread
1> 0	| _EXIT_PROCESS_DEBUG_INFO ExitProcess
1> 0	| _LOAD_DLL_DEBUG_INFO LoadDll
1> 0	| _UNLOAD_DLL_DEBUG_INFO UnloadDll
1> 0	| _OUTPUT_DEBUG_STRING_INFO DebugString
1> 0	| _RIP_INFO RipInfo
1>	+---
1>
1>class _DEBUG_EVENT	size(96):
1>	+---
1> 0	| dwDebugEventCode
1> 4	| dwProcessId
1> 8	| dwThreadId
1>12	| <unnamed-type-u> u
1>	+---
1>
1>class _WIN32_FILE_ATTRIBUTE_DATA	size(36):
1>	+---
1> 0	| dwFileAttributes
1> 4	| _FILETIME ftCreationTime
1>12	| _FILETIME ftLastAccessTime
1>20	| _FILETIME ftLastWriteTime
1>28	| nFileSizeHigh
1>32	| nFileSizeLow
1>	+---
1>
1>class _BY_HANDLE_FILE_INFORMATION	size(52):
1>	+---
1> 0	| dwFileAttributes
1> 4	| _FILETIME ftCreationTime
1>12	| _FILETIME ftLastAccessTime
1>20	| _FILETIME ftLastWriteTime
1>28	| dwVolumeSerialNumber
1>32	| nFileSizeHigh
1>36	| nFileSizeLow
1>40	| nNumberOfLinks
1>44	| nFileIndexHigh
1>48	| nFileIndexLow
1>	+---
1>
1>class _CREATEFILE2_EXTENDED_PARAMETERS	size(24):
1>	+---
1> 0	| dwSize
1> 4	| dwFileAttributes
1> 8	| dwFileFlags
1>12	| dwSecurityQosFlags
1>16	| lpSecurityAttributes
1>20	| hTemplateFile
1>	+---
1>
1>class _WIN32_FIND_STREAM_DATA	size(600):
1>	+---
1> 0	| _LARGE_INTEGER StreamSize
1> 8	| cStreamName
1>	+---
1>
1>class _HEAP_SUMMARY	size(20):
1>	+---
1> 0	| cb
1> 4	| cbAllocated
1> 8	| cbCommitted
1>12	| cbReserved
1>16	| cbMaxReserve
1>	+---
1>
1>class _PROCESS_INFORMATION	size(16):
1>	+---
1> 0	| hProcess
1> 4	| hThread
1> 8	| dwProcessId
1>12	| dwThreadId
1>	+---
1>
1>class _STARTUPINFOA	size(68):
1>	+---
1> 0	| cb
1> 4	| lpReserved
1> 8	| lpDesktop
1>12	| lpTitle
1>16	| dwX
1>20	| dwY
1>24	| dwXSize
1>28	| dwYSize
1>32	| dwXCountChars
1>36	| dwYCountChars
1>40	| dwFillAttribute
1>44	| dwFlags
1>48	| wShowWindow
1>50	| cbReserved2
1>52	| lpReserved2
1>56	| hStdInput
1>60	| hStdOutput
1>64	| hStdError
1>	+---
1>
1>class _STARTUPINFOW	size(68):
1>	+---
1> 0	| cb
1> 4	| lpReserved
1> 8	| lpDesktop
1>12	| lpTitle
1>16	| dwX
1>20	| dwY
1>24	| dwXSize
1>28	| dwYSize
1>32	| dwXCountChars
1>36	| dwYCountChars
1>40	| dwFillAttribute
1>44	| dwFlags
1>48	| wShowWindow
1>50	| cbReserved2
1>52	| lpReserved2
1>56	| hStdInput
1>60	| hStdOutput
1>64	| hStdError
1>	+---
1>
1>class _MEMORY_PRIORITY_INFORMATION	size(4):
1>	+---
1> 0	| MemoryPriority
1>	+---
1>
1>class _THREAD_POWER_THROTTLING_STATE	size(12):
1>	+---
1> 0	| Version
1> 4	| ControlMask
1> 8	| StateMask
1>	+---
1>
1>class _APP_MEMORY_INFORMATION	size(32):
1>	+---
1> 0	| AvailableCommit
1> 8	| PrivateCommitUsage
1>16	| PeakPrivateCommitUsage
1>24	| TotalCommitUsage
1>	+---
1>
1>class _PROCESS_MEMORY_EXHAUSTION_INFO	size(12):
1>	+---
1> 0	| Version
1> 2	| Reserved
1> 4	| _PROCESS_MEMORY_EXHAUSTION_TYPE Type
1> 8	| Value
1>	+---
1>
1>class _PROCESS_POWER_THROTTLING_STATE	size(12):
1>	+---
1> 0	| Version
1> 4	| ControlMask
1> 8	| StateMask
1>	+---
1>
1>class PROCESS_PROTECTION_LEVEL_INFORMATION	size(4):
1>	+---
1> 0	| ProtectionLevel
1>	+---
1>
1>class _SYSTEM_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| wProcessorArchitecture
1> 2	| wReserved
1>	+---
1>
1>class _SYSTEM_INFO::<unnamed-tag>	size(4):
1>	+---
1> 0	| dwOemId
1> 0	| wProcessorArchitecture
1> 2	| wReserved
1>	+---
1>
1>class _SYSTEM_INFO	size(36):
1>	+---
1> 0	| dwOemId
1> 0	| wProcessorArchitecture
1> 2	| wReserved
1> 4	| dwPageSize
1> 8	| lpMinimumApplicationAddress
1>12	| lpMaximumApplicationAddress
1>16	| dwActiveProcessorMask
1>20	| dwNumberOfProcessors
1>24	| dwProcessorType
1>28	| dwAllocationGranularity
1>32	| wProcessorLevel
1>34	| wProcessorRevision
1>	+---
1>
1>class _MEMORYSTATUSEX	size(64):
1>	+---
1> 0	| dwLength
1> 4	| dwMemoryLoad
1> 8	| ullTotalPhys
1>16	| ullAvailPhys
1>24	| ullTotalPageFile
1>32	| ullAvailPageFile
1>40	| ullTotalVirtual
1>48	| ullAvailVirtual
1>56	| ullAvailExtendedVirtual
1>	+---
1>
1>class _WIN32_MEMORY_RANGE_ENTRY	size(8):
1>	+---
1> 0	| VirtualAddress
1> 4	| NumberOfBytes
1>	+---
1>
1>class WIN32_MEMORY_REGION_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| Private (bitstart=0,nbits=1)
1> 0.	| MappedDataFile (bitstart=1,nbits=1)
1> 0.	| MappedImage (bitstart=2,nbits=1)
1> 0.	| MappedPageFile (bitstart=3,nbits=1)
1> 0.	| MappedPhysical (bitstart=4,nbits=1)
1> 0.	| DirectMapped (bitstart=5,nbits=1)
1> 0.	| Reserved (bitstart=6,nbits=26)
1>	+---
1>
1>class WIN32_MEMORY_REGION_INFORMATION::<unnamed-tag>	size(4):
1>	+---
1> 0	| Flags
1> 0.	| Private (bitstart=0,nbits=1)
1> 0.	| MappedDataFile (bitstart=1,nbits=1)
1> 0.	| MappedImage (bitstart=2,nbits=1)
1> 0.	| MappedPageFile (bitstart=3,nbits=1)
1> 0.	| MappedPhysical (bitstart=4,nbits=1)
1> 0.	| DirectMapped (bitstart=5,nbits=1)
1> 0.	| Reserved (bitstart=6,nbits=26)
1>	+---
1>
1>class WIN32_MEMORY_REGION_INFORMATION	size(20):
1>	+---
1> 0	| AllocationBase
1> 4	| AllocationProtect
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| Flags
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8.	| Private (bitstart=0,nbits=1)
1> 8.	| MappedDataFile (bitstart=1,nbits=1)
1> 8.	| MappedImage (bitstart=2,nbits=1)
1> 8.	| MappedPageFile (bitstart=3,nbits=1)
1> 8.	| MappedPhysical (bitstart=4,nbits=1)
1> 8.	| DirectMapped (bitstart=5,nbits=1)
1> 8.	| Reserved (bitstart=6,nbits=26)
1>  	| <unnamed-tag> <alignment member> (size=8)
1>12	| RegionSize
1>16	| CommitSize
1>	+---
1>
1>class JOBOBJECT_IO_RATE_CONTROL_INFORMATION	size(40):
1>	+---
1> 0	| MaxIops
1> 8	| MaxBandwidth
1>16	| ReservationIops
1>24	| VolumeName
1>28	| BaseIoSize
1>32	| ControlFlags
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class tagENUMUILANG	size(12):
1>	+---
1> 0	| NumOfEnumUILang
1> 4	| SizeOfEnumUIBuffer
1> 8	| pEnumUIBuffer
1>	+---
1>
1>class _COMMPROP	size(64):
1>	+---
1> 0	| wPacketLength
1> 2	| wPacketVersion
1> 4	| dwServiceMask
1> 8	| dwReserved1
1>12	| dwMaxTxQueue
1>16	| dwMaxRxQueue
1>20	| dwMaxBaud
1>24	| dwProvSubType
1>28	| dwProvCapabilities
1>32	| dwSettableParams
1>36	| dwSettableBaud
1>40	| wSettableData
1>42	| wSettableStopParity
1>44	| dwCurrentTxQueue
1>48	| dwCurrentRxQueue
1>52	| dwProvSpec1
1>56	| dwProvSpec2
1>60	| wcProvChar
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _COMSTAT	size(12):
1>	+---
1> 0.	| fCtsHold (bitstart=0,nbits=1)
1> 0.	| fDsrHold (bitstart=1,nbits=1)
1> 0.	| fRlsdHold (bitstart=2,nbits=1)
1> 0.	| fXoffHold (bitstart=3,nbits=1)
1> 0.	| fXoffSent (bitstart=4,nbits=1)
1> 0.	| fEof (bitstart=5,nbits=1)
1> 0.	| fTxim (bitstart=6,nbits=1)
1> 0.	| fReserved (bitstart=7,nbits=25)
1> 4	| cbInQue
1> 8	| cbOutQue
1>	+---
1>
1>class _DCB	size(28):
1>	+---
1> 0	| DCBlength
1> 4	| BaudRate
1> 8.	| fBinary (bitstart=0,nbits=1)
1> 8.	| fParity (bitstart=1,nbits=1)
1> 8.	| fOutxCtsFlow (bitstart=2,nbits=1)
1> 8.	| fOutxDsrFlow (bitstart=3,nbits=1)
1> 8.	| fDtrControl (bitstart=4,nbits=2)
1> 8.	| fDsrSensitivity (bitstart=6,nbits=1)
1> 8.	| fTXContinueOnXoff (bitstart=7,nbits=1)
1> 8.	| fOutX (bitstart=8,nbits=1)
1> 8.	| fInX (bitstart=9,nbits=1)
1> 8.	| fErrorChar (bitstart=10,nbits=1)
1> 8.	| fNull (bitstart=11,nbits=1)
1> 8.	| fRtsControl (bitstart=12,nbits=2)
1> 8.	| fAbortOnError (bitstart=14,nbits=1)
1> 8.	| fDummy2 (bitstart=15,nbits=17)
1>12	| wReserved
1>14	| XonLim
1>16	| XoffLim
1>18	| ByteSize
1>19	| Parity
1>20	| StopBits
1>21	| XonChar
1>22	| XoffChar
1>23	| ErrorChar
1>24	| EofChar
1>25	| EvtChar
1>26	| wReserved1
1>	+---
1>
1>class _COMMTIMEOUTS	size(20):
1>	+---
1> 0	| ReadIntervalTimeout
1> 4	| ReadTotalTimeoutMultiplier
1> 8	| ReadTotalTimeoutConstant
1>12	| WriteTotalTimeoutMultiplier
1>16	| WriteTotalTimeoutConstant
1>	+---
1>
1>class _COMMCONFIG	size(52):
1>	+---
1> 0	| dwSize
1> 4	| wVersion
1> 6	| wReserved
1> 8	| _DCB dcb
1>36	| dwProviderSubType
1>40	| dwProviderOffset
1>44	| dwProviderSize
1>48	| wcProviderData
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _MEMORYSTATUS	size(32):
1>	+---
1> 0	| dwLength
1> 4	| dwMemoryLoad
1> 8	| dwTotalPhys
1>12	| dwAvailPhys
1>16	| dwTotalPageFile
1>20	| dwAvailPageFile
1>24	| dwTotalVirtual
1>28	| dwAvailVirtual
1>	+---
1>
1>class _JIT_DEBUG_INFO	size(40):
1>	+---
1> 0	| dwSize
1> 4	| dwProcessorArchitecture
1> 8	| dwThreadID
1>12	| dwReserved0
1>16	| lpExceptionAddress
1>24	| lpExceptionRecord
1>32	| lpContextRecord
1>	+---
1>
1>class _OFSTRUCT	size(136):
1>	+---
1> 0	| cBytes
1> 1	| fFixedDisk
1> 2	| nErrCode
1> 4	| Reserved1
1> 6	| Reserved2
1> 8	| szPathName
1>	+---
1>
1>class _UMS_SCHEDULER_STARTUP_INFO	size(16):
1>	+---
1> 0	| UmsVersion
1> 4	| CompletionList
1> 8	| SchedulerProc
1>12	| SchedulerParam
1>	+---
1>
1>class _UMS_SYSTEM_THREAD_INFORMATION::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| IsUmsSchedulerThread (bitstart=0,nbits=1)
1> 0.	| IsUmsWorkerThread (bitstart=1,nbits=1)
1>	+---
1>
1>class _UMS_SYSTEM_THREAD_INFORMATION::<unnamed-tag>	size(4):
1>	+---
1> 0.	| IsUmsSchedulerThread (bitstart=0,nbits=1)
1> 0.	| IsUmsWorkerThread (bitstart=1,nbits=1)
1> 0	| ThreadUmsFlags
1>	+---
1>
1>class _UMS_SYSTEM_THREAD_INFORMATION	size(8):
1>	+---
1> 0	| UmsVersion
1>  	| <unnamed-tag> <alignment member> (size=4)
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4.	| IsUmsSchedulerThread (bitstart=0,nbits=1)
1> 4.	| IsUmsWorkerThread (bitstart=1,nbits=1)
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| ThreadUmsFlags
1>	+---
1>
1>class _WIN32_STREAM_ID	size(24):
1>	+---
1> 0	| dwStreamId
1> 4	| dwStreamAttributes
1> 8	| _LARGE_INTEGER Size
1>16	| dwStreamNameSize
1>20	| cStreamName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _STARTUPINFOEXA	size(72):
1>	+---
1> 0	| _STARTUPINFOA StartupInfo
1>68	| lpAttributeList
1>	+---
1>
1>class _STARTUPINFOEXW	size(72):
1>	+---
1> 0	| _STARTUPINFOW StartupInfo
1>68	| lpAttributeList
1>	+---
1>
1>class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(48):
1>	+---
1> 0	| dwStreamNumber
1> 4	| dwReserved
1> 8	| hSourceFile
1>12	| hDestinationFile
1>16	| _ULARGE_INTEGER uliChunkNumber
1>24	| _ULARGE_INTEGER uliChunkSize
1>32	| _ULARGE_INTEGER uliStreamSize
1>40	| _ULARGE_INTEGER uliTotalFileSize
1>	+---
1>
1>class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(64):
1>	+---
1> 0	| dwStreamNumber
1> 4	| dwFlags
1> 8	| hSourceFile
1>12	| hDestinationFile
1>16	| _ULARGE_INTEGER uliChunkNumber
1>24	| _ULARGE_INTEGER uliChunkSize
1>32	| _ULARGE_INTEGER uliStreamSize
1>40	| _ULARGE_INTEGER uliStreamBytesTransferred
1>48	| _ULARGE_INTEGER uliTotalFileSize
1>56	| _ULARGE_INTEGER uliTotalBytesTransferred
1>	+---
1>
1>class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(32):
1>	+---
1> 0	| dwStreamNumber
1> 4	| dwReserved
1> 8	| hSourceFile
1>12	| hDestinationFile
1>16	| _ULARGE_INTEGER uliStreamSize
1>24	| _ULARGE_INTEGER uliTotalFileSize
1>	+---
1>
1>class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(48):
1>	+---
1> 0	| dwStreamNumber
1> 4	| dwReserved
1> 8	| hSourceFile
1>12	| hDestinationFile
1>16	| _ULARGE_INTEGER uliStreamSize
1>24	| _ULARGE_INTEGER uliStreamBytesTransferred
1>32	| _ULARGE_INTEGER uliTotalFileSize
1>40	| _ULARGE_INTEGER uliTotalBytesTransferred
1>	+---
1>
1>class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| dwReserved
1>	+---
1>
1>class COPYFILE2_MESSAGE::<unnamed-tag>::<unnamed-tag>	size(56):
1>	+---
1> 0	| _COPYFILE2_COPY_PHASE CopyPhase
1> 4	| dwStreamNumber
1> 8	| hrFailure
1>12	| dwReserved
1>16	| _ULARGE_INTEGER uliChunkNumber
1>24	| _ULARGE_INTEGER uliStreamSize
1>32	| _ULARGE_INTEGER uliStreamBytesTransferred
1>40	| _ULARGE_INTEGER uliTotalFileSize
1>48	| _ULARGE_INTEGER uliTotalBytesTransferred
1>	+---
1>
1>class COPYFILE2_MESSAGE::<unnamed-tag>	size(64):
1>	+---
1> 0	| <unnamed-type-ChunkStarted> ChunkStarted
1> 0	| <unnamed-type-ChunkFinished> ChunkFinished
1> 0	| <unnamed-type-StreamStarted> StreamStarted
1> 0	| <unnamed-type-StreamFinished> StreamFinished
1> 0	| <unnamed-type-PollContinue> PollContinue
1> 0	| <unnamed-type-Error> Error
1>	+---
1>
1>class COPYFILE2_MESSAGE	size(72):
1>	+---
1> 0	| _COPYFILE2_MESSAGE_TYPE Type
1> 4	| dwPadding
1> 8	| <unnamed-type-Info> Info
1>	+---
1>
1>class COPYFILE2_EXTENDED_PARAMETERS	size(20):
1>	+---
1> 0	| dwSize
1> 4	| dwCopyFlags
1> 8	| pfCancel
1>12	| pProgressRoutine
1>16	| pvCallbackContext
1>	+---
1>
1>class _EVENTLOG_FULL_INFORMATION	size(4):
1>	+---
1> 0	| dwFull
1>	+---
1>
1>class _OPERATION_START_PARAMETERS	size(12):
1>	+---
1> 0	| Version
1> 4	| OperationId
1> 8	| Flags
1>	+---
1>
1>class _OPERATION_END_PARAMETERS	size(12):
1>	+---
1> 0	| Version
1> 4	| OperationId
1> 8	| Flags
1>	+---
1>
1>class tagHW_PROFILE_INFOA	size(124):
1>	+---
1> 0	| dwDockInfo
1> 4	| szHwProfileGuid
1>43	| szHwProfileName
1>  	| <alignment member> (size=1)
1>	+---
1>
1>class tagHW_PROFILE_INFOW	size(244):
1>	+---
1> 0	| dwDockInfo
1> 4	| szHwProfileGuid
1>82	| szHwProfileName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _TIME_ZONE_INFORMATION	size(172):
1>	+---
1> 0	| Bias
1> 4	| StandardName
1>68	| _SYSTEMTIME StandardDate
1>84	| StandardBias
1>88	| DaylightName
1>152	| _SYSTEMTIME DaylightDate
1>168	| DaylightBias
1>	+---
1>
1>class _TIME_DYNAMIC_ZONE_INFORMATION	size(432):
1>	+---
1> 0	| Bias
1> 4	| StandardName
1>68	| _SYSTEMTIME StandardDate
1>84	| StandardBias
1>88	| DaylightName
1>152	| _SYSTEMTIME DaylightDate
1>168	| DaylightBias
1>172	| TimeZoneKeyName
1>428	| DynamicDaylightTimeDisabled
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _SYSTEM_POWER_STATUS	size(12):
1>	+---
1> 0	| ACLineStatus
1> 1	| BatteryFlag
1> 2	| BatteryLifePercent
1> 3	| SystemStatusFlag
1> 4	| BatteryLifeTime
1> 8	| BatteryFullLifeTime
1>	+---
1>
1>class tagACTCTXA	size(32):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| lpSource
1>12	| wProcessorArchitecture
1>14	| wLangId
1>16	| lpAssemblyDirectory
1>20	| lpResourceName
1>24	| lpApplicationName
1>28	| hModule
1>	+---
1>
1>class tagACTCTXW	size(32):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| lpSource
1>12	| wProcessorArchitecture
1>14	| wLangId
1>16	| lpAssemblyDirectory
1>20	| lpResourceName
1>24	| lpApplicationName
1>28	| hModule
1>	+---
1>
1>class tagACTCTX_SECTION_KEYED_DATA_2600	size(40):
1>	+---
1> 0	| cbSize
1> 4	| ulDataFormatVersion
1> 8	| lpData
1>12	| ulLength
1>16	| lpSectionGlobalData
1>20	| ulSectionGlobalDataLength
1>24	| lpSectionBase
1>28	| ulSectionTotalLength
1>32	| hActCtx
1>36	| ulAssemblyRosterIndex
1>	+---
1>
1>class tagACTCTX_SECTION_KEYED_DATA_ASSEMBLY_METADATA	size(20):
1>	+---
1> 0	| lpInformation
1> 4	| lpSectionBase
1> 8	| ulSectionLength
1>12	| lpSectionGlobalDataBase
1>16	| ulSectionGlobalDataLength
1>	+---
1>
1>class tagACTCTX_SECTION_KEYED_DATA	size(64):
1>	+---
1> 0	| cbSize
1> 4	| ulDataFormatVersion
1> 8	| lpData
1>12	| ulLength
1>16	| lpSectionGlobalData
1>20	| ulSectionGlobalDataLength
1>24	| lpSectionBase
1>28	| ulSectionTotalLength
1>32	| hActCtx
1>36	| ulAssemblyRosterIndex
1>40	| ulFlags
1>44	| tagACTCTX_SECTION_KEYED_DATA_ASSEMBLY_METADATA AssemblyMetadata
1>	+---
1>
1>class _ACTIVATION_CONTEXT_BASIC_INFORMATION	size(8):
1>	+---
1> 0	| hActCtx
1> 4	| dwFlags
1>	+---
1>
1>class _FILE_BASIC_INFO	size(40):
1>	+---
1> 0	| _LARGE_INTEGER CreationTime
1> 8	| _LARGE_INTEGER LastAccessTime
1>16	| _LARGE_INTEGER LastWriteTime
1>24	| _LARGE_INTEGER ChangeTime
1>32	| FileAttributes
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class _FILE_STANDARD_INFO	size(24):
1>	+---
1> 0	| _LARGE_INTEGER AllocationSize
1> 8	| _LARGE_INTEGER EndOfFile
1>16	| NumberOfLinks
1>20	| DeletePending
1>21	| Directory
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _FILE_NAME_INFO	size(8):
1>	+---
1> 0	| FileNameLength
1> 4	| FileName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _FILE_RENAME_INFO::<unnamed-tag>	size(4):
1>	+---
1> 0	| ReplaceIfExists
1>  	| <alignment member> (size=3)
1> 0	| Flags
1>	+---
1>
1>class _FILE_RENAME_INFO	size(16):
1>	+---
1> 0	| ReplaceIfExists
1>  	| <alignment member> (size=3)
1> 0	| Flags
1> 4	| RootDirectory
1> 8	| FileNameLength
1>12	| FileName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _FILE_ALLOCATION_INFO	size(8):
1>	+---
1> 0	| _LARGE_INTEGER AllocationSize
1>	+---
1>
1>class _FILE_END_OF_FILE_INFO	size(8):
1>	+---
1> 0	| _LARGE_INTEGER EndOfFile
1>	+---
1>
1>class _FILE_STREAM_INFO	size(32):
1>	+---
1> 0	| NextEntryOffset
1> 4	| StreamNameLength
1> 8	| _LARGE_INTEGER StreamSize
1>16	| _LARGE_INTEGER StreamAllocationSize
1>24	| StreamName
1>  	| <alignment member> (size=6)
1>	+---
1>
1>class _FILE_COMPRESSION_INFO	size(16):
1>	+---
1> 0	| _LARGE_INTEGER CompressedFileSize
1> 8	| CompressionFormat
1>10	| CompressionUnitShift
1>11	| ChunkShift
1>12	| ClusterShift
1>13	| Reserved
1>	+---
1>
1>class _FILE_ATTRIBUTE_TAG_INFO	size(8):
1>	+---
1> 0	| FileAttributes
1> 4	| ReparseTag
1>	+---
1>
1>class _FILE_DISPOSITION_INFO	size(1):
1>	+---
1> 0	| DeleteFileA
1>	+---
1>
1>class _FILE_DISPOSITION_INFO_EX	size(4):
1>	+---
1> 0	| Flags
1>	+---
1>
1>class _FILE_ID_BOTH_DIR_INFO	size(112):
1>	+---
1> 0	| NextEntryOffset
1> 4	| FileIndex
1> 8	| _LARGE_INTEGER CreationTime
1>16	| _LARGE_INTEGER LastAccessTime
1>24	| _LARGE_INTEGER LastWriteTime
1>32	| _LARGE_INTEGER ChangeTime
1>40	| _LARGE_INTEGER EndOfFile
1>48	| _LARGE_INTEGER AllocationSize
1>56	| FileAttributes
1>60	| FileNameLength
1>64	| EaSize
1>68	| ShortNameLength
1>  	| <alignment member> (size=1)
1>70	| ShortName
1>  	| <alignment member> (size=2)
1>96	| _LARGE_INTEGER FileId
1>104	| FileName
1>  	| <alignment member> (size=6)
1>	+---
1>
1>class _FILE_FULL_DIR_INFO	size(72):
1>	+---
1> 0	| NextEntryOffset
1> 4	| FileIndex
1> 8	| _LARGE_INTEGER CreationTime
1>16	| _LARGE_INTEGER LastAccessTime
1>24	| _LARGE_INTEGER LastWriteTime
1>32	| _LARGE_INTEGER ChangeTime
1>40	| _LARGE_INTEGER EndOfFile
1>48	| _LARGE_INTEGER AllocationSize
1>56	| FileAttributes
1>60	| FileNameLength
1>64	| EaSize
1>68	| FileName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _FILE_IO_PRIORITY_HINT_INFO	size(4):
1>	+---
1> 0	| _PRIORITY_HINT PriorityHint
1>	+---
1>
1>class _FILE_ALIGNMENT_INFO	size(4):
1>	+---
1> 0	| AlignmentRequirement
1>	+---
1>
1>class _FILE_STORAGE_INFO	size(28):
1>	+---
1> 0	| LogicalBytesPerSector
1> 4	| PhysicalBytesPerSectorForAtomicity
1> 8	| PhysicalBytesPerSectorForPerformance
1>12	| FileSystemEffectivePhysicalBytesPerSectorForAtomicity
1>16	| Flags
1>20	| ByteOffsetForSectorAlignment
1>24	| ByteOffsetForPartitionAlignment
1>	+---
1>
1>class _FILE_ID_INFO	size(24):
1>	+---
1> 0	| VolumeSerialNumber
1> 8	| _FILE_ID_128 FileId
1>	+---
1>
1>class _FILE_ID_EXTD_DIR_INFO	size(96):
1>	+---
1> 0	| NextEntryOffset
1> 4	| FileIndex
1> 8	| _LARGE_INTEGER CreationTime
1>16	| _LARGE_INTEGER LastAccessTime
1>24	| _LARGE_INTEGER LastWriteTime
1>32	| _LARGE_INTEGER ChangeTime
1>40	| _LARGE_INTEGER EndOfFile
1>48	| _LARGE_INTEGER AllocationSize
1>56	| FileAttributes
1>60	| FileNameLength
1>64	| EaSize
1>68	| ReparsePointTag
1>72	| _FILE_ID_128 FileId
1>88	| FileName
1>  	| <alignment member> (size=6)
1>	+---
1>
1>class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>	size(32):
1>	+---
1> 0	| Reserved
1>	+---
1>
1>class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| Capabilities
1>	+---
1>
1>class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>::<unnamed-tag>::<unnamed-tag>	size(8):
1>	+---
1> 0	| Capabilities
1> 4	| CachingFlags
1>	+---
1>
1>class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>::<unnamed-tag>	size(12):
1>	+---
1> 0	| <unnamed-type-Server> Server
1> 4	| <unnamed-type-Share> Share
1>	+---
1>
1>class _FILE_REMOTE_PROTOCOL_INFO::<unnamed-tag>	size(64):
1>	+---
1> 0	| <unnamed-type-Smb2> Smb2
1> 0	| Reserved
1>	+---
1>
1>class _FILE_REMOTE_PROTOCOL_INFO	size(116):
1>	+---
1> 0	| StructureVersion
1> 2	| StructureSize
1> 4	| Protocol
1> 8	| ProtocolMajorVersion
1>10	| ProtocolMinorVersion
1>12	| ProtocolRevision
1>14	| Reserved
1>16	| Flags
1>20	| <unnamed-type-GenericReserved> GenericReserved
1>52	| <unnamed-type-ProtocolSpecific> ProtocolSpecific
1>	+---
1>
1>class FILE_ID_DESCRIPTOR::<unnamed-tag>	size(16):
1>	+---
1> 0	| _LARGE_INTEGER FileId
1> 0	| _GUID ObjectId
1> 0	| _FILE_ID_128 ExtendedFileId
1>	+---
1>
1>class FILE_ID_DESCRIPTOR	size(24):
1>	+---
1> 0	| dwSize
1> 4	| _FILE_ID_TYPE Type
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| _LARGE_INTEGER FileId
1> 8	| _GUID ObjectId
1> 8	| _FILE_ID_128 ExtendedFileId
1>	+---
1>
1>class _DRAWPATRECT	size(20):
1>	+---
1> 0	| tagPOINT ptPosition
1> 8	| tagPOINT ptSize
1>16	| wStyle
1>18	| wPattern
1>	+---
1>
1>class _PSINJECTDATA	size(8):
1>	+---
1> 0	| DataBytes
1> 4	| InjectionPoint
1> 6	| PageNumber
1>	+---
1>
1>class _PSFEATURE_OUTPUT	size(8):
1>	+---
1> 0	| bPageIndependent
1> 4	| bSetPageDevice
1>	+---
1>
1>class _PSFEATURE_CUSTPAPER	size(20):
1>	+---
1> 0	| lOrientation
1> 4	| lWidth
1> 8	| lHeight
1>12	| lWidthOffset
1>16	| lHeightOffset
1>	+---
1>
1>class tagXFORM	size(24):
1>	+---
1> 0	| eM11
1> 4	| eM12
1> 8	| eM21
1>12	| eM22
1>16	| eDx
1>20	| eDy
1>	+---
1>
1>class tagBITMAP	size(24):
1>	+---
1> 0	| bmType
1> 4	| bmWidth
1> 8	| bmHeight
1>12	| bmWidthBytes
1>16	| bmPlanes
1>18	| bmBitsPixel
1>20	| bmBits
1>	+---
1>
1>class tagRGBTRIPLE	size(3):
1>	+---
1> 0	| rgbtBlue
1> 1	| rgbtGreen
1> 2	| rgbtRed
1>	+---
1>
1>class tagRGBQUAD	size(4):
1>	+---
1> 0	| rgbBlue
1> 1	| rgbGreen
1> 2	| rgbRed
1> 3	| rgbReserved
1>	+---
1>
1>class tagCIEXYZ	size(12):
1>	+---
1> 0	| ciexyzX
1> 4	| ciexyzY
1> 8	| ciexyzZ
1>	+---
1>
1>class tagICEXYZTRIPLE	size(36):
1>	+---
1> 0	| tagCIEXYZ ciexyzRed
1>12	| tagCIEXYZ ciexyzGreen
1>24	| tagCIEXYZ ciexyzBlue
1>	+---
1>
1>class tagLOGCOLORSPACEA	size(328):
1>	+---
1> 0	| lcsSignature
1> 4	| lcsVersion
1> 8	| lcsSize
1>12	| lcsCSType
1>16	| lcsIntent
1>20	| tagICEXYZTRIPLE lcsEndpoints
1>56	| lcsGammaRed
1>60	| lcsGammaGreen
1>64	| lcsGammaBlue
1>68	| lcsFilename
1>	+---
1>
1>class tagLOGCOLORSPACEW	size(588):
1>	+---
1> 0	| lcsSignature
1> 4	| lcsVersion
1> 8	| lcsSize
1>12	| lcsCSType
1>16	| lcsIntent
1>20	| tagICEXYZTRIPLE lcsEndpoints
1>56	| lcsGammaRed
1>60	| lcsGammaGreen
1>64	| lcsGammaBlue
1>68	| lcsFilename
1>	+---
1>
1>class tagBITMAPCOREHEADER	size(12):
1>	+---
1> 0	| bcSize
1> 4	| bcWidth
1> 6	| bcHeight
1> 8	| bcPlanes
1>10	| bcBitCount
1>	+---
1>
1>class tagBITMAPINFOHEADER	size(40):
1>	+---
1> 0	| biSize
1> 4	| biWidth
1> 8	| biHeight
1>12	| biPlanes
1>14	| biBitCount
1>16	| biCompression
1>20	| biSizeImage
1>24	| biXPelsPerMeter
1>28	| biYPelsPerMeter
1>32	| biClrUsed
1>36	| biClrImportant
1>	+---
1>
1>class <unnamed-tag>	size(108):
1>	+---
1> 0	| bV4Size
1> 4	| bV4Width
1> 8	| bV4Height
1>12	| bV4Planes
1>14	| bV4BitCount
1>16	| bV4V4Compression
1>20	| bV4SizeImage
1>24	| bV4XPelsPerMeter
1>28	| bV4YPelsPerMeter
1>32	| bV4ClrUsed
1>36	| bV4ClrImportant
1>40	| bV4RedMask
1>44	| bV4GreenMask
1>48	| bV4BlueMask
1>52	| bV4AlphaMask
1>56	| bV4CSType
1>60	| tagICEXYZTRIPLE bV4Endpoints
1>96	| bV4GammaRed
1>100	| bV4GammaGreen
1>104	| bV4GammaBlue
1>	+---
1>
1>class <unnamed-tag>	size(124):
1>	+---
1> 0	| bV5Size
1> 4	| bV5Width
1> 8	| bV5Height
1>12	| bV5Planes
1>14	| bV5BitCount
1>16	| bV5Compression
1>20	| bV5SizeImage
1>24	| bV5XPelsPerMeter
1>28	| bV5YPelsPerMeter
1>32	| bV5ClrUsed
1>36	| bV5ClrImportant
1>40	| bV5RedMask
1>44	| bV5GreenMask
1>48	| bV5BlueMask
1>52	| bV5AlphaMask
1>56	| bV5CSType
1>60	| tagICEXYZTRIPLE bV5Endpoints
1>96	| bV5GammaRed
1>100	| bV5GammaGreen
1>104	| bV5GammaBlue
1>108	| bV5Intent
1>112	| bV5ProfileData
1>116	| bV5ProfileSize
1>120	| bV5Reserved
1>	+---
1>
1>class tagBITMAPINFO	size(44):
1>	+---
1> 0	| tagBITMAPINFOHEADER bmiHeader
1>40	| bmiColors
1>	+---
1>
1>class tagBITMAPCOREINFO	size(16):
1>	+---
1> 0	| tagBITMAPCOREHEADER bmciHeader
1>12	| bmciColors
1>  	| <alignment member> (size=1)
1>	+---
1>
1>class tagBITMAPFILEHEADER	size(14):
1>	+---
1> 0	| bfType
1> 2	| bfSize
1> 6	| bfReserved1
1> 8	| bfReserved2
1>10	| bfOffBits
1>	+---
1>
1>class tagFONTSIGNATURE	size(24):
1>	+---
1> 0	| fsUsb
1>16	| fsCsb
1>	+---
1>
1>class tagCHARSETINFO	size(32):
1>	+---
1> 0	| ciCharset
1> 4	| ciACP
1> 8	| tagFONTSIGNATURE fs
1>	+---
1>
1>class tagLOCALESIGNATURE	size(32):
1>	+---
1> 0	| lsUsb
1>16	| lsCsbDefault
1>24	| lsCsbSupported
1>	+---
1>
1>class tagHANDLETABLE	size(4):
1>	+---
1> 0	| objectHandle
1>	+---
1>
1>class tagMETARECORD	size(8):
1>	+---
1> 0	| rdSize
1> 4	| rdFunction
1> 6	| rdParm
1>	+---
1>
1>class tagMETAFILEPICT	size(16):
1>	+---
1> 0	| mm
1> 4	| xExt
1> 8	| yExt
1>12	| hMF
1>	+---
1>
1>class tagMETAHEADER	size(18):
1>	+---
1> 0	| mtType
1> 2	| mtHeaderSize
1> 4	| mtVersion
1> 6	| mtSize
1>10	| mtNoObjects
1>12	| mtMaxRecord
1>16	| mtNoParameters
1>	+---
1>
1>class tagENHMETARECORD	size(12):
1>	+---
1> 0	| iType
1> 4	| nSize
1> 8	| dParm
1>	+---
1>
1>class tagENHMETAHEADER	size(108):
1>	+---
1> 0	| iType
1> 4	| nSize
1> 8	| _RECTL rclBounds
1>24	| _RECTL rclFrame
1>40	| dSignature
1>44	| nVersion
1>48	| nBytes
1>52	| nRecords
1>56	| nHandles
1>58	| sReserved
1>60	| nDescription
1>64	| offDescription
1>68	| nPalEntries
1>72	| tagSIZE szlDevice
1>80	| tagSIZE szlMillimeters
1>88	| cbPixelFormat
1>92	| offPixelFormat
1>96	| bOpenGL
1>100	| tagSIZE szlMicrometers
1>	+---
1>
1>class tagTEXTMETRICA	size(56):
1>	+---
1> 0	| tmHeight
1> 4	| tmAscent
1> 8	| tmDescent
1>12	| tmInternalLeading
1>16	| tmExternalLeading
1>20	| tmAveCharWidth
1>24	| tmMaxCharWidth
1>28	| tmWeight
1>32	| tmOverhang
1>36	| tmDigitizedAspectX
1>40	| tmDigitizedAspectY
1>44	| tmFirstChar
1>45	| tmLastChar
1>46	| tmDefaultChar
1>47	| tmBreakChar
1>48	| tmItalic
1>49	| tmUnderlined
1>50	| tmStruckOut
1>51	| tmPitchAndFamily
1>52	| tmCharSet
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagTEXTMETRICW	size(60):
1>	+---
1> 0	| tmHeight
1> 4	| tmAscent
1> 8	| tmDescent
1>12	| tmInternalLeading
1>16	| tmExternalLeading
1>20	| tmAveCharWidth
1>24	| tmMaxCharWidth
1>28	| tmWeight
1>32	| tmOverhang
1>36	| tmDigitizedAspectX
1>40	| tmDigitizedAspectY
1>44	| tmFirstChar
1>46	| tmLastChar
1>48	| tmDefaultChar
1>50	| tmBreakChar
1>52	| tmItalic
1>53	| tmUnderlined
1>54	| tmStruckOut
1>55	| tmPitchAndFamily
1>56	| tmCharSet
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagNEWTEXTMETRICA	size(72):
1>	+---
1> 0	| tmHeight
1> 4	| tmAscent
1> 8	| tmDescent
1>12	| tmInternalLeading
1>16	| tmExternalLeading
1>20	| tmAveCharWidth
1>24	| tmMaxCharWidth
1>28	| tmWeight
1>32	| tmOverhang
1>36	| tmDigitizedAspectX
1>40	| tmDigitizedAspectY
1>44	| tmFirstChar
1>45	| tmLastChar
1>46	| tmDefaultChar
1>47	| tmBreakChar
1>48	| tmItalic
1>49	| tmUnderlined
1>50	| tmStruckOut
1>51	| tmPitchAndFamily
1>52	| tmCharSet
1>  	| <alignment member> (size=3)
1>56	| ntmFlags
1>60	| ntmSizeEM
1>64	| ntmCellHeight
1>68	| ntmAvgWidth
1>	+---
1>
1>class tagNEWTEXTMETRICW	size(76):
1>	+---
1> 0	| tmHeight
1> 4	| tmAscent
1> 8	| tmDescent
1>12	| tmInternalLeading
1>16	| tmExternalLeading
1>20	| tmAveCharWidth
1>24	| tmMaxCharWidth
1>28	| tmWeight
1>32	| tmOverhang
1>36	| tmDigitizedAspectX
1>40	| tmDigitizedAspectY
1>44	| tmFirstChar
1>46	| tmLastChar
1>48	| tmDefaultChar
1>50	| tmBreakChar
1>52	| tmItalic
1>53	| tmUnderlined
1>54	| tmStruckOut
1>55	| tmPitchAndFamily
1>56	| tmCharSet
1>  	| <alignment member> (size=3)
1>60	| ntmFlags
1>64	| ntmSizeEM
1>68	| ntmCellHeight
1>72	| ntmAvgWidth
1>	+---
1>
1>class tagNEWTEXTMETRICEXA	size(96):
1>	+---
1> 0	| tagNEWTEXTMETRICA ntmTm
1>72	| tagFONTSIGNATURE ntmFontSig
1>	+---
1>
1>class tagNEWTEXTMETRICEXW	size(100):
1>	+---
1> 0	| tagNEWTEXTMETRICW ntmTm
1>76	| tagFONTSIGNATURE ntmFontSig
1>	+---
1>
1>class tagPELARRAY	size(20):
1>	+---
1> 0	| paXCount
1> 4	| paYCount
1> 8	| paXExt
1>12	| paYExt
1>16	| paRGBs
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagLOGBRUSH	size(12):
1>	+---
1> 0	| lbStyle
1> 4	| lbColor
1> 8	| lbHatch
1>	+---
1>
1>class tagLOGBRUSH32	size(12):
1>	+---
1> 0	| lbStyle
1> 4	| lbColor
1> 8	| lbHatch
1>	+---
1>
1>class tagLOGPEN	size(16):
1>	+---
1> 0	| lopnStyle
1> 4	| tagPOINT lopnWidth
1>12	| lopnColor
1>	+---
1>
1>class tagEXTLOGPEN	size(28):
1>	+---
1> 0	| elpPenStyle
1> 4	| elpWidth
1> 8	| elpBrushStyle
1>12	| elpColor
1>16	| elpHatch
1>20	| elpNumEntries
1>24	| elpStyleEntry
1>	+---
1>
1>class tagEXTLOGPEN32	size(28):
1>	+---
1> 0	| elpPenStyle
1> 4	| elpWidth
1> 8	| elpBrushStyle
1>12	| elpColor
1>16	| elpHatch
1>20	| elpNumEntries
1>24	| elpStyleEntry
1>	+---
1>
1>class tagPALETTEENTRY	size(4):
1>	+---
1> 0	| peRed
1> 1	| peGreen
1> 2	| peBlue
1> 3	| peFlags
1>	+---
1>
1>class tagLOGPALETTE	size(8):
1>	+---
1> 0	| palVersion
1> 2	| palNumEntries
1> 4	| palPalEntry
1>	+---
1>
1>class tagLOGFONTA	size(60):
1>	+---
1> 0	| lfHeight
1> 4	| lfWidth
1> 8	| lfEscapement
1>12	| lfOrientation
1>16	| lfWeight
1>20	| lfItalic
1>21	| lfUnderline
1>22	| lfStrikeOut
1>23	| lfCharSet
1>24	| lfOutPrecision
1>25	| lfClipPrecision
1>26	| lfQuality
1>27	| lfPitchAndFamily
1>28	| lfFaceName
1>	+---
1>
1>class tagLOGFONTW	size(92):
1>	+---
1> 0	| lfHeight
1> 4	| lfWidth
1> 8	| lfEscapement
1>12	| lfOrientation
1>16	| lfWeight
1>20	| lfItalic
1>21	| lfUnderline
1>22	| lfStrikeOut
1>23	| lfCharSet
1>24	| lfOutPrecision
1>25	| lfClipPrecision
1>26	| lfQuality
1>27	| lfPitchAndFamily
1>28	| lfFaceName
1>	+---
1>
1>class tagENUMLOGFONTA	size(156):
1>	+---
1> 0	| tagLOGFONTA elfLogFont
1>60	| elfFullName
1>124	| elfStyle
1>	+---
1>
1>class tagENUMLOGFONTW	size(284):
1>	+---
1> 0	| tagLOGFONTW elfLogFont
1>92	| elfFullName
1>220	| elfStyle
1>	+---
1>
1>class tagENUMLOGFONTEXA	size(188):
1>	+---
1> 0	| tagLOGFONTA elfLogFont
1>60	| elfFullName
1>124	| elfStyle
1>156	| elfScript
1>	+---
1>
1>class tagENUMLOGFONTEXW	size(348):
1>	+---
1> 0	| tagLOGFONTW elfLogFont
1>92	| elfFullName
1>220	| elfStyle
1>284	| elfScript
1>	+---
1>
1>class tagPANOSE	size(10):
1>	+---
1> 0	| bFamilyType
1> 1	| bSerifStyle
1> 2	| bWeight
1> 3	| bProportion
1> 4	| bContrast
1> 5	| bStrokeVariation
1> 6	| bArmStyle
1> 7	| bLetterform
1> 8	| bMidline
1> 9	| bXHeight
1>	+---
1>
1>class tagEXTLOGFONTA	size(192):
1>	+---
1> 0	| tagLOGFONTA elfLogFont
1>60	| elfFullName
1>124	| elfStyle
1>156	| elfVersion
1>160	| elfStyleSize
1>164	| elfMatch
1>168	| elfReserved
1>172	| elfVendorId
1>176	| elfCulture
1>180	| tagPANOSE elfPanose
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class tagEXTLOGFONTW	size(320):
1>	+---
1> 0	| tagLOGFONTW elfLogFont
1>92	| elfFullName
1>220	| elfStyle
1>284	| elfVersion
1>288	| elfStyleSize
1>292	| elfMatch
1>296	| elfReserved
1>300	| elfVendorId
1>304	| elfCulture
1>308	| tagPANOSE elfPanose
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _devicemodeA::<unnamed-tag>::<unnamed-tag>	size(16):
1>	+---
1> 0	| dmOrientation
1> 2	| dmPaperSize
1> 4	| dmPaperLength
1> 6	| dmPaperWidth
1> 8	| dmScale
1>10	| dmCopies
1>12	| dmDefaultSource
1>14	| dmPrintQuality
1>	+---
1>
1>class _devicemodeA::<unnamed-tag>::<unnamed-tag>	size(16):
1>	+---
1> 0	| _POINTL dmPosition
1> 8	| dmDisplayOrientation
1>12	| dmDisplayFixedOutput
1>	+---
1>
1>class _devicemodeA::<unnamed-tag>	size(16):
1>	+---
1> 0	| dmOrientation
1> 2	| dmPaperSize
1> 4	| dmPaperLength
1> 6	| dmPaperWidth
1> 8	| dmScale
1>10	| dmCopies
1>12	| dmDefaultSource
1>14	| dmPrintQuality
1> 0	| _POINTL dmPosition
1> 8	| dmDisplayOrientation
1>12	| dmDisplayFixedOutput
1>	+---
1>
1>class _devicemodeA::<unnamed-tag>	size(4):
1>	+---
1> 0	| dmDisplayFlags
1> 0	| dmNup
1>	+---
1>
1>class _devicemodeA	size(156):
1>	+---
1> 0	| dmDeviceName
1>32	| dmSpecVersion
1>34	| dmDriverVersion
1>36	| dmSize
1>38	| dmDriverExtra
1>40	| dmFields
1>  	| <unnamed-tag> <alignment member> (size=44)
1>  	| <unnamed-tag> <alignment member> (size=44)
1>44	| dmOrientation
1>46	| dmPaperSize
1>48	| dmPaperLength
1>50	| dmPaperWidth
1>52	| dmScale
1>54	| dmCopies
1>56	| dmDefaultSource
1>58	| dmPrintQuality
1>  	| <unnamed-tag> <alignment member> (size=44)
1>  	| <unnamed-tag> <alignment member> (size=44)
1>44	| _POINTL dmPosition
1>52	| dmDisplayOrientation
1>56	| dmDisplayFixedOutput
1>  	| <unnamed-tag> <alignment member> (size=44)
1>60	| dmColor
1>62	| dmDuplex
1>64	| dmYResolution
1>66	| dmTTOption
1>68	| dmCollate
1>70	| dmFormName
1>102	| dmLogPixels
1>104	| dmBitsPerPel
1>108	| dmPelsWidth
1>112	| dmPelsHeight
1>  	| <unnamed-tag> <alignment member> (size=116)
1>116	| dmDisplayFlags
1>116	| dmNup
1>120	| dmDisplayFrequency
1>124	| dmICMMethod
1>128	| dmICMIntent
1>132	| dmMediaType
1>136	| dmDitherType
1>140	| dmReserved1
1>144	| dmReserved2
1>148	| dmPanningWidth
1>152	| dmPanningHeight
1>	+---
1>
1>class _devicemodeW::<unnamed-tag>::<unnamed-tag>	size(16):
1>	+---
1> 0	| dmOrientation
1> 2	| dmPaperSize
1> 4	| dmPaperLength
1> 6	| dmPaperWidth
1> 8	| dmScale
1>10	| dmCopies
1>12	| dmDefaultSource
1>14	| dmPrintQuality
1>	+---
1>
1>class _devicemodeW::<unnamed-tag>::<unnamed-tag>	size(16):
1>	+---
1> 0	| _POINTL dmPosition
1> 8	| dmDisplayOrientation
1>12	| dmDisplayFixedOutput
1>	+---
1>
1>class _devicemodeW::<unnamed-tag>	size(16):
1>	+---
1> 0	| dmOrientation
1> 2	| dmPaperSize
1> 4	| dmPaperLength
1> 6	| dmPaperWidth
1> 8	| dmScale
1>10	| dmCopies
1>12	| dmDefaultSource
1>14	| dmPrintQuality
1> 0	| _POINTL dmPosition
1> 8	| dmDisplayOrientation
1>12	| dmDisplayFixedOutput
1>	+---
1>
1>class _devicemodeW::<unnamed-tag>	size(4):
1>	+---
1> 0	| dmDisplayFlags
1> 0	| dmNup
1>	+---
1>
1>class _devicemodeW	size(220):
1>	+---
1> 0	| dmDeviceName
1>64	| dmSpecVersion
1>66	| dmDriverVersion
1>68	| dmSize
1>70	| dmDriverExtra
1>72	| dmFields
1>  	| <unnamed-tag> <alignment member> (size=76)
1>  	| <unnamed-tag> <alignment member> (size=76)
1>76	| dmOrientation
1>78	| dmPaperSize
1>80	| dmPaperLength
1>82	| dmPaperWidth
1>84	| dmScale
1>86	| dmCopies
1>88	| dmDefaultSource
1>90	| dmPrintQuality
1>  	| <unnamed-tag> <alignment member> (size=76)
1>  	| <unnamed-tag> <alignment member> (size=76)
1>76	| _POINTL dmPosition
1>84	| dmDisplayOrientation
1>88	| dmDisplayFixedOutput
1>  	| <unnamed-tag> <alignment member> (size=76)
1>92	| dmColor
1>94	| dmDuplex
1>96	| dmYResolution
1>98	| dmTTOption
1>100	| dmCollate
1>102	| dmFormName
1>166	| dmLogPixels
1>168	| dmBitsPerPel
1>172	| dmPelsWidth
1>176	| dmPelsHeight
1>  	| <unnamed-tag> <alignment member> (size=180)
1>180	| dmDisplayFlags
1>180	| dmNup
1>184	| dmDisplayFrequency
1>188	| dmICMMethod
1>192	| dmICMIntent
1>196	| dmMediaType
1>200	| dmDitherType
1>204	| dmReserved1
1>208	| dmReserved2
1>212	| dmPanningWidth
1>216	| dmPanningHeight
1>	+---
1>
1>class _DISPLAY_DEVICEA	size(424):
1>	+---
1> 0	| cb
1> 4	| DeviceName
1>36	| DeviceString
1>164	| StateFlags
1>168	| DeviceID
1>296	| DeviceKey
1>	+---
1>
1>class _DISPLAY_DEVICEW	size(840):
1>	+---
1> 0	| cb
1> 4	| DeviceName
1>68	| DeviceString
1>324	| StateFlags
1>328	| DeviceID
1>584	| DeviceKey
1>	+---
1>
1>class DISPLAYCONFIG_RATIONAL	size(8):
1>	+---
1> 0	| Numerator
1> 4	| Denominator
1>	+---
1>
1>class DISPLAYCONFIG_2DREGION	size(8):
1>	+---
1> 0	| cx
1> 4	| cy
1>	+---
1>
1>class DISPLAYCONFIG_VIDEO_SIGNAL_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| videoStandard (bitstart=0,nbits=16)
1> 0.	| vSyncFreqDivider (bitstart=16,nbits=6)
1> 0.	| reserved (bitstart=22,nbits=10)
1>	+---
1>
1>class DISPLAYCONFIG_VIDEO_SIGNAL_INFO::<unnamed-tag>	size(4):
1>	+---
1> 0	| <unnamed-type-AdditionalSignalInfo> AdditionalSignalInfo
1> 0	| videoStandard
1>	+---
1>
1>class DISPLAYCONFIG_VIDEO_SIGNAL_INFO	size(48):
1>	+---
1> 0	| pixelRate
1> 8	| DISPLAYCONFIG_RATIONAL hSyncFreq
1>16	| DISPLAYCONFIG_RATIONAL vSyncFreq
1>24	| DISPLAYCONFIG_2DREGION activeSize
1>32	| DISPLAYCONFIG_2DREGION totalSize
1>  	| <unnamed-tag> <alignment member> (size=40)
1>40	| <unnamed-type-AdditionalSignalInfo> AdditionalSignalInfo
1>40	| videoStandard
1>44	| DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering
1>	+---
1>
1>class DISPLAYCONFIG_SOURCE_MODE	size(20):
1>	+---
1> 0	| width
1> 4	| height
1> 8	| DISPLAYCONFIG_PIXELFORMAT pixelFormat
1>12	| _POINTL position
1>	+---
1>
1>class DISPLAYCONFIG_TARGET_MODE	size(48):
1>	+---
1> 0	| DISPLAYCONFIG_VIDEO_SIGNAL_INFO targetVideoSignalInfo
1>	+---
1>
1>class DISPLAYCONFIG_DESKTOP_IMAGE_INFO	size(40):
1>	+---
1> 0	| _POINTL PathSourceSize
1> 8	| _RECTL DesktopImageRegion
1>24	| _RECTL DesktopImageClip
1>	+---
1>
1>class DISPLAYCONFIG_MODE_INFO::<unnamed-tag>	size(48):
1>	+---
1> 0	| DISPLAYCONFIG_TARGET_MODE targetMode
1> 0	| DISPLAYCONFIG_SOURCE_MODE sourceMode
1> 0	| DISPLAYCONFIG_DESKTOP_IMAGE_INFO desktopImageInfo
1>	+---
1>
1>class DISPLAYCONFIG_MODE_INFO	size(64):
1>	+---
1> 0	| DISPLAYCONFIG_MODE_INFO_TYPE infoType
1> 4	| id
1> 8	| _LUID adapterId
1>  	| <unnamed-tag> <alignment member> (size=16)
1>16	| DISPLAYCONFIG_TARGET_MODE targetMode
1>16	| DISPLAYCONFIG_SOURCE_MODE sourceMode
1>16	| DISPLAYCONFIG_DESKTOP_IMAGE_INFO desktopImageInfo
1>	+---
1>
1>class DISPLAYCONFIG_PATH_SOURCE_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| cloneGroupId (bitstart=0,nbits=16)
1> 0.	| sourceModeInfoIdx (bitstart=16,nbits=16)
1>	+---
1>
1>class DISPLAYCONFIG_PATH_SOURCE_INFO::<unnamed-tag>	size(4):
1>	+---
1> 0	| modeInfoIdx
1> 0.	| cloneGroupId (bitstart=0,nbits=16)
1> 0.	| sourceModeInfoIdx (bitstart=16,nbits=16)
1>	+---
1>
1>class DISPLAYCONFIG_PATH_SOURCE_INFO	size(20):
1>	+---
1> 0	| _LUID adapterId
1> 8	| id
1>  	| <unnamed-tag> <alignment member> (size=12)
1>12	| modeInfoIdx
1>  	| <unnamed-tag> <alignment member> (size=12)
1>12.	| cloneGroupId (bitstart=0,nbits=16)
1>12.	| sourceModeInfoIdx (bitstart=16,nbits=16)
1>  	| <unnamed-tag> <alignment member> (size=12)
1>16	| statusFlags
1>	+---
1>
1>class DISPLAYCONFIG_PATH_TARGET_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| desktopModeInfoIdx (bitstart=0,nbits=16)
1> 0.	| targetModeInfoIdx (bitstart=16,nbits=16)
1>	+---
1>
1>class DISPLAYCONFIG_PATH_TARGET_INFO::<unnamed-tag>	size(4):
1>	+---
1> 0	| modeInfoIdx
1> 0.	| desktopModeInfoIdx (bitstart=0,nbits=16)
1> 0.	| targetModeInfoIdx (bitstart=16,nbits=16)
1>	+---
1>
1>class DISPLAYCONFIG_PATH_TARGET_INFO	size(48):
1>	+---
1> 0	| _LUID adapterId
1> 8	| id
1>  	| <unnamed-tag> <alignment member> (size=12)
1>12	| modeInfoIdx
1>  	| <unnamed-tag> <alignment member> (size=12)
1>12.	| desktopModeInfoIdx (bitstart=0,nbits=16)
1>12.	| targetModeInfoIdx (bitstart=16,nbits=16)
1>  	| <unnamed-tag> <alignment member> (size=12)
1>16	| DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology
1>20	| DISPLAYCONFIG_ROTATION rotation
1>24	| DISPLAYCONFIG_SCALING scaling
1>28	| DISPLAYCONFIG_RATIONAL refreshRate
1>36	| DISPLAYCONFIG_SCANLINE_ORDERING scanLineOrdering
1>40	| targetAvailable
1>44	| statusFlags
1>	+---
1>
1>class DISPLAYCONFIG_PATH_INFO	size(72):
1>	+---
1> 0	| DISPLAYCONFIG_PATH_SOURCE_INFO sourceInfo
1>20	| DISPLAYCONFIG_PATH_TARGET_INFO targetInfo
1>68	| flags
1>	+---
1>
1>class DISPLAYCONFIG_DEVICE_INFO_HEADER	size(20):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_TYPE type
1> 4	| size
1> 8	| _LUID adapterId
1>16	| id
1>	+---
1>
1>class DISPLAYCONFIG_SOURCE_DEVICE_NAME	size(84):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>20	| viewGdiDeviceName
1>	+---
1>
1>class DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| friendlyNameFromEdid (bitstart=0,nbits=1)
1> 0.	| friendlyNameForced (bitstart=1,nbits=1)
1> 0.	| edidIdsValid (bitstart=2,nbits=1)
1> 0.	| reserved (bitstart=3,nbits=29)
1>	+---
1>
1>class DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS::<unnamed-tag>	size(4):
1>	+---
1> 0.	| friendlyNameFromEdid (bitstart=0,nbits=1)
1> 0.	| friendlyNameForced (bitstart=1,nbits=1)
1> 0.	| edidIdsValid (bitstart=2,nbits=1)
1> 0.	| reserved (bitstart=3,nbits=29)
1> 0	| value
1>	+---
1>
1>class DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS	size(4):
1>	+---
1> 0.	| friendlyNameFromEdid (bitstart=0,nbits=1)
1> 0.	| friendlyNameForced (bitstart=1,nbits=1)
1> 0.	| edidIdsValid (bitstart=2,nbits=1)
1> 0.	| reserved (bitstart=3,nbits=29)
1> 0	| value
1>	+---
1>
1>class DISPLAYCONFIG_TARGET_DEVICE_NAME	size(420):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>20	| DISPLAYCONFIG_TARGET_DEVICE_NAME_FLAGS flags
1>24	| DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY outputTechnology
1>28	| edidManufactureId
1>30	| edidProductCodeId
1>32	| connectorInstance
1>36	| monitorFriendlyDeviceName
1>164	| monitorDevicePath
1>	+---
1>
1>class DISPLAYCONFIG_TARGET_PREFERRED_MODE	size(80):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>20	| width
1>24	| height
1>  	| <alignment member> (size=4)
1>32	| DISPLAYCONFIG_TARGET_MODE targetMode
1>	+---
1>
1>class DISPLAYCONFIG_ADAPTER_NAME	size(276):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>20	| adapterDevicePath
1>	+---
1>
1>class DISPLAYCONFIG_TARGET_BASE_TYPE	size(24):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>20	| DISPLAYCONFIG_VIDEO_OUTPUT_TECHNOLOGY baseOutputTechnology
1>	+---
1>
1>class DISPLAYCONFIG_SET_TARGET_PERSISTENCE::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| bootPersistenceOn (bitstart=0,nbits=1)
1> 0.	| reserved (bitstart=1,nbits=31)
1>	+---
1>
1>class DISPLAYCONFIG_SET_TARGET_PERSISTENCE::<unnamed-tag>	size(4):
1>	+---
1> 0.	| bootPersistenceOn (bitstart=0,nbits=1)
1> 0.	| reserved (bitstart=1,nbits=31)
1> 0	| value
1>	+---
1>
1>class DISPLAYCONFIG_SET_TARGET_PERSISTENCE	size(24):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>  	| <unnamed-tag> <alignment member> (size=20)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20.	| bootPersistenceOn (bitstart=0,nbits=1)
1>20.	| reserved (bitstart=1,nbits=31)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20	| value
1>	+---
1>
1>class DISPLAYCONFIG_SUPPORT_VIRTUAL_RESOLUTION::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| disableMonitorVirtualResolution (bitstart=0,nbits=1)
1> 0.	| reserved (bitstart=1,nbits=31)
1>	+---
1>
1>class DISPLAYCONFIG_SUPPORT_VIRTUAL_RESOLUTION::<unnamed-tag>	size(4):
1>	+---
1> 0.	| disableMonitorVirtualResolution (bitstart=0,nbits=1)
1> 0.	| reserved (bitstart=1,nbits=31)
1> 0	| value
1>	+---
1>
1>class DISPLAYCONFIG_SUPPORT_VIRTUAL_RESOLUTION	size(24):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>  	| <unnamed-tag> <alignment member> (size=20)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20.	| disableMonitorVirtualResolution (bitstart=0,nbits=1)
1>20.	| reserved (bitstart=1,nbits=31)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20	| value
1>	+---
1>
1>class _DISPLAYCONFIG_GET_ADVANCED_COLOR_INFO::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| advancedColorSupported (bitstart=0,nbits=1)
1> 0.	| advancedColorEnabled (bitstart=1,nbits=1)
1> 0.	| wideColorEnforced (bitstart=2,nbits=1)
1> 0.	| reserved (bitstart=3,nbits=29)
1>	+---
1>
1>class _DISPLAYCONFIG_GET_ADVANCED_COLOR_INFO::<unnamed-tag>	size(4):
1>	+---
1> 0.	| advancedColorSupported (bitstart=0,nbits=1)
1> 0.	| advancedColorEnabled (bitstart=1,nbits=1)
1> 0.	| wideColorEnforced (bitstart=2,nbits=1)
1> 0.	| reserved (bitstart=3,nbits=29)
1> 0	| value
1>	+---
1>
1>class _DISPLAYCONFIG_GET_ADVANCED_COLOR_INFO	size(32):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>  	| <unnamed-tag> <alignment member> (size=20)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20.	| advancedColorSupported (bitstart=0,nbits=1)
1>20.	| advancedColorEnabled (bitstart=1,nbits=1)
1>20.	| wideColorEnforced (bitstart=2,nbits=1)
1>20.	| reserved (bitstart=3,nbits=29)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20	| value
1>24	| _DISPLAYCONFIG_COLOR_ENCODING colorEncoding
1>28	| bitsPerColorChannel
1>	+---
1>
1>class _DISPLAYCONFIG_SET_ADVANCED_COLOR_STATE::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0.	| enableAdvancedColor (bitstart=0,nbits=1)
1> 0.	| reserved (bitstart=1,nbits=31)
1>	+---
1>
1>class _DISPLAYCONFIG_SET_ADVANCED_COLOR_STATE::<unnamed-tag>	size(4):
1>	+---
1> 0.	| enableAdvancedColor (bitstart=0,nbits=1)
1> 0.	| reserved (bitstart=1,nbits=31)
1> 0	| value
1>	+---
1>
1>class _DISPLAYCONFIG_SET_ADVANCED_COLOR_STATE	size(24):
1>	+---
1> 0	| DISPLAYCONFIG_DEVICE_INFO_HEADER header
1>  	| <unnamed-tag> <alignment member> (size=20)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20.	| enableAdvancedColor (bitstart=0,nbits=1)
1>20.	| reserved (bitstart=1,nbits=31)
1>  	| <unnamed-tag> <alignment member> (size=20)
1>20	| value
1>	+---
1>
1>class _RGNDATAHEADER	size(32):
1>	+---
1> 0	| dwSize
1> 4	| iType
1> 8	| nCount
1>12	| nRgnSize
1>16	| tagRECT rcBound
1>	+---
1>
1>class _RGNDATA	size(36):
1>	+---
1> 0	| _RGNDATAHEADER rdh
1>32	| Buffer
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _ABC	size(12):
1>	+---
1> 0	| abcA
1> 4	| abcB
1> 8	| abcC
1>	+---
1>
1>class _ABCFLOAT	size(12):
1>	+---
1> 0	| abcfA
1> 4	| abcfB
1> 8	| abcfC
1>	+---
1>
1>class _OUTLINETEXTMETRICA	size(212):
1>	+---
1> 0	| otmSize
1> 4	| tagTEXTMETRICA otmTextMetrics
1>60	| otmFiller
1>61	| tagPANOSE otmPanoseNumber
1>  	| <alignment member> (size=1)
1>72	| otmfsSelection
1>76	| otmfsType
1>80	| otmsCharSlopeRise
1>84	| otmsCharSlopeRun
1>88	| otmItalicAngle
1>92	| otmEMSquare
1>96	| otmAscent
1>100	| otmDescent
1>104	| otmLineGap
1>108	| otmsCapEmHeight
1>112	| otmsXHeight
1>116	| tagRECT otmrcFontBox
1>132	| otmMacAscent
1>136	| otmMacDescent
1>140	| otmMacLineGap
1>144	| otmusMinimumPPEM
1>148	| tagPOINT otmptSubscriptSize
1>156	| tagPOINT otmptSubscriptOffset
1>164	| tagPOINT otmptSuperscriptSize
1>172	| tagPOINT otmptSuperscriptOffset
1>180	| otmsStrikeoutSize
1>184	| otmsStrikeoutPosition
1>188	| otmsUnderscoreSize
1>192	| otmsUnderscorePosition
1>196	| otmpFamilyName
1>200	| otmpFaceName
1>204	| otmpStyleName
1>208	| otmpFullName
1>	+---
1>
1>class _OUTLINETEXTMETRICW	size(216):
1>	+---
1> 0	| otmSize
1> 4	| tagTEXTMETRICW otmTextMetrics
1>64	| otmFiller
1>65	| tagPANOSE otmPanoseNumber
1>  	| <alignment member> (size=1)
1>76	| otmfsSelection
1>80	| otmfsType
1>84	| otmsCharSlopeRise
1>88	| otmsCharSlopeRun
1>92	| otmItalicAngle
1>96	| otmEMSquare
1>100	| otmAscent
1>104	| otmDescent
1>108	| otmLineGap
1>112	| otmsCapEmHeight
1>116	| otmsXHeight
1>120	| tagRECT otmrcFontBox
1>136	| otmMacAscent
1>140	| otmMacDescent
1>144	| otmMacLineGap
1>148	| otmusMinimumPPEM
1>152	| tagPOINT otmptSubscriptSize
1>160	| tagPOINT otmptSubscriptOffset
1>168	| tagPOINT otmptSuperscriptSize
1>176	| tagPOINT otmptSuperscriptOffset
1>184	| otmsStrikeoutSize
1>188	| otmsStrikeoutPosition
1>192	| otmsUnderscoreSize
1>196	| otmsUnderscorePosition
1>200	| otmpFamilyName
1>204	| otmpFaceName
1>208	| otmpStyleName
1>212	| otmpFullName
1>	+---
1>
1>class tagPOLYTEXTA	size(40):
1>	+---
1> 0	| x
1> 4	| y
1> 8	| n
1>12	| lpstr
1>16	| uiFlags
1>20	| tagRECT rcl
1>36	| pdx
1>	+---
1>
1>class tagPOLYTEXTW	size(40):
1>	+---
1> 0	| x
1> 4	| y
1> 8	| n
1>12	| lpstr
1>16	| uiFlags
1>20	| tagRECT rcl
1>36	| pdx
1>	+---
1>
1>class _FIXED	size(4):
1>	+---
1> 0	| fract
1> 2	| value
1>	+---
1>
1>class _MAT2	size(16):
1>	+---
1> 0	| _FIXED eM11
1> 4	| _FIXED eM12
1> 8	| _FIXED eM21
1>12	| _FIXED eM22
1>	+---
1>
1>class _GLYPHMETRICS	size(20):
1>	+---
1> 0	| gmBlackBoxX
1> 4	| gmBlackBoxY
1> 8	| tagPOINT gmptGlyphOrigin
1>16	| gmCellIncX
1>18	| gmCellIncY
1>	+---
1>
1>class tagPOINTFX	size(8):
1>	+---
1> 0	| _FIXED x
1> 4	| _FIXED y
1>	+---
1>
1>class tagTTPOLYCURVE	size(12):
1>	+---
1> 0	| wType
1> 2	| cpfx
1> 4	| apfx
1>	+---
1>
1>class tagTTPOLYGONHEADER	size(16):
1>	+---
1> 0	| cb
1> 4	| dwType
1> 8	| tagPOINTFX pfxStart
1>	+---
1>
1>class tagGCP_RESULTSA	size(36):
1>	+---
1> 0	| lStructSize
1> 4	| lpOutString
1> 8	| lpOrder
1>12	| lpDx
1>16	| lpCaretPos
1>20	| lpClass
1>24	| lpGlyphs
1>28	| nGlyphs
1>32	| nMaxFit
1>	+---
1>
1>class tagGCP_RESULTSW	size(36):
1>	+---
1> 0	| lStructSize
1> 4	| lpOutString
1> 8	| lpOrder
1>12	| lpDx
1>16	| lpCaretPos
1>20	| lpClass
1>24	| lpGlyphs
1>28	| nGlyphs
1>32	| nMaxFit
1>	+---
1>
1>class _RASTERIZER_STATUS	size(6):
1>	+---
1> 0	| nSize
1> 2	| wFlags
1> 4	| nLanguageID
1>	+---
1>
1>class tagPIXELFORMATDESCRIPTOR	size(40):
1>	+---
1> 0	| nSize
1> 2	| nVersion
1> 4	| dwFlags
1> 8	| iPixelType
1> 9	| cColorBits
1>10	| cRedBits
1>11	| cRedShift
1>12	| cGreenBits
1>13	| cGreenShift
1>14	| cBlueBits
1>15	| cBlueShift
1>16	| cAlphaBits
1>17	| cAlphaShift
1>18	| cAccumBits
1>19	| cAccumRedBits
1>20	| cAccumGreenBits
1>21	| cAccumBlueBits
1>22	| cAccumAlphaBits
1>23	| cDepthBits
1>24	| cStencilBits
1>25	| cAuxBuffers
1>26	| iLayerType
1>27	| bReserved
1>28	| dwLayerMask
1>32	| dwVisibleMask
1>36	| dwDamageMask
1>	+---
1>
1>class tagWCRANGE	size(4):
1>	+---
1> 0	| wcLow
1> 2	| cGlyphs
1>	+---
1>
1>class tagGLYPHSET	size(20):
1>	+---
1> 0	| cbThis
1> 4	| flAccel
1> 8	| cGlyphsSupported
1>12	| cRanges
1>16	| ranges
1>	+---
1>
1>class tagDESIGNVECTOR	size(72):
1>	+---
1> 0	| dvReserved
1> 4	| dvNumAxes
1> 8	| dvValues
1>	+---
1>
1>class tagAXISINFOA	size(24):
1>	+---
1> 0	| axMinValue
1> 4	| axMaxValue
1> 8	| axAxisName
1>	+---
1>
1>class tagAXISINFOW	size(40):
1>	+---
1> 0	| axMinValue
1> 4	| axMaxValue
1> 8	| axAxisName
1>	+---
1>
1>class tagAXESLISTA	size(392):
1>	+---
1> 0	| axlReserved
1> 4	| axlNumAxes
1> 8	| axlAxisInfo
1>	+---
1>
1>class tagAXESLISTW	size(648):
1>	+---
1> 0	| axlReserved
1> 4	| axlNumAxes
1> 8	| axlAxisInfo
1>	+---
1>
1>class tagENUMLOGFONTEXDVA	size(260):
1>	+---
1> 0	| tagENUMLOGFONTEXA elfEnumLogfontEx
1>188	| tagDESIGNVECTOR elfDesignVector
1>	+---
1>
1>class tagENUMLOGFONTEXDVW	size(420):
1>	+---
1> 0	| tagENUMLOGFONTEXW elfEnumLogfontEx
1>348	| tagDESIGNVECTOR elfDesignVector
1>	+---
1>
1>class tagENUMTEXTMETRICA	size(488):
1>	+---
1> 0	| tagNEWTEXTMETRICEXA etmNewTextMetricEx
1>96	| tagAXESLISTA etmAxesList
1>	+---
1>
1>class tagENUMTEXTMETRICW	size(748):
1>	+---
1> 0	| tagNEWTEXTMETRICEXW etmNewTextMetricEx
1>100	| tagAXESLISTW etmAxesList
1>	+---
1>
1>class _TRIVERTEX	size(16):
1>	+---
1> 0	| x
1> 4	| y
1> 8	| Red
1>10	| Green
1>12	| Blue
1>14	| Alpha
1>	+---
1>
1>class _GRADIENT_TRIANGLE	size(12):
1>	+---
1> 0	| Vertex1
1> 4	| Vertex2
1> 8	| Vertex3
1>	+---
1>
1>class _GRADIENT_RECT	size(8):
1>	+---
1> 0	| UpperLeft
1> 4	| LowerRight
1>	+---
1>
1>class _BLENDFUNCTION	size(4):
1>	+---
1> 0	| BlendOp
1> 1	| BlendFlags
1> 2	| SourceConstantAlpha
1> 3	| AlphaFormat
1>	+---
1>
1>class tagDIBSECTION	size(84):
1>	+---
1> 0	| tagBITMAP dsBm
1>24	| tagBITMAPINFOHEADER dsBmih
1>64	| dsBitfields
1>76	| dshSection
1>80	| dsOffset
1>	+---
1>
1>class tagCOLORADJUSTMENT	size(24):
1>	+---
1> 0	| caSize
1> 2	| caFlags
1> 4	| caIlluminantIndex
1> 6	| caRedGamma
1> 8	| caGreenGamma
1>10	| caBlueGamma
1>12	| caReferenceBlack
1>14	| caReferenceWhite
1>16	| caContrast
1>18	| caBrightness
1>20	| caColorfulness
1>22	| caRedGreenTint
1>	+---
1>
1>class _DOCINFOA	size(20):
1>	+---
1> 0	| cbSize
1> 4	| lpszDocName
1> 8	| lpszOutput
1>12	| lpszDatatype
1>16	| fwType
1>	+---
1>
1>class _DOCINFOW	size(20):
1>	+---
1> 0	| cbSize
1> 4	| lpszDocName
1> 8	| lpszOutput
1>12	| lpszDatatype
1>16	| fwType
1>	+---
1>
1>class tagKERNINGPAIR	size(8):
1>	+---
1> 0	| wFirst
1> 2	| wSecond
1> 4	| iKernAmount
1>	+---
1>
1>class tagEMR	size(8):
1>	+---
1> 0	| iType
1> 4	| nSize
1>	+---
1>
1>class tagEMRTEXT	size(40):
1>	+---
1> 0	| _POINTL ptlReference
1> 8	| nChars
1>12	| offString
1>16	| fOptions
1>20	| _RECTL rcl
1>36	| offDx
1>	+---
1>
1>class tagABORTPATH	size(8):
1>	+---
1> 0	| tagEMR emr
1>	+---
1>
1>class tagEMRSELECTCLIPPATH	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| iMode
1>	+---
1>
1>class tagEMRSETMITERLIMIT	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| eMiterLimit
1>	+---
1>
1>class tagEMRRESTOREDC	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| iRelative
1>	+---
1>
1>class tagEMRSETARCDIRECTION	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| iArcDirection
1>	+---
1>
1>class tagEMRSETMAPPERFLAGS	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| dwFlags
1>	+---
1>
1>class tagEMRSETTEXTCOLOR	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| crColor
1>	+---
1>
1>class tagEMRSELECTOBJECT	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihObject
1>	+---
1>
1>class tagEMRSELECTPALETTE	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihPal
1>	+---
1>
1>class tagEMRRESIZEPALETTE	size(16):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihPal
1>12	| cEntries
1>	+---
1>
1>class tagEMRSETPALETTEENTRIES	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihPal
1>12	| iStart
1>16	| cEntries
1>20	| aPalEntries
1>	+---
1>
1>class tagEMRSETCOLORADJUSTMENT	size(32):
1>	+---
1> 0	| tagEMR emr
1> 8	| tagCOLORADJUSTMENT ColorAdjustment
1>	+---
1>
1>class tagEMRGDICOMMENT	size(16):
1>	+---
1> 0	| tagEMR emr
1> 8	| cbData
1>12	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMREOF	size(20):
1>	+---
1> 0	| tagEMR emr
1> 8	| nPalEntries
1>12	| offPalEntries
1>16	| nSizeLast
1>	+---
1>
1>class tagEMRLINETO	size(16):
1>	+---
1> 0	| tagEMR emr
1> 8	| _POINTL ptl
1>	+---
1>
1>class tagEMROFFSETCLIPRGN	size(16):
1>	+---
1> 0	| tagEMR emr
1> 8	| _POINTL ptlOffset
1>	+---
1>
1>class tagEMRFILLPATH	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>	+---
1>
1>class tagEMREXCLUDECLIPRECT	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclClip
1>	+---
1>
1>class tagEMRSETVIEWPORTORGEX	size(16):
1>	+---
1> 0	| tagEMR emr
1> 8	| _POINTL ptlOrigin
1>	+---
1>
1>class tagEMRSETVIEWPORTEXTEX	size(16):
1>	+---
1> 0	| tagEMR emr
1> 8	| tagSIZE szlExtent
1>	+---
1>
1>class tagEMRSCALEVIEWPORTEXTEX	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| xNum
1>12	| xDenom
1>16	| yNum
1>20	| yDenom
1>	+---
1>
1>class tagEMRSETWORLDTRANSFORM	size(32):
1>	+---
1> 0	| tagEMR emr
1> 8	| tagXFORM xform
1>	+---
1>
1>class tagEMRMODIFYWORLDTRANSFORM	size(36):
1>	+---
1> 0	| tagEMR emr
1> 8	| tagXFORM xform
1>32	| iMode
1>	+---
1>
1>class tagEMRSETPIXELV	size(20):
1>	+---
1> 0	| tagEMR emr
1> 8	| _POINTL ptlPixel
1>16	| crColor
1>	+---
1>
1>class tagEMREXTFLOODFILL	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| _POINTL ptlStart
1>16	| crColor
1>20	| iMode
1>	+---
1>
1>class tagEMRELLIPSE	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBox
1>	+---
1>
1>class tagEMRROUNDRECT	size(32):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBox
1>24	| tagSIZE szlCorner
1>	+---
1>
1>class tagEMRARC	size(40):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBox
1>24	| _POINTL ptlStart
1>32	| _POINTL ptlEnd
1>	+---
1>
1>class tagEMRANGLEARC	size(28):
1>	+---
1> 0	| tagEMR emr
1> 8	| _POINTL ptlCenter
1>16	| nRadius
1>20	| eStartAngle
1>24	| eSweepAngle
1>	+---
1>
1>class tagEMRPOLYLINE	size(36):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| cptl
1>28	| aptl
1>	+---
1>
1>class tagEMRPOLYLINE16	size(32):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| cpts
1>28	| apts
1>	+---
1>
1>class tagEMRPOLYDRAW	size(40):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| cptl
1>28	| aptl
1>36	| abTypes
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRPOLYDRAW16	size(36):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| cpts
1>28	| apts
1>32	| abTypes
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRPOLYPOLYLINE	size(44):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| nPolys
1>28	| cptl
1>32	| aPolyCounts
1>36	| aptl
1>	+---
1>
1>class tagEMRPOLYPOLYLINE16	size(40):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| nPolys
1>28	| cpts
1>32	| aPolyCounts
1>36	| apts
1>	+---
1>
1>class tagEMRINVERTRGN	size(32):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| cbRgnData
1>28	| RgnData
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRFILLRGN	size(36):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| cbRgnData
1>28	| ihBrush
1>32	| RgnData
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRFRAMERGN	size(44):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| cbRgnData
1>28	| ihBrush
1>32	| tagSIZE szlStroke
1>40	| RgnData
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMREXTSELECTCLIPRGN	size(20):
1>	+---
1> 0	| tagEMR emr
1> 8	| cbRgnData
1>12	| iMode
1>16	| RgnData
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMREXTTEXTOUTA	size(76):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| iGraphicsMode
1>28	| exScale
1>32	| eyScale
1>36	| tagEMRTEXT emrtext
1>	+---
1>
1>class tagEMRPOLYTEXTOUTA	size(80):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| iGraphicsMode
1>28	| exScale
1>32	| eyScale
1>36	| cStrings
1>40	| aemrtext
1>	+---
1>
1>class tagEMRBITBLT	size(100):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| xDest
1>28	| yDest
1>32	| cxDest
1>36	| cyDest
1>40	| dwRop
1>44	| xSrc
1>48	| ySrc
1>52	| tagXFORM xformSrc
1>76	| crBkColorSrc
1>80	| iUsageSrc
1>84	| offBmiSrc
1>88	| cbBmiSrc
1>92	| offBitsSrc
1>96	| cbBitsSrc
1>	+---
1>
1>class tagEMRSTRETCHBLT	size(108):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| xDest
1>28	| yDest
1>32	| cxDest
1>36	| cyDest
1>40	| dwRop
1>44	| xSrc
1>48	| ySrc
1>52	| tagXFORM xformSrc
1>76	| crBkColorSrc
1>80	| iUsageSrc
1>84	| offBmiSrc
1>88	| cbBmiSrc
1>92	| offBitsSrc
1>96	| cbBitsSrc
1>100	| cxSrc
1>104	| cySrc
1>	+---
1>
1>class tagEMRMASKBLT	size(128):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| xDest
1>28	| yDest
1>32	| cxDest
1>36	| cyDest
1>40	| dwRop
1>44	| xSrc
1>48	| ySrc
1>52	| tagXFORM xformSrc
1>76	| crBkColorSrc
1>80	| iUsageSrc
1>84	| offBmiSrc
1>88	| cbBmiSrc
1>92	| offBitsSrc
1>96	| cbBitsSrc
1>100	| xMask
1>104	| yMask
1>108	| iUsageMask
1>112	| offBmiMask
1>116	| cbBmiMask
1>120	| offBitsMask
1>124	| cbBitsMask
1>	+---
1>
1>class tagEMRPLGBLT	size(140):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| aptlDest
1>48	| xSrc
1>52	| ySrc
1>56	| cxSrc
1>60	| cySrc
1>64	| tagXFORM xformSrc
1>88	| crBkColorSrc
1>92	| iUsageSrc
1>96	| offBmiSrc
1>100	| cbBmiSrc
1>104	| offBitsSrc
1>108	| cbBitsSrc
1>112	| xMask
1>116	| yMask
1>120	| iUsageMask
1>124	| offBmiMask
1>128	| cbBmiMask
1>132	| offBitsMask
1>136	| cbBitsMask
1>	+---
1>
1>class tagEMRSETDIBITSTODEVICE	size(76):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| xDest
1>28	| yDest
1>32	| xSrc
1>36	| ySrc
1>40	| cxSrc
1>44	| cySrc
1>48	| offBmiSrc
1>52	| cbBmiSrc
1>56	| offBitsSrc
1>60	| cbBitsSrc
1>64	| iUsageSrc
1>68	| iStartScan
1>72	| cScans
1>	+---
1>
1>class tagEMRSTRETCHDIBITS	size(80):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| xDest
1>28	| yDest
1>32	| xSrc
1>36	| ySrc
1>40	| cxSrc
1>44	| cySrc
1>48	| offBmiSrc
1>52	| cbBmiSrc
1>56	| offBitsSrc
1>60	| cbBitsSrc
1>64	| iUsageSrc
1>68	| dwRop
1>72	| cxDest
1>76	| cyDest
1>	+---
1>
1>class tagEMREXTCREATEFONTINDIRECTW	size(332):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihFont
1>12	| tagEXTLOGFONTW elfw
1>	+---
1>
1>class tagEMRCREATEPALETTE	size(20):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihPal
1>12	| tagLOGPALETTE lgpl
1>	+---
1>
1>class tagEMRCREATEPEN	size(28):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihPen
1>12	| tagLOGPEN lopn
1>	+---
1>
1>class tagEMREXTCREATEPEN	size(56):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihPen
1>12	| offBmi
1>16	| cbBmi
1>20	| offBits
1>24	| cbBits
1>28	| tagEXTLOGPEN32 elp
1>	+---
1>
1>class tagEMRCREATEBRUSHINDIRECT	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihBrush
1>12	| tagLOGBRUSH32 lb
1>	+---
1>
1>class tagEMRCREATEMONOBRUSH	size(32):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihBrush
1>12	| iUsage
1>16	| offBmi
1>20	| cbBmi
1>24	| offBits
1>28	| cbBits
1>	+---
1>
1>class tagEMRCREATEDIBPATTERNBRUSHPT	size(32):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihBrush
1>12	| iUsage
1>16	| offBmi
1>20	| cbBmi
1>24	| offBits
1>28	| cbBits
1>	+---
1>
1>class tagEMRFORMAT	size(16):
1>	+---
1> 0	| dSignature
1> 4	| nVersion
1> 8	| cbData
1>12	| offData
1>	+---
1>
1>class tagEMRGLSRECORD	size(16):
1>	+---
1> 0	| tagEMR emr
1> 8	| cbData
1>12	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRGLSBOUNDEDRECORD	size(32):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| cbData
1>28	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRPIXELFORMAT	size(48):
1>	+---
1> 0	| tagEMR emr
1> 8	| tagPIXELFORMATDESCRIPTOR pfd
1>	+---
1>
1>class tagEMRCREATECOLORSPACE	size(340):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihCS
1>12	| tagLOGCOLORSPACEA lcs
1>	+---
1>
1>class tagEMRSETCOLORSPACE	size(12):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihCS
1>	+---
1>
1>class tagEMREXTESCAPE	size(20):
1>	+---
1> 0	| tagEMR emr
1> 8	| iEscape
1>12	| cbEscData
1>16	| EscData
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRNAMEDESCAPE	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| iEscape
1>12	| cbDriver
1>16	| cbEscData
1>20	| EscData
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRSETICMPROFILE	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| dwFlags
1>12	| cbName
1>16	| cbData
1>20	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagEMRCREATECOLORSPACEW	size(612):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihCS
1>12	| tagLOGCOLORSPACEW lcs
1>600	| dwFlags
1>604	| cbData
1>608	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagCOLORMATCHTOTARGET	size(28):
1>	+---
1> 0	| tagEMR emr
1> 8	| dwAction
1>12	| dwFlags
1>16	| cbName
1>20	| cbData
1>24	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagCOLORCORRECTPALETTE	size(24):
1>	+---
1> 0	| tagEMR emr
1> 8	| ihPalette
1>12	| nFirstEntry
1>16	| nPalEntries
1>20	| nReserved
1>	+---
1>
1>class tagEMRALPHABLEND	size(108):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| xDest
1>28	| yDest
1>32	| cxDest
1>36	| cyDest
1>40	| dwRop
1>44	| xSrc
1>48	| ySrc
1>52	| tagXFORM xformSrc
1>76	| crBkColorSrc
1>80	| iUsageSrc
1>84	| offBmiSrc
1>88	| cbBmiSrc
1>92	| offBitsSrc
1>96	| cbBitsSrc
1>100	| cxSrc
1>104	| cySrc
1>	+---
1>
1>class tagEMRGRADIENTFILL	size(52):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| nVer
1>28	| nTri
1>32	| ulMode
1>36	| Ver
1>	+---
1>
1>class tagEMRTRANSPARENTBLT	size(108):
1>	+---
1> 0	| tagEMR emr
1> 8	| _RECTL rclBounds
1>24	| xDest
1>28	| yDest
1>32	| cxDest
1>36	| cyDest
1>40	| dwRop
1>44	| xSrc
1>48	| ySrc
1>52	| tagXFORM xformSrc
1>76	| crBkColorSrc
1>80	| iUsageSrc
1>84	| offBmiSrc
1>88	| cbBmiSrc
1>92	| offBitsSrc
1>96	| cbBitsSrc
1>100	| cxSrc
1>104	| cySrc
1>	+---
1>
1>class _POINTFLOAT	size(8):
1>	+---
1> 0	| x
1> 4	| y
1>	+---
1>
1>class _GLYPHMETRICSFLOAT	size(24):
1>	+---
1> 0	| gmfBlackBoxX
1> 4	| gmfBlackBoxY
1> 8	| _POINTFLOAT gmfptGlyphOrigin
1>16	| gmfCellIncX
1>20	| gmfCellIncY
1>	+---
1>
1>class tagLAYERPLANEDESCRIPTOR	size(32):
1>	+---
1> 0	| nSize
1> 2	| nVersion
1> 4	| dwFlags
1> 8	| iPixelType
1> 9	| cColorBits
1>10	| cRedBits
1>11	| cRedShift
1>12	| cGreenBits
1>13	| cGreenShift
1>14	| cBlueBits
1>15	| cBlueShift
1>16	| cAlphaBits
1>17	| cAlphaShift
1>18	| cAccumBits
1>19	| cAccumRedBits
1>20	| cAccumGreenBits
1>21	| cAccumBlueBits
1>22	| cAccumAlphaBits
1>23	| cDepthBits
1>24	| cStencilBits
1>25	| cAuxBuffers
1>26	| iLayerPlane
1>27	| bReserved
1>28	| crTransparent
1>	+---
1>
1>class _WGLSWAP	size(8):
1>	+---
1> 0	| hdc
1> 4	| uiFlags
1>	+---
1>
1>class tagCBT_CREATEWNDA	size(8):
1>	+---
1> 0	| lpcs
1> 4	| hwndInsertAfter
1>	+---
1>
1>class tagCBT_CREATEWNDW	size(8):
1>	+---
1> 0	| lpcs
1> 4	| hwndInsertAfter
1>	+---
1>
1>class tagCBTACTIVATESTRUCT	size(8):
1>	+---
1> 0	| fMouse
1> 4	| hWndActive
1>	+---
1>
1>class tagWTSSESSION_NOTIFICATION	size(8):
1>	+---
1> 0	| cbSize
1> 4	| dwSessionId
1>	+---
1>
1>class <unnamed-tag>	size(20):
1>	+---
1> 0	| hwnd
1> 4	| tagRECT rc
1>	+---
1>
1>class tagEVENTMSG	size(20):
1>	+---
1> 0	| message
1> 4	| paramL
1> 8	| paramH
1>12	| time
1>16	| hwnd
1>	+---
1>
1>class tagCWPSTRUCT	size(16):
1>	+---
1> 0	| lParam
1> 4	| wParam
1> 8	| message
1>12	| hwnd
1>	+---
1>
1>class tagCWPRETSTRUCT	size(20):
1>	+---
1> 0	| lResult
1> 4	| lParam
1> 8	| wParam
1>12	| message
1>16	| hwnd
1>	+---
1>
1>class tagKBDLLHOOKSTRUCT	size(20):
1>	+---
1> 0	| vkCode
1> 4	| scanCode
1> 8	| flags
1>12	| time
1>16	| dwExtraInfo
1>	+---
1>
1>class tagMSLLHOOKSTRUCT	size(24):
1>	+---
1> 0	| tagPOINT pt
1> 8	| mouseData
1>12	| flags
1>16	| time
1>20	| dwExtraInfo
1>	+---
1>
1>class tagDEBUGHOOKINFO	size(20):
1>	+---
1> 0	| idThread
1> 4	| idThreadInstaller
1> 8	| lParam
1>12	| wParam
1>16	| code
1>	+---
1>
1>class tagMOUSEHOOKSTRUCT	size(20):
1>	+---
1> 0	| tagPOINT pt
1> 8	| hwnd
1>12	| wHitTestCode
1>16	| dwExtraInfo
1>	+---
1>
1>class tagMOUSEHOOKSTRUCTEX	size(24):
1>	+---
1> 0	| +--- (base class tagMOUSEHOOKSTRUCT)
1> 0	| | tagPOINT pt
1> 8	| | hwnd
1>12	| | wHitTestCode
1>16	| | dwExtraInfo
1>	| +---
1>20	| mouseData
1>	+---
1>
1>class tagHARDWAREHOOKSTRUCT	size(16):
1>	+---
1> 0	| hwnd
1> 4	| message
1> 8	| wParam
1>12	| lParam
1>	+---
1>
1>class tagMOUSEMOVEPOINT	size(16):
1>	+---
1> 0	| x
1> 4	| y
1> 8	| time
1>12	| dwExtraInfo
1>	+---
1>
1>class tagUSEROBJECTFLAGS	size(12):
1>	+---
1> 0	| fInherit
1> 4	| fReserved
1> 8	| dwFlags
1>	+---
1>
1>class tagWNDCLASSEXA	size(48):
1>	+---
1> 0	| cbSize
1> 4	| style
1> 8	| lpfnWndProc
1>12	| cbClsExtra
1>16	| cbWndExtra
1>20	| hInstance
1>24	| hIcon
1>28	| hCursor
1>32	| hbrBackground
1>36	| lpszMenuName
1>40	| lpszClassName
1>44	| hIconSm
1>	+---
1>
1>class tagWNDCLASSEXW	size(48):
1>	+---
1> 0	| cbSize
1> 4	| style
1> 8	| lpfnWndProc
1>12	| cbClsExtra
1>16	| cbWndExtra
1>20	| hInstance
1>24	| hIcon
1>28	| hCursor
1>32	| hbrBackground
1>36	| lpszMenuName
1>40	| lpszClassName
1>44	| hIconSm
1>	+---
1>
1>class tagWNDCLASSA	size(40):
1>	+---
1> 0	| style
1> 4	| lpfnWndProc
1> 8	| cbClsExtra
1>12	| cbWndExtra
1>16	| hInstance
1>20	| hIcon
1>24	| hCursor
1>28	| hbrBackground
1>32	| lpszMenuName
1>36	| lpszClassName
1>	+---
1>
1>class tagWNDCLASSW	size(40):
1>	+---
1> 0	| style
1> 4	| lpfnWndProc
1> 8	| cbClsExtra
1>12	| cbWndExtra
1>16	| hInstance
1>20	| hIcon
1>24	| hCursor
1>28	| hbrBackground
1>32	| lpszMenuName
1>36	| lpszClassName
1>	+---
1>
1>class tagMSG	size(28):
1>	+---
1> 0	| hwnd
1> 4	| message
1> 8	| wParam
1>12	| lParam
1>16	| time
1>20	| tagPOINT pt
1>	+---
1>
1>class tagMINMAXINFO	size(40):
1>	+---
1> 0	| tagPOINT ptReserved
1> 8	| tagPOINT ptMaxSize
1>16	| tagPOINT ptMaxPosition
1>24	| tagPOINT ptMinTrackSize
1>32	| tagPOINT ptMaxTrackSize
1>	+---
1>
1>class tagCOPYDATASTRUCT	size(12):
1>	+---
1> 0	| dwData
1> 4	| cbData
1> 8	| lpData
1>	+---
1>
1>class tagMDINEXTMENU	size(12):
1>	+---
1> 0	| hmenuIn
1> 4	| hmenuNext
1> 8	| hwndNext
1>	+---
1>
1>class <unnamed-tag>	size(24):
1>	+---
1> 0	| _GUID PowerSetting
1>16	| DataLength
1>20	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagWINDOWPOS	size(28):
1>	+---
1> 0	| hwnd
1> 4	| hwndInsertAfter
1> 8	| x
1>12	| y
1>16	| cx
1>20	| cy
1>24	| flags
1>	+---
1>
1>class tagNCCALCSIZE_PARAMS	size(52):
1>	+---
1> 0	| rgrc
1>48	| lppos
1>	+---
1>
1>class tagTRACKMOUSEEVENT	size(16):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| hwndTrack
1>12	| dwHoverTime
1>	+---
1>
1>class tagACCEL	size(6):
1>	+---
1> 0	| fVirt
1>  	| <alignment member> (size=1)
1> 2	| key
1> 4	| cmd
1>	+---
1>
1>class tagPAINTSTRUCT	size(64):
1>	+---
1> 0	| hdc
1> 4	| fErase
1> 8	| tagRECT rcPaint
1>24	| fRestore
1>28	| fIncUpdate
1>32	| rgbReserved
1>	+---
1>
1>class tagCREATESTRUCTA	size(48):
1>	+---
1> 0	| lpCreateParams
1> 4	| hInstance
1> 8	| hMenu
1>12	| hwndParent
1>16	| cy
1>20	| cx
1>24	| y
1>28	| x
1>32	| style
1>36	| lpszName
1>40	| lpszClass
1>44	| dwExStyle
1>	+---
1>
1>class tagCREATESTRUCTW	size(48):
1>	+---
1> 0	| lpCreateParams
1> 4	| hInstance
1> 8	| hMenu
1>12	| hwndParent
1>16	| cy
1>20	| cx
1>24	| y
1>28	| x
1>32	| style
1>36	| lpszName
1>40	| lpszClass
1>44	| dwExStyle
1>	+---
1>
1>class tagWINDOWPLACEMENT	size(44):
1>	+---
1> 0	| length
1> 4	| flags
1> 8	| showCmd
1>12	| tagPOINT ptMinPosition
1>20	| tagPOINT ptMaxPosition
1>28	| tagRECT rcNormalPosition
1>	+---
1>
1>class tagNMHDR	size(12):
1>	+---
1> 0	| hwndFrom
1> 4	| idFrom
1> 8	| code
1>	+---
1>
1>class tagSTYLESTRUCT	size(8):
1>	+---
1> 0	| styleOld
1> 4	| styleNew
1>	+---
1>
1>class tagMEASUREITEMSTRUCT	size(24):
1>	+---
1> 0	| CtlType
1> 4	| CtlID
1> 8	| itemID
1>12	| itemWidth
1>16	| itemHeight
1>20	| itemData
1>	+---
1>
1>class tagDRAWITEMSTRUCT	size(48):
1>	+---
1> 0	| CtlType
1> 4	| CtlID
1> 8	| itemID
1>12	| itemAction
1>16	| itemState
1>20	| hwndItem
1>24	| hDC
1>28	| tagRECT rcItem
1>44	| itemData
1>	+---
1>
1>class tagDELETEITEMSTRUCT	size(20):
1>	+---
1> 0	| CtlType
1> 4	| CtlID
1> 8	| itemID
1>12	| hwndItem
1>16	| itemData
1>	+---
1>
1>class tagCOMPAREITEMSTRUCT	size(32):
1>	+---
1> 0	| CtlType
1> 4	| CtlID
1> 8	| hwndItem
1>12	| itemID1
1>16	| itemData1
1>20	| itemID2
1>24	| itemData2
1>28	| dwLocaleId
1>	+---
1>
1>class <unnamed-tag>	size(20):
1>	+---
1> 0	| cbSize
1> 4	| hdesk
1> 8	| hwnd
1>12	| _LUID luid
1>	+---
1>
1>class tagUPDATELAYEREDWINDOWINFO	size(40):
1>	+---
1> 0	| cbSize
1> 4	| hdcDst
1> 8	| pptDst
1>12	| psize
1>16	| hdcSrc
1>20	| pptSrc
1>24	| crKey
1>28	| pblend
1>32	| dwFlags
1>36	| prcDirty
1>	+---
1>
1>class <unnamed-tag>	size(20):
1>	+---
1> 0	| cbSize
1> 4	| hwnd
1> 8	| dwFlags
1>12	| uCount
1>16	| dwTimeout
1>	+---
1>
1>class <unnamed-tag>	size(18):
1>	+---
1> 0	| style
1> 4	| dwExtendedStyle
1> 8	| cdit
1>10	| x
1>12	| y
1>14	| cx
1>16	| cy
1>	+---
1>
1>class <unnamed-tag>	size(18):
1>	+---
1> 0	| style
1> 4	| dwExtendedStyle
1> 8	| x
1>10	| y
1>12	| cx
1>14	| cy
1>16	| id
1>	+---
1>
1>class _ENUM_FLAG_SIZED_INTEGER<enum DIALOG_CONTROL_DPI_CHANGE_BEHAVIORS>	size(1):
1>	+---
1>	+---
1>
1>class _ENUM_FLAG_SIZED_INTEGER<enum DIALOG_DPI_CHANGE_BEHAVIORS>	size(1):
1>	+---
1>	+---
1>
1>class tagMOUSEINPUT	size(24):
1>	+---
1> 0	| dx
1> 4	| dy
1> 8	| mouseData
1>12	| dwFlags
1>16	| time
1>20	| dwExtraInfo
1>	+---
1>
1>class tagKEYBDINPUT	size(16):
1>	+---
1> 0	| wVk
1> 2	| wScan
1> 4	| dwFlags
1> 8	| time
1>12	| dwExtraInfo
1>	+---
1>
1>class tagHARDWAREINPUT	size(8):
1>	+---
1> 0	| uMsg
1> 4	| wParamL
1> 6	| wParamH
1>	+---
1>
1>class tagINPUT::<unnamed-tag>	size(24):
1>	+---
1> 0	| tagMOUSEINPUT mi
1> 0	| tagKEYBDINPUT ki
1> 0	| tagHARDWAREINPUT hi
1>	+---
1>
1>class tagINPUT	size(28):
1>	+---
1> 0	| type
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| tagMOUSEINPUT mi
1> 4	| tagKEYBDINPUT ki
1> 4	| tagHARDWAREINPUT hi
1>	+---
1>
1>class HTOUCHINPUT__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class tagTOUCHINPUT	size(40):
1>	+---
1> 0	| x
1> 4	| y
1> 8	| hSource
1>12	| dwID
1>16	| dwFlags
1>20	| dwMask
1>24	| dwTime
1>28	| dwExtraInfo
1>32	| cxContact
1>36	| cyContact
1>	+---
1>
1>class tagPOINTER_INFO	size(88):
1>	+---
1> 0	| pointerType
1> 4	| pointerId
1> 8	| frameId
1>12	| pointerFlags
1>16	| sourceDevice
1>20	| hwndTarget
1>24	| tagPOINT ptPixelLocation
1>32	| tagPOINT ptHimetricLocation
1>40	| tagPOINT ptPixelLocationRaw
1>48	| tagPOINT ptHimetricLocationRaw
1>56	| dwTime
1>60	| historyCount
1>64	| InputData
1>68	| dwKeyStates
1>72	| PerformanceCount
1>80	| tagPOINTER_BUTTON_CHANGE_TYPE ButtonChangeType
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class tagPOINTER_TOUCH_INFO	size(136):
1>	+---
1> 0	| tagPOINTER_INFO pointerInfo
1>88	| touchFlags
1>92	| touchMask
1>96	| tagRECT rcContact
1>112	| tagRECT rcContactRaw
1>128	| orientation
1>132	| pressure
1>	+---
1>
1>class tagPOINTER_PEN_INFO	size(112):
1>	+---
1> 0	| tagPOINTER_INFO pointerInfo
1>88	| penFlags
1>92	| penMask
1>96	| pressure
1>100	| rotation
1>104	| tiltX
1>108	| tiltY
1>	+---
1>
1>class tagUSAGE_PROPERTIES	size(32):
1>	+---
1> 0	| level
1> 2	| page
1> 4	| usage
1>  	| <alignment member> (size=2)
1> 8	| logicalMinimum
1>12	| logicalMaximum
1>16	| unit
1>18	| exponent
1>20	| count
1>  	| <alignment member> (size=3)
1>24	| physicalMinimum
1>28	| physicalMaximum
1>	+---
1>
1>class tagPOINTER_TYPE_INFO::<unnamed-tag>	size(136):
1>	+---
1> 0	| tagPOINTER_TOUCH_INFO touchInfo
1> 0	| tagPOINTER_PEN_INFO penInfo
1>	+---
1>
1>class tagPOINTER_TYPE_INFO	size(144):
1>	+---
1> 0	| type
1>  	| <alignment member> (size=4)
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| tagPOINTER_TOUCH_INFO touchInfo
1> 8	| tagPOINTER_PEN_INFO penInfo
1>	+---
1>
1>class tagINPUT_INJECTION_VALUE	size(12):
1>	+---
1> 0	| page
1> 2	| usage
1> 4	| value
1> 8	| index
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class tagTOUCH_HIT_TESTING_PROXIMITY_EVALUATION	size(12):
1>	+---
1> 0	| score
1>  	| <alignment member> (size=2)
1> 4	| tagPOINT adjustedPoint
1>	+---
1>
1>class tagTOUCH_HIT_TESTING_INPUT	size(48):
1>	+---
1> 0	| pointerId
1> 4	| tagPOINT point
1>12	| tagRECT boundingBox
1>28	| tagRECT nonOccludedBoundingBox
1>44	| orientation
1>	+---
1>
1>class tagINPUT_TRANSFORM::<unnamed-tag>::<unnamed-tag>	size(64):
1>	+---
1> 0	| _11
1> 4	| _12
1> 8	| _13
1>12	| _14
1>16	| _21
1>20	| _22
1>24	| _23
1>28	| _24
1>32	| _31
1>36	| _32
1>40	| _33
1>44	| _34
1>48	| _41
1>52	| _42
1>56	| _43
1>60	| _44
1>	+---
1>
1>class tagINPUT_TRANSFORM::<unnamed-tag>	size(64):
1>	+---
1> 0	| _11
1> 4	| _12
1> 8	| _13
1>12	| _14
1>16	| _21
1>20	| _22
1>24	| _23
1>28	| _24
1>32	| _31
1>36	| _32
1>40	| _33
1>44	| _34
1>48	| _41
1>52	| _42
1>56	| _43
1>60	| _44
1> 0	| m
1>	+---
1>
1>class tagINPUT_TRANSFORM	size(64):
1>	+---
1> 0	| _11
1> 4	| _12
1> 8	| _13
1>12	| _14
1>16	| _21
1>20	| _22
1>24	| _23
1>28	| _24
1>32	| _31
1>36	| _32
1>40	| _33
1>44	| _34
1>48	| _41
1>52	| _42
1>56	| _43
1>60	| _44
1> 0	| m
1>	+---
1>
1>class tagLASTINPUTINFO	size(8):
1>	+---
1> 0	| cbSize
1> 4	| dwTime
1>	+---
1>
1>class tagTPMPARAMS	size(20):
1>	+---
1> 0	| cbSize
1> 4	| tagRECT rcExclude
1>	+---
1>
1>class tagMENUINFO	size(28):
1>	+---
1> 0	| cbSize
1> 4	| fMask
1> 8	| dwStyle
1>12	| cyMax
1>16	| hbrBack
1>20	| dwContextHelpID
1>24	| dwMenuData
1>	+---
1>
1>class tagMENUGETOBJECTINFO	size(20):
1>	+---
1> 0	| dwFlags
1> 4	| uPos
1> 8	| hmenu
1>12	| riid
1>16	| pvObj
1>	+---
1>
1>class tagMENUITEMINFOA	size(48):
1>	+---
1> 0	| cbSize
1> 4	| fMask
1> 8	| fType
1>12	| fState
1>16	| wID
1>20	| hSubMenu
1>24	| hbmpChecked
1>28	| hbmpUnchecked
1>32	| dwItemData
1>36	| dwTypeData
1>40	| cch
1>44	| hbmpItem
1>	+---
1>
1>class tagMENUITEMINFOW	size(48):
1>	+---
1> 0	| cbSize
1> 4	| fMask
1> 8	| fType
1>12	| fState
1>16	| wID
1>20	| hSubMenu
1>24	| hbmpChecked
1>28	| hbmpUnchecked
1>32	| dwItemData
1>36	| dwTypeData
1>40	| cch
1>44	| hbmpItem
1>	+---
1>
1>class tagDROPSTRUCT	size(28):
1>	+---
1> 0	| hwndSource
1> 4	| hwndSink
1> 8	| wFmt
1>12	| dwData
1>16	| tagPOINT ptDrop
1>24	| dwControlData
1>	+---
1>
1>class tagDRAWTEXTPARAMS	size(20):
1>	+---
1> 0	| cbSize
1> 4	| iTabLength
1> 8	| iLeftMargin
1>12	| iRightMargin
1>16	| uiLengthDrawn
1>	+---
1>
1>class tagHELPINFO	size(28):
1>	+---
1> 0	| cbSize
1> 4	| iContextType
1> 8	| iCtrlId
1>12	| hItemHandle
1>16	| dwContextId
1>20	| tagPOINT MousePos
1>	+---
1>
1>class tagMSGBOXPARAMSA	size(40):
1>	+---
1> 0	| cbSize
1> 4	| hwndOwner
1> 8	| hInstance
1>12	| lpszText
1>16	| lpszCaption
1>20	| dwStyle
1>24	| lpszIcon
1>28	| dwContextHelpId
1>32	| lpfnMsgBoxCallback
1>36	| dwLanguageId
1>	+---
1>
1>class tagMSGBOXPARAMSW	size(40):
1>	+---
1> 0	| cbSize
1> 4	| hwndOwner
1> 8	| hInstance
1>12	| lpszText
1>16	| lpszCaption
1>20	| dwStyle
1>24	| lpszIcon
1>28	| dwContextHelpId
1>32	| lpfnMsgBoxCallback
1>36	| dwLanguageId
1>	+---
1>
1>class <unnamed-tag>	size(4):
1>	+---
1> 0	| versionNumber
1> 2	| offset
1>	+---
1>
1>class <unnamed-tag>	size(6):
1>	+---
1> 0	| mtOption
1> 2	| mtID
1> 4	| mtString
1>	+---
1>
1>class _ICONINFO	size(20):
1>	+---
1> 0	| fIcon
1> 4	| xHotspot
1> 8	| yHotspot
1>12	| hbmMask
1>16	| hbmColor
1>	+---
1>
1>class tagCURSORSHAPE	size(24):
1>	+---
1> 0	| xHotSpot
1> 4	| yHotSpot
1> 8	| cx
1>12	| cy
1>16	| cbWidth
1>20	| Planes
1>21	| BitsPixel
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _ICONINFOEXA	size(548):
1>	+---
1> 0	| cbSize
1> 4	| fIcon
1> 8	| xHotspot
1>12	| yHotspot
1>16	| hbmMask
1>20	| hbmColor
1>24	| wResID
1>26	| szModName
1>286	| szResName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _ICONINFOEXW	size(1068):
1>	+---
1> 0	| cbSize
1> 4	| fIcon
1> 8	| xHotspot
1>12	| yHotspot
1>16	| hbmMask
1>20	| hbmColor
1>24	| wResID
1>26	| szModName
1>546	| szResName
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class tagSCROLLINFO	size(28):
1>	+---
1> 0	| cbSize
1> 4	| fMask
1> 8	| nMin
1>12	| nMax
1>16	| nPage
1>20	| nPos
1>24	| nTrackPos
1>	+---
1>
1>class tagMDICREATESTRUCTA	size(36):
1>	+---
1> 0	| szClass
1> 4	| szTitle
1> 8	| hOwner
1>12	| x
1>16	| y
1>20	| cx
1>24	| cy
1>28	| style
1>32	| lParam
1>	+---
1>
1>class tagMDICREATESTRUCTW	size(36):
1>	+---
1> 0	| szClass
1> 4	| szTitle
1> 8	| hOwner
1>12	| x
1>16	| y
1>20	| cx
1>24	| cy
1>28	| style
1>32	| lParam
1>	+---
1>
1>class tagCLIENTCREATESTRUCT	size(8):
1>	+---
1> 0	| hWindowMenu
1> 4	| idFirstChild
1>	+---
1>
1>class tagMULTIKEYHELPA	size(8):
1>	+---
1> 0	| mkSize
1> 4	| mkKeylist
1> 5	| szKeyphrase
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class tagMULTIKEYHELPW	size(8):
1>	+---
1> 0	| mkSize
1> 4	| mkKeylist
1> 6	| szKeyphrase
1>	+---
1>
1>class tagHELPWININFOA	size(28):
1>	+---
1> 0	| wStructSize
1> 4	| x
1> 8	| y
1>12	| dx
1>16	| dy
1>20	| wMax
1>24	| rgchMember
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class tagHELPWININFOW	size(28):
1>	+---
1> 0	| wStructSize
1> 4	| x
1> 8	| y
1>12	| dx
1>16	| dy
1>20	| wMax
1>24	| rgchMember
1>	+---
1>
1>class tagTouchPredictionParameters	size(16):
1>	+---
1> 0	| cbSize
1> 4	| dwLatency
1> 8	| dwSampleTime
1>12	| bUseHWTimeStamp
1>	+---
1>
1>class tagNONCLIENTMETRICSA	size(344):
1>	+---
1> 0	| cbSize
1> 4	| iBorderWidth
1> 8	| iScrollWidth
1>12	| iScrollHeight
1>16	| iCaptionWidth
1>20	| iCaptionHeight
1>24	| tagLOGFONTA lfCaptionFont
1>84	| iSmCaptionWidth
1>88	| iSmCaptionHeight
1>92	| tagLOGFONTA lfSmCaptionFont
1>152	| iMenuWidth
1>156	| iMenuHeight
1>160	| tagLOGFONTA lfMenuFont
1>220	| tagLOGFONTA lfStatusFont
1>280	| tagLOGFONTA lfMessageFont
1>340	| iPaddedBorderWidth
1>	+---
1>
1>class tagNONCLIENTMETRICSW	size(504):
1>	+---
1> 0	| cbSize
1> 4	| iBorderWidth
1> 8	| iScrollWidth
1>12	| iScrollHeight
1>16	| iCaptionWidth
1>20	| iCaptionHeight
1>24	| tagLOGFONTW lfCaptionFont
1>116	| iSmCaptionWidth
1>120	| iSmCaptionHeight
1>124	| tagLOGFONTW lfSmCaptionFont
1>216	| iMenuWidth
1>220	| iMenuHeight
1>224	| tagLOGFONTW lfMenuFont
1>316	| tagLOGFONTW lfStatusFont
1>408	| tagLOGFONTW lfMessageFont
1>500	| iPaddedBorderWidth
1>	+---
1>
1>class tagMINIMIZEDMETRICS	size(20):
1>	+---
1> 0	| cbSize
1> 4	| iWidth
1> 8	| iHorzGap
1>12	| iVertGap
1>16	| iArrange
1>	+---
1>
1>class tagICONMETRICSA	size(76):
1>	+---
1> 0	| cbSize
1> 4	| iHorzSpacing
1> 8	| iVertSpacing
1>12	| iTitleWrap
1>16	| tagLOGFONTA lfFont
1>	+---
1>
1>class tagICONMETRICSW	size(108):
1>	+---
1> 0	| cbSize
1> 4	| iHorzSpacing
1> 8	| iVertSpacing
1>12	| iTitleWrap
1>16	| tagLOGFONTW lfFont
1>	+---
1>
1>class tagANIMATIONINFO	size(8):
1>	+---
1> 0	| cbSize
1> 4	| iMinAnimate
1>	+---
1>
1>class tagSERIALKEYSA	size(28):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| lpszActivePort
1>12	| lpszPort
1>16	| iBaudRate
1>20	| iPortState
1>24	| iActive
1>	+---
1>
1>class tagSERIALKEYSW	size(28):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| lpszActivePort
1>12	| lpszPort
1>16	| iBaudRate
1>20	| iPortState
1>24	| iActive
1>	+---
1>
1>class tagHIGHCONTRASTA	size(12):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| lpszDefaultScheme
1>	+---
1>
1>class tagHIGHCONTRASTW	size(12):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| lpszDefaultScheme
1>	+---
1>
1>class _VIDEOPARAMETERS	size(356):
1>	+---
1> 0	| _GUID Guid
1>16	| dwOffset
1>20	| dwCommand
1>24	| dwFlags
1>28	| dwMode
1>32	| dwTVStandard
1>36	| dwAvailableModes
1>40	| dwAvailableTVStandard
1>44	| dwFlickerFilter
1>48	| dwOverScanX
1>52	| dwOverScanY
1>56	| dwMaxUnscaledX
1>60	| dwMaxUnscaledY
1>64	| dwPositionX
1>68	| dwPositionY
1>72	| dwBrightness
1>76	| dwContrast
1>80	| dwCPType
1>84	| dwCPCommand
1>88	| dwCPStandard
1>92	| dwCPKey
1>96	| bCP_APSTriggerBits
1>100	| bOEMCopyProtection
1>	+---
1>
1>class tagFILTERKEYS	size(24):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| iWaitMSec
1>12	| iDelayMSec
1>16	| iRepeatMSec
1>20	| iBounceMSec
1>	+---
1>
1>class tagSTICKYKEYS	size(8):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1>	+---
1>
1>class tagMOUSEKEYS	size(28):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| iMaxSpeed
1>12	| iTimeToMaxSpeed
1>16	| iCtrlSpeed
1>20	| dwReserved1
1>24	| dwReserved2
1>	+---
1>
1>class tagACCESSTIMEOUT	size(12):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| iTimeOutMSec
1>	+---
1>
1>class tagSOUNDSENTRYA	size(48):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| iFSTextEffect
1>12	| iFSTextEffectMSec
1>16	| iFSTextEffectColorBits
1>20	| iFSGrafEffect
1>24	| iFSGrafEffectMSec
1>28	| iFSGrafEffectColor
1>32	| iWindowsEffect
1>36	| iWindowsEffectMSec
1>40	| lpszWindowsEffectDLL
1>44	| iWindowsEffectOrdinal
1>	+---
1>
1>class tagSOUNDSENTRYW	size(48):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| iFSTextEffect
1>12	| iFSTextEffectMSec
1>16	| iFSTextEffectColorBits
1>20	| iFSGrafEffect
1>24	| iFSGrafEffectMSec
1>28	| iFSGrafEffectColor
1>32	| iWindowsEffect
1>36	| iWindowsEffectMSec
1>40	| lpszWindowsEffectDLL
1>44	| iWindowsEffectOrdinal
1>	+---
1>
1>class tagTOGGLEKEYS	size(8):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1>	+---
1>
1>class tagAUDIODESCRIPTION	size(12):
1>	+---
1> 0	| cbSize
1> 4	| Enabled
1> 8	| Locale
1>	+---
1>
1>class tagMONITORINFO	size(40):
1>	+---
1> 0	| cbSize
1> 4	| tagRECT rcMonitor
1>20	| tagRECT rcWork
1>36	| dwFlags
1>	+---
1>
1>class tagMONITORINFOEXA	size(72):
1>	+---
1> 0	| +--- (base class tagMONITORINFO)
1> 0	| | cbSize
1> 4	| | tagRECT rcMonitor
1>20	| | tagRECT rcWork
1>36	| | dwFlags
1>	| +---
1>40	| szDevice
1>	+---
1>
1>class tagMONITORINFOEXW	size(104):
1>	+---
1> 0	| +--- (base class tagMONITORINFO)
1> 0	| | cbSize
1> 4	| | tagRECT rcMonitor
1>20	| | tagRECT rcWork
1>36	| | dwFlags
1>	| +---
1>40	| szDevice
1>	+---
1>
1>class tagGUITHREADINFO	size(48):
1>	+---
1> 0	| cbSize
1> 4	| flags
1> 8	| hwndActive
1>12	| hwndFocus
1>16	| hwndCapture
1>20	| hwndMenuOwner
1>24	| hwndMoveSize
1>28	| hwndCaret
1>32	| tagRECT rcCaret
1>	+---
1>
1>class tagCURSORINFO	size(20):
1>	+---
1> 0	| cbSize
1> 4	| flags
1> 8	| hCursor
1>12	| tagPOINT ptScreenPos
1>	+---
1>
1>class tagWINDOWINFO	size(60):
1>	+---
1> 0	| cbSize
1> 4	| tagRECT rcWindow
1>20	| tagRECT rcClient
1>36	| dwStyle
1>40	| dwExStyle
1>44	| dwWindowStatus
1>48	| cxWindowBorders
1>52	| cyWindowBorders
1>56	| atomWindowType
1>58	| wCreatorVersion
1>	+---
1>
1>class tagTITLEBARINFO	size(44):
1>	+---
1> 0	| cbSize
1> 4	| tagRECT rcTitleBar
1>20	| rgstate
1>	+---
1>
1>class tagTITLEBARINFOEX	size(140):
1>	+---
1> 0	| cbSize
1> 4	| tagRECT rcTitleBar
1>20	| rgstate
1>44	| rgrect
1>	+---
1>
1>class tagMENUBARINFO	size(32):
1>	+---
1> 0	| cbSize
1> 4	| tagRECT rcBar
1>20	| hMenu
1>24	| hwndMenu
1>28.	| fBarFocused (bitstart=0,nbits=1)
1>28.	| fFocused (bitstart=1,nbits=1)
1>	+---
1>
1>class tagSCROLLBARINFO	size(60):
1>	+---
1> 0	| cbSize
1> 4	| tagRECT rcScrollBar
1>20	| dxyLineButton
1>24	| xyThumbTop
1>28	| xyThumbBottom
1>32	| reserved
1>36	| rgstate
1>	+---
1>
1>class tagCOMBOBOXINFO	size(52):
1>	+---
1> 0	| cbSize
1> 4	| tagRECT rcItem
1>20	| tagRECT rcButton
1>36	| stateButton
1>40	| hwndCombo
1>44	| hwndItem
1>48	| hwndList
1>	+---
1>
1>class tagALTTABINFO	size(40):
1>	+---
1> 0	| cbSize
1> 4	| cItems
1> 8	| cColumns
1>12	| cRows
1>16	| iColFocus
1>20	| iRowFocus
1>24	| cxItem
1>28	| cyItem
1>32	| tagPOINT ptStart
1>	+---
1>
1>class HRAWINPUT__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class tagRAWINPUTHEADER	size(16):
1>	+---
1> 0	| dwType
1> 4	| dwSize
1> 8	| hDevice
1>12	| wParam
1>	+---
1>
1>class tagRAWMOUSE::<unnamed-tag>::<unnamed-tag>	size(4):
1>	+---
1> 0	| usButtonFlags
1> 2	| usButtonData
1>	+---
1>
1>class tagRAWMOUSE::<unnamed-tag>	size(4):
1>	+---
1> 0	| ulButtons
1> 0	| usButtonFlags
1> 2	| usButtonData
1>	+---
1>
1>class tagRAWMOUSE	size(24):
1>	+---
1> 0	| usFlags
1>  	| <alignment member> (size=2)
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| ulButtons
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 4	| usButtonFlags
1> 6	| usButtonData
1>  	| <unnamed-tag> <alignment member> (size=4)
1> 8	| ulRawButtons
1>12	| lLastX
1>16	| lLastY
1>20	| ulExtraInformation
1>	+---
1>
1>class tagRAWKEYBOARD	size(16):
1>	+---
1> 0	| MakeCode
1> 2	| Flags
1> 4	| Reserved
1> 6	| VKey
1> 8	| Message
1>12	| ExtraInformation
1>	+---
1>
1>class tagRAWHID	size(12):
1>	+---
1> 0	| dwSizeHid
1> 4	| dwCount
1> 8	| bRawData
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class tagRAWINPUT::<unnamed-tag>	size(24):
1>	+---
1> 0	| tagRAWMOUSE mouse
1> 0	| tagRAWKEYBOARD keyboard
1> 0	| tagRAWHID hid
1>	+---
1>
1>class tagRAWINPUT	size(40):
1>	+---
1> 0	| tagRAWINPUTHEADER header
1>16	| <unnamed-type-data> data
1>	+---
1>
1>class tagRID_DEVICE_INFO_MOUSE	size(16):
1>	+---
1> 0	| dwId
1> 4	| dwNumberOfButtons
1> 8	| dwSampleRate
1>12	| fHasHorizontalWheel
1>	+---
1>
1>class tagRID_DEVICE_INFO_KEYBOARD	size(24):
1>	+---
1> 0	| dwType
1> 4	| dwSubType
1> 8	| dwKeyboardMode
1>12	| dwNumberOfFunctionKeys
1>16	| dwNumberOfIndicators
1>20	| dwNumberOfKeysTotal
1>	+---
1>
1>class tagRID_DEVICE_INFO_HID	size(16):
1>	+---
1> 0	| dwVendorId
1> 4	| dwProductId
1> 8	| dwVersionNumber
1>12	| usUsagePage
1>14	| usUsage
1>	+---
1>
1>class tagRID_DEVICE_INFO::<unnamed-tag>	size(24):
1>	+---
1> 0	| tagRID_DEVICE_INFO_MOUSE mouse
1> 0	| tagRID_DEVICE_INFO_KEYBOARD keyboard
1> 0	| tagRID_DEVICE_INFO_HID hid
1>	+---
1>
1>class tagRID_DEVICE_INFO	size(32):
1>	+---
1> 0	| cbSize
1> 4	| dwType
1>  	| <unnamed-tag> <alignment member> (size=8)
1> 8	| tagRID_DEVICE_INFO_MOUSE mouse
1> 8	| tagRID_DEVICE_INFO_KEYBOARD keyboard
1> 8	| tagRID_DEVICE_INFO_HID hid
1>	+---
1>
1>class tagRAWINPUTDEVICE	size(12):
1>	+---
1> 0	| usUsagePage
1> 2	| usUsage
1> 4	| dwFlags
1> 8	| hwndTarget
1>	+---
1>
1>class tagRAWINPUTDEVICELIST	size(8):
1>	+---
1> 0	| hDevice
1> 4	| dwType
1>	+---
1>
1>class tagPOINTER_DEVICE_INFO	size(1064):
1>	+---
1> 0	| displayOrientation
1> 4	| device
1> 8	| tagPOINTER_DEVICE_TYPE pointerDeviceType
1>12	| monitor
1>16	| startingCursorId
1>20	| maxActiveContacts
1>22	| productString
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class tagPOINTER_DEVICE_PROPERTY	size(28):
1>	+---
1> 0	| logicalMin
1> 4	| logicalMax
1> 8	| physicalMin
1>12	| physicalMax
1>16	| unit
1>20	| unitExponent
1>24	| usagePageId
1>26	| usageId
1>	+---
1>
1>class tagPOINTER_DEVICE_CURSOR_INFO	size(8):
1>	+---
1> 0	| cursorId
1> 4	| tagPOINTER_DEVICE_CURSOR_TYPE cursor
1>	+---
1>
1>class tagCHANGEFILTERSTRUCT	size(8):
1>	+---
1> 0	| cbSize
1> 4	| ExtStatus
1>	+---
1>
1>class HGESTUREINFO__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class tagGESTUREINFO	size(48):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| dwID
1>12	| hwndTarget
1>16	| tagPOINTS ptsLocation
1>20	| dwInstanceID
1>24	| dwSequenceID
1>  	| <alignment member> (size=4)
1>32	| ullArguments
1>40	| cbExtraArgs
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class tagGESTURENOTIFYSTRUCT	size(20):
1>	+---
1> 0	| cbSize
1> 4	| dwFlags
1> 8	| hwndTarget
1>12	| tagPOINTS ptsLocation
1>16	| dwInstanceID
1>	+---
1>
1>class tagGESTURECONFIG	size(12):
1>	+---
1> 0	| dwID
1> 4	| dwWant
1> 8	| dwBlock
1>	+---
1>
1>class tagINPUT_MESSAGE_SOURCE	size(8):
1>	+---
1> 0	| tagINPUT_MESSAGE_DEVICE_TYPE deviceType
1> 4	| tagINPUT_MESSAGE_ORIGIN_ID originId
1>	+---
1>
1>class _ENUM_FLAG_SIZED_INTEGER<enum tagAR_STATE>	size(1):
1>	+---
1>	+---
1>
1>class _ENUM_FLAG_SIZED_INTEGER<enum ORIENTATION_PREFERENCE>	size(1):
1>	+---
1>	+---
1>
1>class _cpinfo	size(20):
1>	+---
1> 0	| MaxCharSize
1> 4	| DefaultChar
1> 6	| LeadByte
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class _cpinfoexA	size(284):
1>	+---
1> 0	| MaxCharSize
1> 4	| DefaultChar
1> 6	| LeadByte
1>18	| UnicodeDefaultChar
1>20	| CodePage
1>24	| CodePageName
1>	+---
1>
1>class _cpinfoexW	size(544):
1>	+---
1> 0	| MaxCharSize
1> 4	| DefaultChar
1> 6	| LeadByte
1>18	| UnicodeDefaultChar
1>20	| CodePage
1>24	| CodePageName
1>	+---
1>
1>class _numberfmtA	size(24):
1>	+---
1> 0	| NumDigits
1> 4	| LeadingZero
1> 8	| Grouping
1>12	| lpDecimalSep
1>16	| lpThousandSep
1>20	| NegativeOrder
1>	+---
1>
1>class _numberfmtW	size(24):
1>	+---
1> 0	| NumDigits
1> 4	| LeadingZero
1> 8	| Grouping
1>12	| lpDecimalSep
1>16	| lpThousandSep
1>20	| NegativeOrder
1>	+---
1>
1>class _currencyfmtA	size(32):
1>	+---
1> 0	| NumDigits
1> 4	| LeadingZero
1> 8	| Grouping
1>12	| lpDecimalSep
1>16	| lpThousandSep
1>20	| NegativeOrder
1>24	| PositiveOrder
1>28	| lpCurrencySymbol
1>	+---
1>
1>class _currencyfmtW	size(32):
1>	+---
1> 0	| NumDigits
1> 4	| LeadingZero
1> 8	| Grouping
1>12	| lpDecimalSep
1>16	| lpThousandSep
1>20	| NegativeOrder
1>24	| PositiveOrder
1>28	| lpCurrencySymbol
1>	+---
1>
1>class _nlsversioninfo	size(32):
1>	+---
1> 0	| dwNLSVersionInfoSize
1> 4	| dwNLSVersion
1> 8	| dwDefinedVersion
1>12	| dwEffectiveId
1>16	| _GUID guidCustomVersion
1>	+---
1>
1>class _nlsversioninfoex	size(32):
1>	+---
1> 0	| dwNLSVersionInfoSize
1> 4	| dwNLSVersion
1> 8	| dwDefinedVersion
1>12	| dwEffectiveId
1>16	| _GUID guidCustomVersion
1>	+---
1>
1>class _FILEMUIINFO	size(80):
1>	+---
1> 0	| dwSize
1> 4	| dwVersion
1> 8	| dwFileType
1>12	| pChecksum
1>28	| pServiceChecksum
1>44	| dwLanguageNameOffset
1>48	| dwTypeIDMainSize
1>52	| dwTypeIDMainOffset
1>56	| dwTypeNameMainOffset
1>60	| dwTypeIDMUISize
1>64	| dwTypeIDMUIOffset
1>68	| dwTypeNameMUIOffset
1>72	| abBuffer
1>	+---
1>
1>class _COORD	size(4):
1>	+---
1> 0	| X
1> 2	| Y
1>	+---
1>
1>class _SMALL_RECT	size(8):
1>	+---
1> 0	| Left
1> 2	| Top
1> 4	| Right
1> 6	| Bottom
1>	+---
1>
1>class _KEY_EVENT_RECORD::<unnamed-tag>	size(2):
1>	+---
1> 0	| UnicodeChar
1> 0	| AsciiChar
1>	+---
1>
1>class _KEY_EVENT_RECORD	size(16):
1>	+---
1> 0	| bKeyDown
1> 4	| wRepeatCount
1> 6	| wVirtualKeyCode
1> 8	| wVirtualScanCode
1>10	| <unnamed-type-uChar> uChar
1>12	| dwControlKeyState
1>	+---
1>
1>class _MOUSE_EVENT_RECORD	size(16):
1>	+---
1> 0	| _COORD dwMousePosition
1> 4	| dwButtonState
1> 8	| dwControlKeyState
1>12	| dwEventFlags
1>	+---
1>
1>class _WINDOW_BUFFER_SIZE_RECORD	size(4):
1>	+---
1> 0	| _COORD dwSize
1>	+---
1>
1>class _MENU_EVENT_RECORD	size(4):
1>	+---
1> 0	| dwCommandId
1>	+---
1>
1>class _FOCUS_EVENT_RECORD	size(4):
1>	+---
1> 0	| bSetFocus
1>	+---
1>
1>class _INPUT_RECORD::<unnamed-tag>	size(16):
1>	+---
1> 0	| _KEY_EVENT_RECORD KeyEvent
1> 0	| _MOUSE_EVENT_RECORD MouseEvent
1> 0	| _WINDOW_BUFFER_SIZE_RECORD WindowBufferSizeEvent
1> 0	| _MENU_EVENT_RECORD MenuEvent
1> 0	| _FOCUS_EVENT_RECORD FocusEvent
1>	+---
1>
1>class _INPUT_RECORD	size(20):
1>	+---
1> 0	| EventType
1>  	| <alignment member> (size=2)
1> 4	| <unnamed-type-Event> Event
1>	+---
1>
1>class _CHAR_INFO::<unnamed-tag>	size(2):
1>	+---
1> 0	| UnicodeChar
1> 0	| AsciiChar
1>	+---
1>
1>class _CHAR_INFO	size(4):
1>	+---
1> 0	| <unnamed-type-Char> Char
1> 2	| Attributes
1>	+---
1>
1>class _CONSOLE_SCREEN_BUFFER_INFO	size(22):
1>	+---
1> 0	| _COORD dwSize
1> 4	| _COORD dwCursorPosition
1> 8	| wAttributes
1>10	| _SMALL_RECT srWindow
1>18	| _COORD dwMaximumWindowSize
1>	+---
1>
1>class _CONSOLE_SCREEN_BUFFER_INFOEX	size(96):
1>	+---
1> 0	| cbSize
1> 4	| _COORD dwSize
1> 8	| _COORD dwCursorPosition
1>12	| wAttributes
1>14	| _SMALL_RECT srWindow
1>22	| _COORD dwMaximumWindowSize
1>26	| wPopupAttributes
1>28	| bFullscreenSupported
1>32	| ColorTable
1>	+---
1>
1>class _CONSOLE_CURSOR_INFO	size(8):
1>	+---
1> 0	| dwSize
1> 4	| bVisible
1>	+---
1>
1>class _CONSOLE_FONT_INFO	size(8):
1>	+---
1> 0	| nFont
1> 4	| _COORD dwFontSize
1>	+---
1>
1>class _CONSOLE_FONT_INFOEX	size(84):
1>	+---
1> 0	| cbSize
1> 4	| nFont
1> 8	| _COORD dwFontSize
1>12	| FontFamily
1>16	| FontWeight
1>20	| FaceName
1>	+---
1>
1>class _CONSOLE_HISTORY_INFO	size(16):
1>	+---
1> 0	| cbSize
1> 4	| HistoryBufferSize
1> 8	| NumberOfHistoryBuffers
1>12	| dwFlags
1>	+---
1>
1>class _CONSOLE_SELECTION_INFO	size(16):
1>	+---
1> 0	| dwFlags
1> 4	| _COORD dwSelectionAnchor
1> 8	| _SMALL_RECT srSelection
1>	+---
1>
1>class _CONSOLE_READCONSOLE_CONTROL	size(16):
1>	+---
1> 0	| nLength
1> 4	| nInitialChars
1> 8	| dwCtrlWakeupMask
1>12	| dwControlKeyState
1>	+---
1>
1>class tagVS_FIXEDFILEINFO	size(52):
1>	+---
1> 0	| dwSignature
1> 4	| dwStrucVersion
1> 8	| dwFileVersionMS
1>12	| dwFileVersionLS
1>16	| dwProductVersionMS
1>20	| dwProductVersionLS
1>24	| dwFileFlagsMask
1>28	| dwFileFlags
1>32	| dwFileOS
1>36	| dwFileType
1>40	| dwFileSubtype
1>44	| dwFileDateMS
1>48	| dwFileDateLS
1>	+---
1>
1>class val_context	size(12):
1>	+---
1> 0	| valuelen
1> 4	| value_context
1> 8	| val_buff_ptr
1>	+---
1>
1>class pvalueA	size(16):
1>	+---
1> 0	| pv_valuename
1> 4	| pv_valuelen
1> 8	| pv_value_context
1>12	| pv_type
1>	+---
1>
1>class pvalueW	size(16):
1>	+---
1> 0	| pv_valuename
1> 4	| pv_valuelen
1> 8	| pv_value_context
1>12	| pv_type
1>	+---
1>
1>class provider_info	size(24):
1>	+---
1> 0	| pi_R0_1val
1> 4	| pi_R0_allvals
1> 8	| pi_R3_1val
1>12	| pi_R3_allvals
1>16	| pi_flags
1>20	| pi_key_context
1>	+---
1>
1>class value_entA	size(16):
1>	+---
1> 0	| ve_valuename
1> 4	| ve_valuelen
1> 8	| ve_valueptr
1>12	| ve_type
1>	+---
1>
1>class value_entW	size(16):
1>	+---
1> 0	| ve_valuename
1> 4	| ve_valuelen
1> 8	| ve_valueptr
1>12	| ve_type
1>	+---
1>
1>class _NETRESOURCEA	size(32):
1>	+---
1> 0	| dwScope
1> 4	| dwType
1> 8	| dwDisplayType
1>12	| dwUsage
1>16	| lpLocalName
1>20	| lpRemoteName
1>24	| lpComment
1>28	| lpProvider
1>	+---
1>
1>class _NETRESOURCEW	size(32):
1>	+---
1> 0	| dwScope
1> 4	| dwType
1> 8	| dwDisplayType
1>12	| dwUsage
1>16	| lpLocalName
1>20	| lpRemoteName
1>24	| lpComment
1>28	| lpProvider
1>	+---
1>
1>class _CONNECTDLGSTRUCTA	size(20):
1>	+---
1> 0	| cbStructure
1> 4	| hwndOwner
1> 8	| lpConnRes
1>12	| dwFlags
1>16	| dwDevNum
1>	+---
1>
1>class _CONNECTDLGSTRUCTW	size(20):
1>	+---
1> 0	| cbStructure
1> 4	| hwndOwner
1> 8	| lpConnRes
1>12	| dwFlags
1>16	| dwDevNum
1>	+---
1>
1>class _DISCDLGSTRUCTA	size(20):
1>	+---
1> 0	| cbStructure
1> 4	| hwndOwner
1> 8	| lpLocalName
1>12	| lpRemoteName
1>16	| dwFlags
1>	+---
1>
1>class _DISCDLGSTRUCTW	size(20):
1>	+---
1> 0	| cbStructure
1> 4	| hwndOwner
1> 8	| lpLocalName
1>12	| lpRemoteName
1>16	| dwFlags
1>	+---
1>
1>class _UNIVERSAL_NAME_INFOA	size(4):
1>	+---
1> 0	| lpUniversalName
1>	+---
1>
1>class _UNIVERSAL_NAME_INFOW	size(4):
1>	+---
1> 0	| lpUniversalName
1>	+---
1>
1>class _REMOTE_NAME_INFOA	size(12):
1>	+---
1> 0	| lpUniversalName
1> 4	| lpConnectionName
1> 8	| lpRemainingPath
1>	+---
1>
1>class _REMOTE_NAME_INFOW	size(12):
1>	+---
1> 0	| lpUniversalName
1> 4	| lpConnectionName
1> 8	| lpRemainingPath
1>	+---
1>
1>class _NETINFOSTRUCT	size(32):
1>	+---
1> 0	| cbStructure
1> 4	| dwProviderVersion
1> 8	| dwStatus
1>12	| dwCharacteristics
1>16	| dwHandle
1>20	| wNetType
1>  	| <alignment member> (size=2)
1>24	| dwPrinters
1>28	| dwDrives
1>	+---
1>
1>class _NETCONNECTINFOSTRUCT	size(20):
1>	+---
1> 0	| cbStructure
1> 4	| dwFlags
1> 8	| dwSpeed
1>12	| dwDelay
1>16	| dwOptDataSize
1>	+---
1>
1>class <unnamed-tag>	size(8):
1>	+---
1> 0	| Data
1>	+---
1>
1>class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM::<unnamed-tag>::<unnamed-tag>	size(8):
1>	+---
1> 0	| DataOffset
1> 4	| Data
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM::<unnamed-tag>	size(8):
1>	+---
1> 0	| SERVICE_TRIGGER_CUSTOM_STATE_ID CustomStateId
1> 0	| <unnamed-type-s> s
1>	+---
1>
1>class _SERVICE_CUSTOM_SYSTEM_STATE_CHANGE_DATA_ITEM	size(8):
1>	+---
1> 0	| <unnamed-type-u> u
1>	+---
1>
1>class _SERVICE_DESCRIPTIONA	size(4):
1>	+---
1> 0	| lpDescription
1>	+---
1>
1>class _SERVICE_DESCRIPTIONW	size(4):
1>	+---
1> 0	| lpDescription
1>	+---
1>
1>class _SC_ACTION	size(8):
1>	+---
1> 0	| _SC_ACTION_TYPE Type
1> 4	| Delay
1>	+---
1>
1>class _SERVICE_FAILURE_ACTIONSA	size(20):
1>	+---
1> 0	| dwResetPeriod
1> 4	| lpRebootMsg
1> 8	| lpCommand
1>12	| cActions
1>16	| lpsaActions
1>	+---
1>
1>class _SERVICE_FAILURE_ACTIONSW	size(20):
1>	+---
1> 0	| dwResetPeriod
1> 4	| lpRebootMsg
1> 8	| lpCommand
1>12	| cActions
1>16	| lpsaActions
1>	+---
1>
1>class _SERVICE_DELAYED_AUTO_START_INFO	size(4):
1>	+---
1> 0	| fDelayedAutostart
1>	+---
1>
1>class _SERVICE_FAILURE_ACTIONS_FLAG	size(4):
1>	+---
1> 0	| fFailureActionsOnNonCrashFailures
1>	+---
1>
1>class _SERVICE_SID_INFO	size(4):
1>	+---
1> 0	| dwServiceSidType
1>	+---
1>
1>class _SERVICE_REQUIRED_PRIVILEGES_INFOA	size(4):
1>	+---
1> 0	| pmszRequiredPrivileges
1>	+---
1>
1>class _SERVICE_REQUIRED_PRIVILEGES_INFOW	size(4):
1>	+---
1> 0	| pmszRequiredPrivileges
1>	+---
1>
1>class _SERVICE_PRESHUTDOWN_INFO	size(4):
1>	+---
1> 0	| dwPreshutdownTimeout
1>	+---
1>
1>class _SERVICE_TRIGGER_SPECIFIC_DATA_ITEM	size(12):
1>	+---
1> 0	| dwDataType
1> 4	| cbData
1> 8	| pData
1>	+---
1>
1>class _SERVICE_TRIGGER	size(20):
1>	+---
1> 0	| dwTriggerType
1> 4	| dwAction
1> 8	| pTriggerSubtype
1>12	| cDataItems
1>16	| pDataItems
1>	+---
1>
1>class _SERVICE_TRIGGER_INFO	size(12):
1>	+---
1> 0	| cTriggers
1> 4	| pTriggers
1> 8	| pReserved
1>	+---
1>
1>class _SERVICE_PREFERRED_NODE_INFO	size(4):
1>	+---
1> 0	| usPreferredNode
1> 2	| fDelete
1>  	| <alignment member> (size=1)
1>	+---
1>
1>class _SERVICE_TIMECHANGE_INFO	size(16):
1>	+---
1> 0	| _LARGE_INTEGER liNewTime
1> 8	| _LARGE_INTEGER liOldTime
1>	+---
1>
1>class _SERVICE_LAUNCH_PROTECTED_INFO	size(4):
1>	+---
1> 0	| dwLaunchProtected
1>	+---
1>
1>class SC_HANDLE__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class SERVICE_STATUS_HANDLE__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class _SERVICE_STATUS	size(28):
1>	+---
1> 0	| dwServiceType
1> 4	| dwCurrentState
1> 8	| dwControlsAccepted
1>12	| dwWin32ExitCode
1>16	| dwServiceSpecificExitCode
1>20	| dwCheckPoint
1>24	| dwWaitHint
1>	+---
1>
1>class _SERVICE_STATUS_PROCESS	size(36):
1>	+---
1> 0	| dwServiceType
1> 4	| dwCurrentState
1> 8	| dwControlsAccepted
1>12	| dwWin32ExitCode
1>16	| dwServiceSpecificExitCode
1>20	| dwCheckPoint
1>24	| dwWaitHint
1>28	| dwProcessId
1>32	| dwServiceFlags
1>	+---
1>
1>class _ENUM_SERVICE_STATUSA	size(36):
1>	+---
1> 0	| lpServiceName
1> 4	| lpDisplayName
1> 8	| _SERVICE_STATUS ServiceStatus
1>	+---
1>
1>class _ENUM_SERVICE_STATUSW	size(36):
1>	+---
1> 0	| lpServiceName
1> 4	| lpDisplayName
1> 8	| _SERVICE_STATUS ServiceStatus
1>	+---
1>
1>class _ENUM_SERVICE_STATUS_PROCESSA	size(44):
1>	+---
1> 0	| lpServiceName
1> 4	| lpDisplayName
1> 8	| _SERVICE_STATUS_PROCESS ServiceStatusProcess
1>	+---
1>
1>class _ENUM_SERVICE_STATUS_PROCESSW	size(44):
1>	+---
1> 0	| lpServiceName
1> 4	| lpDisplayName
1> 8	| _SERVICE_STATUS_PROCESS ServiceStatusProcess
1>	+---
1>
1>class _QUERY_SERVICE_LOCK_STATUSA	size(12):
1>	+---
1> 0	| fIsLocked
1> 4	| lpLockOwner
1> 8	| dwLockDuration
1>	+---
1>
1>class _QUERY_SERVICE_LOCK_STATUSW	size(12):
1>	+---
1> 0	| fIsLocked
1> 4	| lpLockOwner
1> 8	| dwLockDuration
1>	+---
1>
1>class _QUERY_SERVICE_CONFIGA	size(36):
1>	+---
1> 0	| dwServiceType
1> 4	| dwStartType
1> 8	| dwErrorControl
1>12	| lpBinaryPathName
1>16	| lpLoadOrderGroup
1>20	| dwTagId
1>24	| lpDependencies
1>28	| lpServiceStartName
1>32	| lpDisplayName
1>	+---
1>
1>class _QUERY_SERVICE_CONFIGW	size(36):
1>	+---
1> 0	| dwServiceType
1> 4	| dwStartType
1> 8	| dwErrorControl
1>12	| lpBinaryPathName
1>16	| lpLoadOrderGroup
1>20	| dwTagId
1>24	| lpDependencies
1>28	| lpServiceStartName
1>32	| lpDisplayName
1>	+---
1>
1>class _SERVICE_TABLE_ENTRYA	size(8):
1>	+---
1> 0	| lpServiceName
1> 4	| lpServiceProc
1>	+---
1>
1>class _SERVICE_TABLE_ENTRYW	size(8):
1>	+---
1> 0	| lpServiceName
1> 4	| lpServiceProc
1>	+---
1>
1>class _SERVICE_NOTIFY_1	size(52):
1>	+---
1> 0	| dwVersion
1> 4	| pfnNotifyCallback
1> 8	| pContext
1>12	| dwNotificationStatus
1>16	| _SERVICE_STATUS_PROCESS ServiceStatus
1>	+---
1>
1>class _SERVICE_NOTIFY_2A	size(60):
1>	+---
1> 0	| dwVersion
1> 4	| pfnNotifyCallback
1> 8	| pContext
1>12	| dwNotificationStatus
1>16	| _SERVICE_STATUS_PROCESS ServiceStatus
1>52	| dwNotificationTriggered
1>56	| pszServiceNames
1>	+---
1>
1>class _SERVICE_NOTIFY_2W	size(60):
1>	+---
1> 0	| dwVersion
1> 4	| pfnNotifyCallback
1> 8	| pContext
1>12	| dwNotificationStatus
1>16	| _SERVICE_STATUS_PROCESS ServiceStatus
1>52	| dwNotificationTriggered
1>56	| pszServiceNames
1>	+---
1>
1>class _SERVICE_CONTROL_STATUS_REASON_PARAMSA	size(44):
1>	+---
1> 0	| dwReason
1> 4	| pszComment
1> 8	| _SERVICE_STATUS_PROCESS ServiceStatus
1>	+---
1>
1>class _SERVICE_CONTROL_STATUS_REASON_PARAMSW	size(44):
1>	+---
1> 0	| dwReason
1> 4	| pszComment
1> 8	| _SERVICE_STATUS_PROCESS ServiceStatus
1>	+---
1>
1>class _SERVICE_START_REASON	size(4):
1>	+---
1> 0	| dwReason
1>	+---
1>
1>class _MODEMDEVCAPS	size(80):
1>	+---
1> 0	| dwActualSize
1> 4	| dwRequiredSize
1> 8	| dwDevSpecificOffset
1>12	| dwDevSpecificSize
1>16	| dwModemProviderVersion
1>20	| dwModemManufacturerOffset
1>24	| dwModemManufacturerSize
1>28	| dwModemModelOffset
1>32	| dwModemModelSize
1>36	| dwModemVersionOffset
1>40	| dwModemVersionSize
1>44	| dwDialOptions
1>48	| dwCallSetupFailTimer
1>52	| dwInactivityTimeout
1>56	| dwSpeakerVolume
1>60	| dwSpeakerMode
1>64	| dwModemOptions
1>68	| dwMaxDTERate
1>72	| dwMaxDCERate
1>76	| abVariablePortion
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class _MODEMSETTINGS	size(48):
1>	+---
1> 0	| dwActualSize
1> 4	| dwRequiredSize
1> 8	| dwDevSpecificOffset
1>12	| dwDevSpecificSize
1>16	| dwCallSetupFailTimer
1>20	| dwInactivityTimeout
1>24	| dwSpeakerVolume
1>28	| dwSpeakerMode
1>32	| dwPreferredModemOptions
1>36	| dwNegotiatedModemOptions
1>40	| dwNegotiatedDCERate
1>44	| abVariablePortion
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class HIMC__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class HIMCC__	size(4):
1>	+---
1> 0	| unused
1>	+---
1>
1>class tagCOMPOSITIONFORM	size(28):
1>	+---
1> 0	| dwStyle
1> 4	| tagPOINT ptCurrentPos
1>12	| tagRECT rcArea
1>	+---
1>
1>class tagCANDIDATEFORM	size(32):
1>	+---
1> 0	| dwIndex
1> 4	| dwStyle
1> 8	| tagPOINT ptCurrentPos
1>16	| tagRECT rcArea
1>	+---
1>
1>class tagCANDIDATELIST	size(28):
1>	+---
1> 0	| dwSize
1> 4	| dwStyle
1> 8	| dwCount
1>12	| dwSelection
1>16	| dwPageStart
1>20	| dwPageSize
1>24	| dwOffset
1>	+---
1>
1>class tagREGISTERWORDA	size(8):
1>	+---
1> 0	| lpReading
1> 4	| lpWord
1>	+---
1>
1>class tagREGISTERWORDW	size(8):
1>	+---
1> 0	| lpReading
1> 4	| lpWord
1>	+---
1>
1>class tagRECONVERTSTRING	size(32):
1>	+---
1> 0	| dwSize
1> 4	| dwVersion
1> 8	| dwStrLen
1>12	| dwStrOffset
1>16	| dwCompStrLen
1>20	| dwCompStrOffset
1>24	| dwTargetStrLen
1>28	| dwTargetStrOffset
1>	+---
1>
1>class tagSTYLEBUFA	size(36):
1>	+---
1> 0	| dwStyle
1> 4	| szDescription
1>	+---
1>
1>class tagSTYLEBUFW	size(68):
1>	+---
1> 0	| dwStyle
1> 4	| szDescription
1>	+---
1>
1>class tagIMEMENUITEMINFOA	size(112):
1>	+---
1> 0	| cbSize
1> 4	| fType
1> 8	| fState
1>12	| wID
1>16	| hbmpChecked
1>20	| hbmpUnchecked
1>24	| dwItemData
1>28	| szString
1>108	| hbmpItem
1>	+---
1>
1>class tagIMEMENUITEMINFOW	size(192):
1>	+---
1> 0	| cbSize
1> 4	| fType
1> 8	| fState
1>12	| wID
1>16	| hbmpChecked
1>20	| hbmpUnchecked
1>24	| dwItemData
1>28	| szString
1>188	| hbmpItem
1>	+---
1>
1>class tagIMECHARPOSITION	size(36):
1>	+---
1> 0	| dwSize
1> 4	| dwCharPos
1> 8	| tagPOINT pt
1>16	| cLineHeight
1>20	| tagRECT rcDocument
1>	+---
1>
1>class CSteamID::SteamID_t::SteamIDComponent_t	size(8):
1>	+---
1> 0.	| m_unAccountID (bitstart=0,nbits=32)
1> 4.	| m_unAccountInstance (bitstart=0,nbits=20)
1> 4.	| m_EAccountType (bitstart=20,nbits=4)
1> 4.	| EUniverse m_EUniverse (bitstart=24,nbits=8)
1>	+---
1>
1>class CSteamID::SteamID_t	size(8):
1>	+---
1> 0	| SteamIDComponent_t m_comp
1> 0	| m_unAll64Bits
1>	+---
1>
1>class CSteamID	size(8):
1>	+---
1> 0	| SteamID_t m_steamid
1>	+---
1>
1>class CGameID::GameID_t	size(8):
1>	+---
1> 0.	| m_nAppID (bitstart=0,nbits=24)
1> 0.	| m_nType (bitstart=24,nbits=8)
1> 4.	| m_nModID (bitstart=0,nbits=32)
1>	+---
1>
1>class CGameID::<unnamed-tag>	size(8):
1>	+---
1> 0	| m_ulGameID
1> 0	| GameID_t m_gameID
1>	+---
1>
1>class CGameID	size(8):
1>	+---
1> 0	| m_ulGameID
1> 0	| GameID_t m_gameID
1>	+---
1>
1>class ValvePackingSentinel_t	size(32):
1>	+---
1> 0	| m_u32
1>  	| <alignment member> (size=4)
1> 8	| m_u64
1>16	| m_u16
1>  	| <alignment member> (size=6)
1>24	| m_d
1>	+---
1>
1>class ISteamClient	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamClient::$vftable@:
1>	| &ISteamClient_meta
1>	|  0
1> 0	| &ISteamClient::CreateSteamPipe
1> 1	| &ISteamClient::BReleaseSteamPipe
1> 2	| &ISteamClient::ConnectToGlobalUser
1> 3	| &ISteamClient::CreateLocalUser
1> 4	| &ISteamClient::ReleaseUser
1> 5	| &ISteamClient::GetISteamUser
1> 6	| &ISteamClient::GetISteamGameServer
1> 7	| &ISteamClient::SetLocalIPBinding
1> 8	| &ISteamClient::GetISteamFriends
1> 9	| &ISteamClient::GetISteamUtils
1>10	| &ISteamClient::GetISteamMatchmaking
1>11	| &ISteamClient::GetISteamMatchmakingServers
1>12	| &ISteamClient::GetISteamGenericInterface
1>13	| &ISteamClient::GetISteamUserStats
1>14	| &ISteamClient::GetISteamGameServerStats
1>15	| &ISteamClient::GetISteamApps
1>16	| &ISteamClient::GetISteamNetworking
1>17	| &ISteamClient::GetISteamRemoteStorage
1>18	| &ISteamClient::GetISteamScreenshots
1>19	| &ISteamClient::RunFrame
1>20	| &ISteamClient::GetIPCCallCount
1>21	| &ISteamClient::SetWarningMessageHook
1>22	| &ISteamClient::BShutdownIfAllPipesClosed
1>23	| &ISteamClient::GetISteamHTTP
1>24	| &ISteamClient::DEPRECATED_GetISteamUnifiedMessages
1>25	| &ISteamClient::GetISteamController
1>26	| &ISteamClient::GetISteamUGC
1>27	| &ISteamClient::GetISteamAppList
1>28	| &ISteamClient::GetISteamMusic
1>29	| &ISteamClient::GetISteamMusicRemote
1>30	| &ISteamClient::GetISteamHTMLSurface
1>31	| &ISteamClient::DEPRECATED_Set_SteamAPI_CPostAPIResultInProcess
1>32	| &ISteamClient::DEPRECATED_Remove_SteamAPI_CPostAPIResultInProcess
1>33	| &ISteamClient::Set_SteamAPI_CCheckCallbackRegisteredInProcess
1>34	| &ISteamClient::GetISteamInventory
1>35	| &ISteamClient::GetISteamVideo
1>36	| &ISteamClient::GetISteamParentalSettings
1>
1>ISteamClient::CreateSteamPipe this adjustor: 0
1>ISteamClient::BReleaseSteamPipe this adjustor: 0
1>ISteamClient::ConnectToGlobalUser this adjustor: 0
1>ISteamClient::CreateLocalUser this adjustor: 0
1>ISteamClient::ReleaseUser this adjustor: 0
1>ISteamClient::GetISteamUser this adjustor: 0
1>ISteamClient::GetISteamGameServer this adjustor: 0
1>ISteamClient::SetLocalIPBinding this adjustor: 0
1>ISteamClient::GetISteamFriends this adjustor: 0
1>ISteamClient::GetISteamUtils this adjustor: 0
1>ISteamClient::GetISteamMatchmaking this adjustor: 0
1>ISteamClient::GetISteamMatchmakingServers this adjustor: 0
1>ISteamClient::GetISteamGenericInterface this adjustor: 0
1>ISteamClient::GetISteamUserStats this adjustor: 0
1>ISteamClient::GetISteamGameServerStats this adjustor: 0
1>ISteamClient::GetISteamApps this adjustor: 0
1>ISteamClient::GetISteamNetworking this adjustor: 0
1>ISteamClient::GetISteamRemoteStorage this adjustor: 0
1>ISteamClient::GetISteamScreenshots this adjustor: 0
1>ISteamClient::RunFrame this adjustor: 0
1>ISteamClient::GetIPCCallCount this adjustor: 0
1>ISteamClient::SetWarningMessageHook this adjustor: 0
1>ISteamClient::BShutdownIfAllPipesClosed this adjustor: 0
1>ISteamClient::GetISteamHTTP this adjustor: 0
1>ISteamClient::DEPRECATED_GetISteamUnifiedMessages this adjustor: 0
1>ISteamClient::GetISteamController this adjustor: 0
1>ISteamClient::GetISteamUGC this adjustor: 0
1>ISteamClient::GetISteamAppList this adjustor: 0
1>ISteamClient::GetISteamMusic this adjustor: 0
1>ISteamClient::GetISteamMusicRemote this adjustor: 0
1>ISteamClient::GetISteamHTMLSurface this adjustor: 0
1>ISteamClient::DEPRECATED_Set_SteamAPI_CPostAPIResultInProcess this adjustor: 0
1>ISteamClient::DEPRECATED_Remove_SteamAPI_CPostAPIResultInProcess this adjustor: 0
1>ISteamClient::Set_SteamAPI_CCheckCallbackRegisteredInProcess this adjustor: 0
1>ISteamClient::GetISteamInventory this adjustor: 0
1>ISteamClient::GetISteamVideo this adjustor: 0
1>ISteamClient::GetISteamParentalSettings this adjustor: 0
1>
1>class CallbackMsg_t	size(16):
1>	+---
1> 0	| m_hSteamUser
1> 4	| m_iCallback
1> 8	| m_pubParam
1>12	| m_cubParam
1>	+---
1>
1>class ISteamUser	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamUser::$vftable@:
1>	| &ISteamUser_meta
1>	|  0
1> 0	| &ISteamUser::GetHSteamUser
1> 1	| &ISteamUser::BLoggedOn
1> 2	| &ISteamUser::GetSteamID
1> 3	| &ISteamUser::InitiateGameConnection
1> 4	| &ISteamUser::TerminateGameConnection
1> 5	| &ISteamUser::TrackAppUsageEvent
1> 6	| &ISteamUser::GetUserDataFolder
1> 7	| &ISteamUser::StartVoiceRecording
1> 8	| &ISteamUser::StopVoiceRecording
1> 9	| &ISteamUser::GetAvailableVoice
1>10	| &ISteamUser::GetVoice
1>11	| &ISteamUser::DecompressVoice
1>12	| &ISteamUser::GetVoiceOptimalSampleRate
1>13	| &ISteamUser::GetAuthSessionTicket
1>14	| &ISteamUser::BeginAuthSession
1>15	| &ISteamUser::EndAuthSession
1>16	| &ISteamUser::CancelAuthTicket
1>17	| &ISteamUser::UserHasLicenseForApp
1>18	| &ISteamUser::BIsBehindNAT
1>19	| &ISteamUser::AdvertiseGame
1>20	| &ISteamUser::RequestEncryptedAppTicket
1>21	| &ISteamUser::GetEncryptedAppTicket
1>22	| &ISteamUser::GetGameBadgeLevel
1>23	| &ISteamUser::GetPlayerSteamLevel
1>24	| &ISteamUser::RequestStoreAuthURL
1>25	| &ISteamUser::BIsPhoneVerified
1>26	| &ISteamUser::BIsTwoFactorEnabled
1>27	| &ISteamUser::BIsPhoneIdentifying
1>28	| &ISteamUser::BIsPhoneRequiringVerification
1>
1>ISteamUser::GetHSteamUser this adjustor: 0
1>ISteamUser::BLoggedOn this adjustor: 0
1>ISteamUser::GetSteamID this adjustor: 0
1>ISteamUser::InitiateGameConnection this adjustor: 0
1>ISteamUser::TerminateGameConnection this adjustor: 0
1>ISteamUser::TrackAppUsageEvent this adjustor: 0
1>ISteamUser::GetUserDataFolder this adjustor: 0
1>ISteamUser::StartVoiceRecording this adjustor: 0
1>ISteamUser::StopVoiceRecording this adjustor: 0
1>ISteamUser::GetAvailableVoice this adjustor: 0
1>ISteamUser::GetVoice this adjustor: 0
1>ISteamUser::DecompressVoice this adjustor: 0
1>ISteamUser::GetVoiceOptimalSampleRate this adjustor: 0
1>ISteamUser::GetAuthSessionTicket this adjustor: 0
1>ISteamUser::BeginAuthSession this adjustor: 0
1>ISteamUser::EndAuthSession this adjustor: 0
1>ISteamUser::CancelAuthTicket this adjustor: 0
1>ISteamUser::UserHasLicenseForApp this adjustor: 0
1>ISteamUser::BIsBehindNAT this adjustor: 0
1>ISteamUser::AdvertiseGame this adjustor: 0
1>ISteamUser::RequestEncryptedAppTicket this adjustor: 0
1>ISteamUser::GetEncryptedAppTicket this adjustor: 0
1>ISteamUser::GetGameBadgeLevel this adjustor: 0
1>ISteamUser::GetPlayerSteamLevel this adjustor: 0
1>ISteamUser::RequestStoreAuthURL this adjustor: 0
1>ISteamUser::BIsPhoneVerified this adjustor: 0
1>ISteamUser::BIsTwoFactorEnabled this adjustor: 0
1>ISteamUser::BIsPhoneIdentifying this adjustor: 0
1>ISteamUser::BIsPhoneRequiringVerification this adjustor: 0
1>
1>class SteamServersConnected_t	size(1):
1>	+---
1>	+---
1>
1>class SteamServerConnectFailure_t	size(8):
1>	+---
1> 0	| EResult m_eResult
1> 4	| m_bStillRetrying
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class SteamServersDisconnected_t	size(4):
1>	+---
1> 0	| EResult m_eResult
1>	+---
1>
1>class ClientGameServerDeny_t	size(16):
1>	+---
1> 0	| m_uAppID
1> 4	| m_unGameServerIP
1> 8	| m_usGameServerPort
1>10	| m_bSecure
1>12	| m_uReason
1>	+---
1>
1>class IPCFailure_t	size(1):
1>	+---
1> 0	| m_eFailureType
1>	+---
1>
1>class LicensesUpdated_t	size(1):
1>	+---
1>	+---
1>
1>class ValidateAuthTicketResponse_t	size(20):
1>	+---
1> 0	| CSteamID m_SteamID
1> 8	| EAuthSessionResponse m_eAuthSessionResponse
1>12	| CSteamID m_OwnerSteamID
1>	+---
1>
1>class MicroTxnAuthorizationResponse_t	size(24):
1>	+---
1> 0	| m_unAppID
1>  	| <alignment member> (size=4)
1> 8	| m_ulOrderID
1>16	| m_bAuthorized
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class EncryptedAppTicketResponse_t	size(4):
1>	+---
1> 0	| EResult m_eResult
1>	+---
1>
1>class GetAuthSessionTicketResponse_t	size(8):
1>	+---
1> 0	| m_hAuthTicket
1> 4	| EResult m_eResult
1>	+---
1>
1>class GameWebCallback_t	size(256):
1>	+---
1> 0	| m_szURL
1>	+---
1>
1>class StoreAuthURLResponse_t	size(512):
1>	+---
1> 0	| m_szURL
1>	+---
1>
1>class FriendGameInfo_t	size(24):
1>	+---
1> 0	| CGameID m_gameID
1> 8	| m_unGameIP
1>12	| m_usGamePort
1>14	| m_usQueryPort
1>16	| CSteamID m_steamIDLobby
1>	+---
1>
1>class FriendSessionStateInfo_t	size(8):
1>	+---
1> 0	| m_uiOnlineSessionInstances
1> 4	| m_uiPublishedToFriendsSessionInstance
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class ISteamFriends	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamFriends::$vftable@:
1>	| &ISteamFriends_meta
1>	|  0
1> 0	| &ISteamFriends::GetPersonaName
1> 1	| &ISteamFriends::SetPersonaName
1> 2	| &ISteamFriends::GetPersonaState
1> 3	| &ISteamFriends::GetFriendCount
1> 4	| &ISteamFriends::GetFriendByIndex
1> 5	| &ISteamFriends::GetFriendRelationship
1> 6	| &ISteamFriends::GetFriendPersonaState
1> 7	| &ISteamFriends::GetFriendPersonaName
1> 8	| &ISteamFriends::GetFriendGamePlayed
1> 9	| &ISteamFriends::GetFriendPersonaNameHistory
1>10	| &ISteamFriends::GetFriendSteamLevel
1>11	| &ISteamFriends::GetPlayerNickname
1>12	| &ISteamFriends::GetFriendsGroupCount
1>13	| &ISteamFriends::GetFriendsGroupIDByIndex
1>14	| &ISteamFriends::GetFriendsGroupName
1>15	| &ISteamFriends::GetFriendsGroupMembersCount
1>16	| &ISteamFriends::GetFriendsGroupMembersList
1>17	| &ISteamFriends::HasFriend
1>18	| &ISteamFriends::GetClanCount
1>19	| &ISteamFriends::GetClanByIndex
1>20	| &ISteamFriends::GetClanName
1>21	| &ISteamFriends::GetClanTag
1>22	| &ISteamFriends::GetClanActivityCounts
1>23	| &ISteamFriends::DownloadClanActivityCounts
1>24	| &ISteamFriends::GetFriendCountFromSource
1>25	| &ISteamFriends::GetFriendFromSourceByIndex
1>26	| &ISteamFriends::IsUserInSource
1>27	| &ISteamFriends::SetInGameVoiceSpeaking
1>28	| &ISteamFriends::ActivateGameOverlay
1>29	| &ISteamFriends::ActivateGameOverlayToUser
1>30	| &ISteamFriends::ActivateGameOverlayToWebPage
1>31	| &ISteamFriends::ActivateGameOverlayToStore
1>32	| &ISteamFriends::SetPlayedWith
1>33	| &ISteamFriends::ActivateGameOverlayInviteDialog
1>34	| &ISteamFriends::GetSmallFriendAvatar
1>35	| &ISteamFriends::GetMediumFriendAvatar
1>36	| &ISteamFriends::GetLargeFriendAvatar
1>37	| &ISteamFriends::RequestUserInformation
1>38	| &ISteamFriends::RequestClanOfficerList
1>39	| &ISteamFriends::GetClanOwner
1>40	| &ISteamFriends::GetClanOfficerCount
1>41	| &ISteamFriends::GetClanOfficerByIndex
1>42	| &ISteamFriends::GetUserRestrictions
1>43	| &ISteamFriends::SetRichPresence
1>44	| &ISteamFriends::ClearRichPresence
1>45	| &ISteamFriends::GetFriendRichPresence
1>46	| &ISteamFriends::GetFriendRichPresenceKeyCount
1>47	| &ISteamFriends::GetFriendRichPresenceKeyByIndex
1>48	| &ISteamFriends::RequestFriendRichPresence
1>49	| &ISteamFriends::InviteUserToGame
1>50	| &ISteamFriends::GetCoplayFriendCount
1>51	| &ISteamFriends::GetCoplayFriend
1>52	| &ISteamFriends::GetFriendCoplayTime
1>53	| &ISteamFriends::GetFriendCoplayGame
1>54	| &ISteamFriends::JoinClanChatRoom
1>55	| &ISteamFriends::LeaveClanChatRoom
1>56	| &ISteamFriends::GetClanChatMemberCount
1>57	| &ISteamFriends::GetChatMemberByIndex
1>58	| &ISteamFriends::SendClanChatMessage
1>59	| &ISteamFriends::GetClanChatMessage
1>60	| &ISteamFriends::IsClanChatAdmin
1>61	| &ISteamFriends::IsClanChatWindowOpenInSteam
1>62	| &ISteamFriends::OpenClanChatWindowInSteam
1>63	| &ISteamFriends::CloseClanChatWindowInSteam
1>64	| &ISteamFriends::SetListenForFriendsMessages
1>65	| &ISteamFriends::ReplyToFriendMessage
1>66	| &ISteamFriends::GetFriendMessage
1>67	| &ISteamFriends::GetFollowerCount
1>68	| &ISteamFriends::IsFollowing
1>69	| &ISteamFriends::EnumerateFollowingList
1>70	| &ISteamFriends::IsClanPublic
1>71	| &ISteamFriends::IsClanOfficialGameGroup
1>
1>ISteamFriends::GetPersonaName this adjustor: 0
1>ISteamFriends::SetPersonaName this adjustor: 0
1>ISteamFriends::GetPersonaState this adjustor: 0
1>ISteamFriends::GetFriendCount this adjustor: 0
1>ISteamFriends::GetFriendByIndex this adjustor: 0
1>ISteamFriends::GetFriendRelationship this adjustor: 0
1>ISteamFriends::GetFriendPersonaState this adjustor: 0
1>ISteamFriends::GetFriendPersonaName this adjustor: 0
1>ISteamFriends::GetFriendGamePlayed this adjustor: 0
1>ISteamFriends::GetFriendPersonaNameHistory this adjustor: 0
1>ISteamFriends::GetFriendSteamLevel this adjustor: 0
1>ISteamFriends::GetPlayerNickname this adjustor: 0
1>ISteamFriends::GetFriendsGroupCount this adjustor: 0
1>ISteamFriends::GetFriendsGroupIDByIndex this adjustor: 0
1>ISteamFriends::GetFriendsGroupName this adjustor: 0
1>ISteamFriends::GetFriendsGroupMembersCount this adjustor: 0
1>ISteamFriends::GetFriendsGroupMembersList this adjustor: 0
1>ISteamFriends::HasFriend this adjustor: 0
1>ISteamFriends::GetClanCount this adjustor: 0
1>ISteamFriends::GetClanByIndex this adjustor: 0
1>ISteamFriends::GetClanName this adjustor: 0
1>ISteamFriends::GetClanTag this adjustor: 0
1>ISteamFriends::GetClanActivityCounts this adjustor: 0
1>ISteamFriends::DownloadClanActivityCounts this adjustor: 0
1>ISteamFriends::GetFriendCountFromSource this adjustor: 0
1>ISteamFriends::GetFriendFromSourceByIndex this adjustor: 0
1>ISteamFriends::IsUserInSource this adjustor: 0
1>ISteamFriends::SetInGameVoiceSpeaking this adjustor: 0
1>ISteamFriends::ActivateGameOverlay this adjustor: 0
1>ISteamFriends::ActivateGameOverlayToUser this adjustor: 0
1>ISteamFriends::ActivateGameOverlayToWebPage this adjustor: 0
1>ISteamFriends::ActivateGameOverlayToStore this adjustor: 0
1>ISteamFriends::SetPlayedWith this adjustor: 0
1>ISteamFriends::ActivateGameOverlayInviteDialog this adjustor: 0
1>ISteamFriends::GetSmallFriendAvatar this adjustor: 0
1>ISteamFriends::GetMediumFriendAvatar this adjustor: 0
1>ISteamFriends::GetLargeFriendAvatar this adjustor: 0
1>ISteamFriends::RequestUserInformation this adjustor: 0
1>ISteamFriends::RequestClanOfficerList this adjustor: 0
1>ISteamFriends::GetClanOwner this adjustor: 0
1>ISteamFriends::GetClanOfficerCount this adjustor: 0
1>ISteamFriends::GetClanOfficerByIndex this adjustor: 0
1>ISteamFriends::GetUserRestrictions this adjustor: 0
1>ISteamFriends::SetRichPresence this adjustor: 0
1>ISteamFriends::ClearRichPresence this adjustor: 0
1>ISteamFriends::GetFriendRichPresence this adjustor: 0
1>ISteamFriends::GetFriendRichPresenceKeyCount this adjustor: 0
1>ISteamFriends::GetFriendRichPresenceKeyByIndex this adjustor: 0
1>ISteamFriends::RequestFriendRichPresence this adjustor: 0
1>ISteamFriends::InviteUserToGame this adjustor: 0
1>ISteamFriends::GetCoplayFriendCount this adjustor: 0
1>ISteamFriends::GetCoplayFriend this adjustor: 0
1>ISteamFriends::GetFriendCoplayTime this adjustor: 0
1>ISteamFriends::GetFriendCoplayGame this adjustor: 0
1>ISteamFriends::JoinClanChatRoom this adjustor: 0
1>ISteamFriends::LeaveClanChatRoom this adjustor: 0
1>ISteamFriends::GetClanChatMemberCount this adjustor: 0
1>ISteamFriends::GetChatMemberByIndex this adjustor: 0
1>ISteamFriends::SendClanChatMessage this adjustor: 0
1>ISteamFriends::GetClanChatMessage this adjustor: 0
1>ISteamFriends::IsClanChatAdmin this adjustor: 0
1>ISteamFriends::IsClanChatWindowOpenInSteam this adjustor: 0
1>ISteamFriends::OpenClanChatWindowInSteam this adjustor: 0
1>ISteamFriends::CloseClanChatWindowInSteam this adjustor: 0
1>ISteamFriends::SetListenForFriendsMessages this adjustor: 0
1>ISteamFriends::ReplyToFriendMessage this adjustor: 0
1>ISteamFriends::GetFriendMessage this adjustor: 0
1>ISteamFriends::GetFollowerCount this adjustor: 0
1>ISteamFriends::IsFollowing this adjustor: 0
1>ISteamFriends::EnumerateFollowingList this adjustor: 0
1>ISteamFriends::IsClanPublic this adjustor: 0
1>ISteamFriends::IsClanOfficialGameGroup this adjustor: 0
1>
1>class PersonaStateChange_t	size(16):
1>	+---
1> 0	| m_ulSteamID
1> 8	| m_nChangeFlags
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class GameOverlayActivated_t	size(1):
1>	+---
1> 0	| m_bActive
1>	+---
1>
1>class GameServerChangeRequested_t	size(128):
1>	+---
1> 0	| m_rgchServer
1>64	| m_rgchPassword
1>	+---
1>
1>class GameLobbyJoinRequested_t	size(16):
1>	+---
1> 0	| CSteamID m_steamIDLobby
1> 8	| CSteamID m_steamIDFriend
1>	+---
1>
1>class AvatarImageLoaded_t	size(20):
1>	+---
1> 0	| CSteamID m_steamID
1> 8	| m_iImage
1>12	| m_iWide
1>16	| m_iTall
1>	+---
1>
1>class ClanOfficerListResponse_t	size(16):
1>	+---
1> 0	| CSteamID m_steamIDClan
1> 8	| m_cOfficers
1>12	| m_bSuccess
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class FriendRichPresenceUpdate_t	size(12):
1>	+---
1> 0	| CSteamID m_steamIDFriend
1> 8	| m_nAppID
1>	+---
1>
1>class GameRichPresenceJoinRequested_t	size(264):
1>	+---
1> 0	| CSteamID m_steamIDFriend
1> 8	| m_rgchConnect
1>	+---
1>
1>class GameConnectedClanChatMsg_t	size(20):
1>	+---
1> 0	| CSteamID m_steamIDClanChat
1> 8	| CSteamID m_steamIDUser
1>16	| m_iMessageID
1>	+---
1>
1>class GameConnectedChatJoin_t	size(16):
1>	+---
1> 0	| CSteamID m_steamIDClanChat
1> 8	| CSteamID m_steamIDUser
1>	+---
1>
1>class GameConnectedChatLeave_t	size(18):
1>	+---
1> 0	| CSteamID m_steamIDClanChat
1> 8	| CSteamID m_steamIDUser
1>16	| m_bKicked
1>17	| m_bDropped
1>	+---
1>
1>class DownloadClanActivityCountsResult_t	size(1):
1>	+---
1> 0	| m_bSuccess
1>	+---
1>
1>class JoinClanChatRoomCompletionResult_t	size(12):
1>	+---
1> 0	| CSteamID m_steamIDClanChat
1> 8	| EChatRoomEnterResponse m_eChatRoomEnterResponse
1>	+---
1>
1>class GameConnectedFriendChatMsg_t	size(12):
1>	+---
1> 0	| CSteamID m_steamIDUser
1> 8	| m_iMessageID
1>	+---
1>
1>class FriendsGetFollowerCount_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1> 4	| CSteamID m_steamID
1>12	| m_nCount
1>	+---
1>
1>class FriendsIsFollowing_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1> 4	| CSteamID m_steamID
1>12	| m_bIsFollowing
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class FriendsEnumerateFollowingList_t	size(412):
1>	+---
1> 0	| EResult m_eResult
1> 4	| m_rgSteamID
1>404	| m_nResultsReturned
1>408	| m_nTotalResultCount
1>	+---
1>
1>class SetPersonaNameResponse_t	size(8):
1>	+---
1> 0	| m_bSuccess
1> 1	| m_bLocalSuccess
1>  	| <alignment member> (size=2)
1> 4	| EResult m_result
1>	+---
1>
1>class ISteamUtils	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamUtils::$vftable@:
1>	| &ISteamUtils_meta
1>	|  0
1> 0	| &ISteamUtils::GetSecondsSinceAppActive
1> 1	| &ISteamUtils::GetSecondsSinceComputerActive
1> 2	| &ISteamUtils::GetConnectedUniverse
1> 3	| &ISteamUtils::GetServerRealTime
1> 4	| &ISteamUtils::GetIPCountry
1> 5	| &ISteamUtils::GetImageSize
1> 6	| &ISteamUtils::GetImageRGBA
1> 7	| &ISteamUtils::GetCSERIPPort
1> 8	| &ISteamUtils::GetCurrentBatteryPower
1> 9	| &ISteamUtils::GetAppID
1>10	| &ISteamUtils::SetOverlayNotificationPosition
1>11	| &ISteamUtils::IsAPICallCompleted
1>12	| &ISteamUtils::GetAPICallFailureReason
1>13	| &ISteamUtils::GetAPICallResult
1>14	| &ISteamUtils::RunFrame
1>15	| &ISteamUtils::GetIPCCallCount
1>16	| &ISteamUtils::SetWarningMessageHook
1>17	| &ISteamUtils::IsOverlayEnabled
1>18	| &ISteamUtils::BOverlayNeedsPresent
1>19	| &ISteamUtils::CheckFileSignature
1>20	| &ISteamUtils::ShowGamepadTextInput
1>21	| &ISteamUtils::GetEnteredGamepadTextLength
1>22	| &ISteamUtils::GetEnteredGamepadTextInput
1>23	| &ISteamUtils::GetSteamUILanguage
1>24	| &ISteamUtils::IsSteamRunningInVR
1>25	| &ISteamUtils::SetOverlayNotificationInset
1>26	| &ISteamUtils::IsSteamInBigPictureMode
1>27	| &ISteamUtils::StartVRDashboard
1>28	| &ISteamUtils::IsVRHeadsetStreamingEnabled
1>29	| &ISteamUtils::SetVRHeadsetStreamingEnabled
1>
1>ISteamUtils::GetSecondsSinceAppActive this adjustor: 0
1>ISteamUtils::GetSecondsSinceComputerActive this adjustor: 0
1>ISteamUtils::GetConnectedUniverse this adjustor: 0
1>ISteamUtils::GetServerRealTime this adjustor: 0
1>ISteamUtils::GetIPCountry this adjustor: 0
1>ISteamUtils::GetImageSize this adjustor: 0
1>ISteamUtils::GetImageRGBA this adjustor: 0
1>ISteamUtils::GetCSERIPPort this adjustor: 0
1>ISteamUtils::GetCurrentBatteryPower this adjustor: 0
1>ISteamUtils::GetAppID this adjustor: 0
1>ISteamUtils::SetOverlayNotificationPosition this adjustor: 0
1>ISteamUtils::IsAPICallCompleted this adjustor: 0
1>ISteamUtils::GetAPICallFailureReason this adjustor: 0
1>ISteamUtils::GetAPICallResult this adjustor: 0
1>ISteamUtils::RunFrame this adjustor: 0
1>ISteamUtils::GetIPCCallCount this adjustor: 0
1>ISteamUtils::SetWarningMessageHook this adjustor: 0
1>ISteamUtils::IsOverlayEnabled this adjustor: 0
1>ISteamUtils::BOverlayNeedsPresent this adjustor: 0
1>ISteamUtils::CheckFileSignature this adjustor: 0
1>ISteamUtils::ShowGamepadTextInput this adjustor: 0
1>ISteamUtils::GetEnteredGamepadTextLength this adjustor: 0
1>ISteamUtils::GetEnteredGamepadTextInput this adjustor: 0
1>ISteamUtils::GetSteamUILanguage this adjustor: 0
1>ISteamUtils::IsSteamRunningInVR this adjustor: 0
1>ISteamUtils::SetOverlayNotificationInset this adjustor: 0
1>ISteamUtils::IsSteamInBigPictureMode this adjustor: 0
1>ISteamUtils::StartVRDashboard this adjustor: 0
1>ISteamUtils::IsVRHeadsetStreamingEnabled this adjustor: 0
1>ISteamUtils::SetVRHeadsetStreamingEnabled this adjustor: 0
1>
1>class IPCountry_t	size(1):
1>	+---
1>	+---
1>
1>class LowBatteryPower_t	size(1):
1>	+---
1> 0	| m_nMinutesBatteryLeft
1>	+---
1>
1>class SteamAPICallCompleted_t	size(16):
1>	+---
1> 0	| m_hAsyncCall
1> 8	| m_iCallback
1>12	| m_cubParam
1>	+---
1>
1>class SteamShutdown_t	size(1):
1>	+---
1>	+---
1>
1>class CheckFileSignature_t	size(4):
1>	+---
1> 0	| ECheckFileSignature m_eCheckFileSignature
1>	+---
1>
1>class GamepadTextInputDismissed_t	size(8):
1>	+---
1> 0	| m_bSubmitted
1>  	| <alignment member> (size=3)
1> 4	| m_unSubmittedText
1>	+---
1>
1>class _iobuf	size(4):
1>	+---
1> 0	| _Placeholder
1>	+---
1>
1>class MatchMakingKeyValuePair_t	size(512):
1>	+---
1> 0	| m_szKey
1>256	| m_szValue
1>	+---
1>
1>class servernetadr_t	size(8):
1>	+---
1> 0	| m_usConnectionPort
1> 2	| m_usQueryPort
1> 4	| m_unIP
1>	+---
1>
1>class gameserveritem_t	size(372):
1>	+---
1> 0	| servernetadr_t m_NetAdr
1> 8	| m_nPing
1>12	| m_bHadSuccessfulResponse
1>13	| m_bDoNotRefresh
1>14	| m_szGameDir
1>46	| m_szMap
1>78	| m_szGameDescription
1>  	| <alignment member> (size=2)
1>144	| m_nAppID
1>148	| m_nPlayers
1>152	| m_nMaxPlayers
1>156	| m_nBotPlayers
1>160	| m_bPassword
1>161	| m_bSecure
1>  	| <alignment member> (size=2)
1>164	| m_ulTimeLastPlayed
1>168	| m_nServerVersion
1>172	| m_szServerName
1>236	| m_szGameTags
1>364	| CSteamID m_steamID
1>	+---
1>
1>class ISteamMatchmaking	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamMatchmaking::$vftable@:
1>	| &ISteamMatchmaking_meta
1>	|  0
1> 0	| &ISteamMatchmaking::GetFavoriteGameCount
1> 1	| &ISteamMatchmaking::GetFavoriteGame
1> 2	| &ISteamMatchmaking::AddFavoriteGame
1> 3	| &ISteamMatchmaking::RemoveFavoriteGame
1> 4	| &ISteamMatchmaking::RequestLobbyList
1> 5	| &ISteamMatchmaking::AddRequestLobbyListStringFilter
1> 6	| &ISteamMatchmaking::AddRequestLobbyListNumericalFilter
1> 7	| &ISteamMatchmaking::AddRequestLobbyListNearValueFilter
1> 8	| &ISteamMatchmaking::AddRequestLobbyListFilterSlotsAvailable
1> 9	| &ISteamMatchmaking::AddRequestLobbyListDistanceFilter
1>10	| &ISteamMatchmaking::AddRequestLobbyListResultCountFilter
1>11	| &ISteamMatchmaking::AddRequestLobbyListCompatibleMembersFilter
1>12	| &ISteamMatchmaking::GetLobbyByIndex
1>13	| &ISteamMatchmaking::CreateLobby
1>14	| &ISteamMatchmaking::JoinLobby
1>15	| &ISteamMatchmaking::LeaveLobby
1>16	| &ISteamMatchmaking::InviteUserToLobby
1>17	| &ISteamMatchmaking::GetNumLobbyMembers
1>18	| &ISteamMatchmaking::GetLobbyMemberByIndex
1>19	| &ISteamMatchmaking::GetLobbyData
1>20	| &ISteamMatchmaking::SetLobbyData
1>21	| &ISteamMatchmaking::GetLobbyDataCount
1>22	| &ISteamMatchmaking::GetLobbyDataByIndex
1>23	| &ISteamMatchmaking::DeleteLobbyData
1>24	| &ISteamMatchmaking::GetLobbyMemberData
1>25	| &ISteamMatchmaking::SetLobbyMemberData
1>26	| &ISteamMatchmaking::SendLobbyChatMsg
1>27	| &ISteamMatchmaking::GetLobbyChatEntry
1>28	| &ISteamMatchmaking::RequestLobbyData
1>29	| &ISteamMatchmaking::SetLobbyGameServer
1>30	| &ISteamMatchmaking::GetLobbyGameServer
1>31	| &ISteamMatchmaking::SetLobbyMemberLimit
1>32	| &ISteamMatchmaking::GetLobbyMemberLimit
1>33	| &ISteamMatchmaking::SetLobbyType
1>34	| &ISteamMatchmaking::SetLobbyJoinable
1>35	| &ISteamMatchmaking::GetLobbyOwner
1>36	| &ISteamMatchmaking::SetLobbyOwner
1>37	| &ISteamMatchmaking::SetLinkedLobby
1>
1>ISteamMatchmaking::GetFavoriteGameCount this adjustor: 0
1>ISteamMatchmaking::GetFavoriteGame this adjustor: 0
1>ISteamMatchmaking::AddFavoriteGame this adjustor: 0
1>ISteamMatchmaking::RemoveFavoriteGame this adjustor: 0
1>ISteamMatchmaking::RequestLobbyList this adjustor: 0
1>ISteamMatchmaking::AddRequestLobbyListStringFilter this adjustor: 0
1>ISteamMatchmaking::AddRequestLobbyListNumericalFilter this adjustor: 0
1>ISteamMatchmaking::AddRequestLobbyListNearValueFilter this adjustor: 0
1>ISteamMatchmaking::AddRequestLobbyListFilterSlotsAvailable this adjustor: 0
1>ISteamMatchmaking::AddRequestLobbyListDistanceFilter this adjustor: 0
1>ISteamMatchmaking::AddRequestLobbyListResultCountFilter this adjustor: 0
1>ISteamMatchmaking::AddRequestLobbyListCompatibleMembersFilter this adjustor: 0
1>ISteamMatchmaking::GetLobbyByIndex this adjustor: 0
1>ISteamMatchmaking::CreateLobby this adjustor: 0
1>ISteamMatchmaking::JoinLobby this adjustor: 0
1>ISteamMatchmaking::LeaveLobby this adjustor: 0
1>ISteamMatchmaking::InviteUserToLobby this adjustor: 0
1>ISteamMatchmaking::GetNumLobbyMembers this adjustor: 0
1>ISteamMatchmaking::GetLobbyMemberByIndex this adjustor: 0
1>ISteamMatchmaking::GetLobbyData this adjustor: 0
1>ISteamMatchmaking::SetLobbyData this adjustor: 0
1>ISteamMatchmaking::GetLobbyDataCount this adjustor: 0
1>ISteamMatchmaking::GetLobbyDataByIndex this adjustor: 0
1>ISteamMatchmaking::DeleteLobbyData this adjustor: 0
1>ISteamMatchmaking::GetLobbyMemberData this adjustor: 0
1>ISteamMatchmaking::SetLobbyMemberData this adjustor: 0
1>ISteamMatchmaking::SendLobbyChatMsg this adjustor: 0
1>ISteamMatchmaking::GetLobbyChatEntry this adjustor: 0
1>ISteamMatchmaking::RequestLobbyData this adjustor: 0
1>ISteamMatchmaking::SetLobbyGameServer this adjustor: 0
1>ISteamMatchmaking::GetLobbyGameServer this adjustor: 0
1>ISteamMatchmaking::SetLobbyMemberLimit this adjustor: 0
1>ISteamMatchmaking::GetLobbyMemberLimit this adjustor: 0
1>ISteamMatchmaking::SetLobbyType this adjustor: 0
1>ISteamMatchmaking::SetLobbyJoinable this adjustor: 0
1>ISteamMatchmaking::GetLobbyOwner this adjustor: 0
1>ISteamMatchmaking::SetLobbyOwner this adjustor: 0
1>ISteamMatchmaking::SetLinkedLobby this adjustor: 0
1>
1>class ISteamMatchmakingServerListResponse	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamMatchmakingServerListResponse::$vftable@:
1>	| &ISteamMatchmakingServerListResponse_meta
1>	|  0
1> 0	| &ISteamMatchmakingServerListResponse::ServerResponded
1> 1	| &ISteamMatchmakingServerListResponse::ServerFailedToRespond
1> 2	| &ISteamMatchmakingServerListResponse::RefreshComplete
1>
1>ISteamMatchmakingServerListResponse::ServerResponded this adjustor: 0
1>ISteamMatchmakingServerListResponse::ServerFailedToRespond this adjustor: 0
1>ISteamMatchmakingServerListResponse::RefreshComplete this adjustor: 0
1>
1>class ISteamMatchmakingPingResponse	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamMatchmakingPingResponse::$vftable@:
1>	| &ISteamMatchmakingPingResponse_meta
1>	|  0
1> 0	| &ISteamMatchmakingPingResponse::ServerResponded
1> 1	| &ISteamMatchmakingPingResponse::ServerFailedToRespond
1>
1>ISteamMatchmakingPingResponse::ServerResponded this adjustor: 0
1>ISteamMatchmakingPingResponse::ServerFailedToRespond this adjustor: 0
1>
1>class ISteamMatchmakingPlayersResponse	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamMatchmakingPlayersResponse::$vftable@:
1>	| &ISteamMatchmakingPlayersResponse_meta
1>	|  0
1> 0	| &ISteamMatchmakingPlayersResponse::AddPlayerToList
1> 1	| &ISteamMatchmakingPlayersResponse::PlayersFailedToRespond
1> 2	| &ISteamMatchmakingPlayersResponse::PlayersRefreshComplete
1>
1>ISteamMatchmakingPlayersResponse::AddPlayerToList this adjustor: 0
1>ISteamMatchmakingPlayersResponse::PlayersFailedToRespond this adjustor: 0
1>ISteamMatchmakingPlayersResponse::PlayersRefreshComplete this adjustor: 0
1>
1>class ISteamMatchmakingRulesResponse	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamMatchmakingRulesResponse::$vftable@:
1>	| &ISteamMatchmakingRulesResponse_meta
1>	|  0
1> 0	| &ISteamMatchmakingRulesResponse::RulesResponded
1> 1	| &ISteamMatchmakingRulesResponse::RulesFailedToRespond
1> 2	| &ISteamMatchmakingRulesResponse::RulesRefreshComplete
1>
1>ISteamMatchmakingRulesResponse::RulesResponded this adjustor: 0
1>ISteamMatchmakingRulesResponse::RulesFailedToRespond this adjustor: 0
1>ISteamMatchmakingRulesResponse::RulesRefreshComplete this adjustor: 0
1>
1>class ISteamMatchmakingServers	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamMatchmakingServers::$vftable@:
1>	| &ISteamMatchmakingServers_meta
1>	|  0
1> 0	| &ISteamMatchmakingServers::RequestInternetServerList
1> 1	| &ISteamMatchmakingServers::RequestLANServerList
1> 2	| &ISteamMatchmakingServers::RequestFriendsServerList
1> 3	| &ISteamMatchmakingServers::RequestFavoritesServerList
1> 4	| &ISteamMatchmakingServers::RequestHistoryServerList
1> 5	| &ISteamMatchmakingServers::RequestSpectatorServerList
1> 6	| &ISteamMatchmakingServers::ReleaseRequest
1> 7	| &ISteamMatchmakingServers::GetServerDetails
1> 8	| &ISteamMatchmakingServers::CancelQuery
1> 9	| &ISteamMatchmakingServers::RefreshQuery
1>10	| &ISteamMatchmakingServers::IsRefreshing
1>11	| &ISteamMatchmakingServers::GetServerCount
1>12	| &ISteamMatchmakingServers::RefreshServer
1>13	| &ISteamMatchmakingServers::PingServer
1>14	| &ISteamMatchmakingServers::PlayerDetails
1>15	| &ISteamMatchmakingServers::ServerRules
1>16	| &ISteamMatchmakingServers::CancelServerQuery
1>
1>ISteamMatchmakingServers::RequestInternetServerList this adjustor: 0
1>ISteamMatchmakingServers::RequestLANServerList this adjustor: 0
1>ISteamMatchmakingServers::RequestFriendsServerList this adjustor: 0
1>ISteamMatchmakingServers::RequestFavoritesServerList this adjustor: 0
1>ISteamMatchmakingServers::RequestHistoryServerList this adjustor: 0
1>ISteamMatchmakingServers::RequestSpectatorServerList this adjustor: 0
1>ISteamMatchmakingServers::ReleaseRequest this adjustor: 0
1>ISteamMatchmakingServers::GetServerDetails this adjustor: 0
1>ISteamMatchmakingServers::CancelQuery this adjustor: 0
1>ISteamMatchmakingServers::RefreshQuery this adjustor: 0
1>ISteamMatchmakingServers::IsRefreshing this adjustor: 0
1>ISteamMatchmakingServers::GetServerCount this adjustor: 0
1>ISteamMatchmakingServers::RefreshServer this adjustor: 0
1>ISteamMatchmakingServers::PingServer this adjustor: 0
1>ISteamMatchmakingServers::PlayerDetails this adjustor: 0
1>ISteamMatchmakingServers::ServerRules this adjustor: 0
1>ISteamMatchmakingServers::CancelServerQuery this adjustor: 0
1>
1>class FavoritesListChanged_t	size(28):
1>	+---
1> 0	| m_nIP
1> 4	| m_nQueryPort
1> 8	| m_nConnPort
1>12	| m_nAppID
1>16	| m_nFlags
1>20	| m_bAdd
1>  	| <alignment member> (size=3)
1>24	| m_unAccountId
1>	+---
1>
1>class LobbyInvite_t	size(24):
1>	+---
1> 0	| m_ulSteamIDUser
1> 8	| m_ulSteamIDLobby
1>16	| m_ulGameID
1>	+---
1>
1>class LobbyEnter_t	size(24):
1>	+---
1> 0	| m_ulSteamIDLobby
1> 8	| m_rgfChatPermissions
1>12	| m_bLocked
1>  	| <alignment member> (size=3)
1>16	| m_EChatRoomEnterResponse
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class LobbyDataUpdate_t	size(24):
1>	+---
1> 0	| m_ulSteamIDLobby
1> 8	| m_ulSteamIDMember
1>16	| m_bSuccess
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class LobbyChatUpdate_t	size(32):
1>	+---
1> 0	| m_ulSteamIDLobby
1> 8	| m_ulSteamIDUserChanged
1>16	| m_ulSteamIDMakingChange
1>24	| m_rgfChatMemberStateChange
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class LobbyChatMsg_t	size(24):
1>	+---
1> 0	| m_ulSteamIDLobby
1> 8	| m_ulSteamIDUser
1>16	| m_eChatEntryType
1>  	| <alignment member> (size=3)
1>20	| m_iChatID
1>	+---
1>
1>class LobbyGameCreated_t	size(24):
1>	+---
1> 0	| m_ulSteamIDLobby
1> 8	| m_ulSteamIDGameServer
1>16	| m_unIP
1>20	| m_usPort
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class LobbyMatchList_t	size(4):
1>	+---
1> 0	| m_nLobbiesMatching
1>	+---
1>
1>class LobbyKicked_t	size(24):
1>	+---
1> 0	| m_ulSteamIDLobby
1> 8	| m_ulSteamIDAdmin
1>16	| m_bKickedDueToDisconnect
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class LobbyCreated_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_ulSteamIDLobby
1>	+---
1>
1>class PSNGameBootInviteResult_t	size(9):
1>	+---
1> 0	| m_bGameBootInviteExists
1> 1	| CSteamID m_steamIDLobby
1>	+---
1>
1>class FavoritesListAccountsUpdated_t	size(4):
1>	+---
1> 0	| EResult m_eResult
1>	+---
1>
1>class SteamParamStringArray_t	size(8):
1>	+---
1> 0	| m_ppStrings
1> 4	| m_nNumStrings
1>	+---
1>
1>class ISteamRemoteStorage	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamRemoteStorage::$vftable@:
1>	| &ISteamRemoteStorage_meta
1>	|  0
1> 0	| &ISteamRemoteStorage::FileWrite
1> 1	| &ISteamRemoteStorage::FileRead
1> 2	| &ISteamRemoteStorage::FileWriteAsync
1> 3	| &ISteamRemoteStorage::FileReadAsync
1> 4	| &ISteamRemoteStorage::FileReadAsyncComplete
1> 5	| &ISteamRemoteStorage::FileForget
1> 6	| &ISteamRemoteStorage::FileDelete
1> 7	| &ISteamRemoteStorage::FileShare
1> 8	| &ISteamRemoteStorage::SetSyncPlatforms
1> 9	| &ISteamRemoteStorage::FileWriteStreamOpen
1>10	| &ISteamRemoteStorage::FileWriteStreamWriteChunk
1>11	| &ISteamRemoteStorage::FileWriteStreamClose
1>12	| &ISteamRemoteStorage::FileWriteStreamCancel
1>13	| &ISteamRemoteStorage::FileExists
1>14	| &ISteamRemoteStorage::FilePersisted
1>15	| &ISteamRemoteStorage::GetFileSize
1>16	| &ISteamRemoteStorage::GetFileTimestamp
1>17	| &ISteamRemoteStorage::GetSyncPlatforms
1>18	| &ISteamRemoteStorage::GetFileCount
1>19	| &ISteamRemoteStorage::GetFileNameAndSize
1>20	| &ISteamRemoteStorage::GetQuota
1>21	| &ISteamRemoteStorage::IsCloudEnabledForAccount
1>22	| &ISteamRemoteStorage::IsCloudEnabledForApp
1>23	| &ISteamRemoteStorage::SetCloudEnabledForApp
1>24	| &ISteamRemoteStorage::UGCDownload
1>25	| &ISteamRemoteStorage::GetUGCDownloadProgress
1>26	| &ISteamRemoteStorage::GetUGCDetails
1>27	| &ISteamRemoteStorage::UGCRead
1>28	| &ISteamRemoteStorage::GetCachedUGCCount
1>29	| &ISteamRemoteStorage::GetCachedUGCHandle
1>30	| &ISteamRemoteStorage::PublishWorkshopFile
1>31	| &ISteamRemoteStorage::CreatePublishedFileUpdateRequest
1>32	| &ISteamRemoteStorage::UpdatePublishedFileFile
1>33	| &ISteamRemoteStorage::UpdatePublishedFilePreviewFile
1>34	| &ISteamRemoteStorage::UpdatePublishedFileTitle
1>35	| &ISteamRemoteStorage::UpdatePublishedFileDescription
1>36	| &ISteamRemoteStorage::UpdatePublishedFileVisibility
1>37	| &ISteamRemoteStorage::UpdatePublishedFileTags
1>38	| &ISteamRemoteStorage::CommitPublishedFileUpdate
1>39	| &ISteamRemoteStorage::GetPublishedFileDetails
1>40	| &ISteamRemoteStorage::DeletePublishedFile
1>41	| &ISteamRemoteStorage::EnumerateUserPublishedFiles
1>42	| &ISteamRemoteStorage::SubscribePublishedFile
1>43	| &ISteamRemoteStorage::EnumerateUserSubscribedFiles
1>44	| &ISteamRemoteStorage::UnsubscribePublishedFile
1>45	| &ISteamRemoteStorage::UpdatePublishedFileSetChangeDescription
1>46	| &ISteamRemoteStorage::GetPublishedItemVoteDetails
1>47	| &ISteamRemoteStorage::UpdateUserPublishedItemVote
1>48	| &ISteamRemoteStorage::GetUserPublishedItemVoteDetails
1>49	| &ISteamRemoteStorage::EnumerateUserSharedWorkshopFiles
1>50	| &ISteamRemoteStorage::PublishVideo
1>51	| &ISteamRemoteStorage::SetUserPublishedFileAction
1>52	| &ISteamRemoteStorage::EnumeratePublishedFilesByUserAction
1>53	| &ISteamRemoteStorage::EnumeratePublishedWorkshopFiles
1>54	| &ISteamRemoteStorage::UGCDownloadToLocation
1>
1>ISteamRemoteStorage::FileWrite this adjustor: 0
1>ISteamRemoteStorage::FileRead this adjustor: 0
1>ISteamRemoteStorage::FileWriteAsync this adjustor: 0
1>ISteamRemoteStorage::FileReadAsync this adjustor: 0
1>ISteamRemoteStorage::FileReadAsyncComplete this adjustor: 0
1>ISteamRemoteStorage::FileForget this adjustor: 0
1>ISteamRemoteStorage::FileDelete this adjustor: 0
1>ISteamRemoteStorage::FileShare this adjustor: 0
1>ISteamRemoteStorage::SetSyncPlatforms this adjustor: 0
1>ISteamRemoteStorage::FileWriteStreamOpen this adjustor: 0
1>ISteamRemoteStorage::FileWriteStreamWriteChunk this adjustor: 0
1>ISteamRemoteStorage::FileWriteStreamClose this adjustor: 0
1>ISteamRemoteStorage::FileWriteStreamCancel this adjustor: 0
1>ISteamRemoteStorage::FileExists this adjustor: 0
1>ISteamRemoteStorage::FilePersisted this adjustor: 0
1>ISteamRemoteStorage::GetFileSize this adjustor: 0
1>ISteamRemoteStorage::GetFileTimestamp this adjustor: 0
1>ISteamRemoteStorage::GetSyncPlatforms this adjustor: 0
1>ISteamRemoteStorage::GetFileCount this adjustor: 0
1>ISteamRemoteStorage::GetFileNameAndSize this adjustor: 0
1>ISteamRemoteStorage::GetQuota this adjustor: 0
1>ISteamRemoteStorage::IsCloudEnabledForAccount this adjustor: 0
1>ISteamRemoteStorage::IsCloudEnabledForApp this adjustor: 0
1>ISteamRemoteStorage::SetCloudEnabledForApp this adjustor: 0
1>ISteamRemoteStorage::UGCDownload this adjustor: 0
1>ISteamRemoteStorage::GetUGCDownloadProgress this adjustor: 0
1>ISteamRemoteStorage::GetUGCDetails this adjustor: 0
1>ISteamRemoteStorage::UGCRead this adjustor: 0
1>ISteamRemoteStorage::GetCachedUGCCount this adjustor: 0
1>ISteamRemoteStorage::GetCachedUGCHandle this adjustor: 0
1>ISteamRemoteStorage::PublishWorkshopFile this adjustor: 0
1>ISteamRemoteStorage::CreatePublishedFileUpdateRequest this adjustor: 0
1>ISteamRemoteStorage::UpdatePublishedFileFile this adjustor: 0
1>ISteamRemoteStorage::UpdatePublishedFilePreviewFile this adjustor: 0
1>ISteamRemoteStorage::UpdatePublishedFileTitle this adjustor: 0
1>ISteamRemoteStorage::UpdatePublishedFileDescription this adjustor: 0
1>ISteamRemoteStorage::UpdatePublishedFileVisibility this adjustor: 0
1>ISteamRemoteStorage::UpdatePublishedFileTags this adjustor: 0
1>ISteamRemoteStorage::CommitPublishedFileUpdate this adjustor: 0
1>ISteamRemoteStorage::GetPublishedFileDetails this adjustor: 0
1>ISteamRemoteStorage::DeletePublishedFile this adjustor: 0
1>ISteamRemoteStorage::EnumerateUserPublishedFiles this adjustor: 0
1>ISteamRemoteStorage::SubscribePublishedFile this adjustor: 0
1>ISteamRemoteStorage::EnumerateUserSubscribedFiles this adjustor: 0
1>ISteamRemoteStorage::UnsubscribePublishedFile this adjustor: 0
1>ISteamRemoteStorage::UpdatePublishedFileSetChangeDescription this adjustor: 0
1>ISteamRemoteStorage::GetPublishedItemVoteDetails this adjustor: 0
1>ISteamRemoteStorage::UpdateUserPublishedItemVote this adjustor: 0
1>ISteamRemoteStorage::GetUserPublishedItemVoteDetails this adjustor: 0
1>ISteamRemoteStorage::EnumerateUserSharedWorkshopFiles this adjustor: 0
1>ISteamRemoteStorage::PublishVideo this adjustor: 0
1>ISteamRemoteStorage::SetUserPublishedFileAction this adjustor: 0
1>ISteamRemoteStorage::EnumeratePublishedFilesByUserAction this adjustor: 0
1>ISteamRemoteStorage::EnumeratePublishedWorkshopFiles this adjustor: 0
1>ISteamRemoteStorage::UGCDownloadToLocation this adjustor: 0
1>
1>class RemoteStorageAppSyncedClient_t	size(12):
1>	+---
1> 0	| m_nAppID
1> 4	| EResult m_eResult
1> 8	| m_unNumDownloads
1>	+---
1>
1>class RemoteStorageAppSyncedServer_t	size(12):
1>	+---
1> 0	| m_nAppID
1> 4	| EResult m_eResult
1> 8	| m_unNumUploads
1>	+---
1>
1>class RemoteStorageAppSyncProgress_t	size(288):
1>	+---
1> 0	| m_rgchCurrentFile
1>260	| m_nAppID
1>264	| m_uBytesTransferredThisChunk
1>  	| <alignment member> (size=4)
1>272	| m_dAppPercentComplete
1>280	| m_bUploading
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class RemoteStorageAppSyncStatusCheck_t	size(8):
1>	+---
1> 0	| m_nAppID
1> 4	| EResult m_eResult
1>	+---
1>
1>class RemoteStorageFileShareResult_t	size(280):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_hFile
1>16	| m_rgchFilename
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class RemoteStoragePublishFileResult_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_bUserNeedsToAcceptWorkshopLegalAgreement
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class RemoteStorageDeletePublishedFileResult_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>	+---
1>
1>class RemoteStorageEnumerateUserPublishedFilesResult_t	size(416):
1>	+---
1> 0	| EResult m_eResult
1> 4	| m_nResultsReturned
1> 8	| m_nTotalResultCount
1>  	| <alignment member> (size=4)
1>16	| m_rgPublishedFileId
1>	+---
1>
1>class RemoteStorageSubscribePublishedFileResult_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>	+---
1>
1>class RemoteStorageEnumerateUserSubscribedFilesResult_t	size(616):
1>	+---
1> 0	| EResult m_eResult
1> 4	| m_nResultsReturned
1> 8	| m_nTotalResultCount
1>  	| <alignment member> (size=4)
1>16	| m_rgPublishedFileId
1>416	| m_rgRTimeSubscribed
1>	+---
1>
1>class RemoteStorageUnsubscribePublishedFileResult_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>	+---
1>
1>class RemoteStorageUpdatePublishedFileResult_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_bUserNeedsToAcceptWorkshopLegalAgreement
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class RemoteStorageDownloadUGCResult_t	size(296):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_hFile
1>16	| m_nAppID
1>20	| m_nSizeInBytes
1>24	| m_pchFileName
1>  	| <alignment member> (size=4)
1>288	| m_ulSteamIDOwner
1>	+---
1>
1>class RemoteStorageGetPublishedFileDetailsResult_t	size(9760):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_nCreatorAppID
1>20	| m_nConsumerAppID
1>24	| m_rgchTitle
1>153	| m_rgchDescription
1>  	| <alignment member> (size=7)
1>8160	| m_hFile
1>8168	| m_hPreviewFile
1>8176	| m_ulSteamIDOwner
1>8184	| m_rtimeCreated
1>8188	| m_rtimeUpdated
1>8192	| ERemoteStoragePublishedFileVisibility m_eVisibility
1>8196	| m_bBanned
1>8197	| m_rgchTags
1>9222	| m_bTagsTruncated
1>9223	| m_pchFileName
1>  	| <alignment member> (size=1)
1>9484	| m_nFileSize
1>9488	| m_nPreviewFileSize
1>9492	| m_rgchURL
1>9748	| EWorkshopFileType m_eFileType
1>9752	| m_bAcceptedForUse
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class RemoteStorageEnumerateWorkshopFilesResult_t	size(624):
1>	+---
1> 0	| EResult m_eResult
1> 4	| m_nResultsReturned
1> 8	| m_nTotalResultCount
1>  	| <alignment member> (size=4)
1>16	| m_rgPublishedFileId
1>416	| m_rgScore
1>616	| m_nAppId
1>620	| m_unStartIndex
1>	+---
1>
1>class RemoteStorageGetPublishedItemVoteDetailsResult_t	size(32):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_unPublishedFileId
1>16	| m_nVotesFor
1>20	| m_nVotesAgainst
1>24	| m_nReports
1>28	| m_fScore
1>	+---
1>
1>class RemoteStoragePublishedFileSubscribed_t	size(16):
1>	+---
1> 0	| m_nPublishedFileId
1> 8	| m_nAppID
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class RemoteStoragePublishedFileUnsubscribed_t	size(16):
1>	+---
1> 0	| m_nPublishedFileId
1> 8	| m_nAppID
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class RemoteStoragePublishedFileDeleted_t	size(16):
1>	+---
1> 0	| m_nPublishedFileId
1> 8	| m_nAppID
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class RemoteStorageUpdateUserPublishedItemVoteResult_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>	+---
1>
1>class RemoteStorageUserVoteDetails_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| EWorkshopVote m_eVote
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class RemoteStorageEnumerateUserSharedWorkshopFilesResult_t	size(416):
1>	+---
1> 0	| EResult m_eResult
1> 4	| m_nResultsReturned
1> 8	| m_nTotalResultCount
1>  	| <alignment member> (size=4)
1>16	| m_rgPublishedFileId
1>	+---
1>
1>class RemoteStorageSetUserPublishedFileActionResult_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| EWorkshopFileAction m_eAction
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class RemoteStorageEnumeratePublishedFilesByUserActionResult_t	size(616):
1>	+---
1> 0	| EResult m_eResult
1> 4	| EWorkshopFileAction m_eAction
1> 8	| m_nResultsReturned
1>12	| m_nTotalResultCount
1>16	| m_rgPublishedFileId
1>416	| m_rgRTimeUpdated
1>	+---
1>
1>class RemoteStoragePublishFileProgress_t	size(16):
1>	+---
1> 0	| m_dPercentFile
1> 8	| m_bPreview
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class RemoteStoragePublishedFileUpdated_t	size(24):
1>	+---
1> 0	| m_nPublishedFileId
1> 8	| m_nAppID
1>  	| <alignment member> (size=4)
1>16	| m_ulUnused
1>	+---
1>
1>class RemoteStorageFileWriteAsyncComplete_t	size(4):
1>	+---
1> 0	| EResult m_eResult
1>	+---
1>
1>class RemoteStorageFileReadAsyncComplete_t	size(24):
1>	+---
1> 0	| m_hFileReadAsync
1> 8	| EResult m_eResult
1>12	| m_nOffset
1>16	| m_cubRead
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class LeaderboardEntry_t	size(32):
1>	+---
1> 0	| CSteamID m_steamIDUser
1> 8	| m_nGlobalRank
1>12	| m_nScore
1>16	| m_cDetails
1>  	| <alignment member> (size=4)
1>24	| m_hUGC
1>	+---
1>
1>class ISteamUserStats	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamUserStats::$vftable@:
1>	| &ISteamUserStats_meta
1>	|  0
1> 0	| &ISteamUserStats::RequestCurrentStats
1> 1	| &ISteamUserStats::GetStat
1> 2	| &ISteamUserStats::GetStat
1> 3	| &ISteamUserStats::SetStat
1> 4	| &ISteamUserStats::SetStat
1> 5	| &ISteamUserStats::UpdateAvgRateStat
1> 6	| &ISteamUserStats::GetAchievement
1> 7	| &ISteamUserStats::SetAchievement
1> 8	| &ISteamUserStats::ClearAchievement
1> 9	| &ISteamUserStats::GetAchievementAndUnlockTime
1>10	| &ISteamUserStats::StoreStats
1>11	| &ISteamUserStats::GetAchievementIcon
1>12	| &ISteamUserStats::GetAchievementDisplayAttribute
1>13	| &ISteamUserStats::IndicateAchievementProgress
1>14	| &ISteamUserStats::GetNumAchievements
1>15	| &ISteamUserStats::GetAchievementName
1>16	| &ISteamUserStats::RequestUserStats
1>17	| &ISteamUserStats::GetUserStat
1>18	| &ISteamUserStats::GetUserStat
1>19	| &ISteamUserStats::GetUserAchievement
1>20	| &ISteamUserStats::GetUserAchievementAndUnlockTime
1>21	| &ISteamUserStats::ResetAllStats
1>22	| &ISteamUserStats::FindOrCreateLeaderboard
1>23	| &ISteamUserStats::FindLeaderboard
1>24	| &ISteamUserStats::GetLeaderboardName
1>25	| &ISteamUserStats::GetLeaderboardEntryCount
1>26	| &ISteamUserStats::GetLeaderboardSortMethod
1>27	| &ISteamUserStats::GetLeaderboardDisplayType
1>28	| &ISteamUserStats::DownloadLeaderboardEntries
1>29	| &ISteamUserStats::DownloadLeaderboardEntriesForUsers
1>30	| &ISteamUserStats::GetDownloadedLeaderboardEntry
1>31	| &ISteamUserStats::UploadLeaderboardScore
1>32	| &ISteamUserStats::AttachLeaderboardUGC
1>33	| &ISteamUserStats::GetNumberOfCurrentPlayers
1>34	| &ISteamUserStats::RequestGlobalAchievementPercentages
1>35	| &ISteamUserStats::GetMostAchievedAchievementInfo
1>36	| &ISteamUserStats::GetNextMostAchievedAchievementInfo
1>37	| &ISteamUserStats::GetAchievementAchievedPercent
1>38	| &ISteamUserStats::RequestGlobalStats
1>39	| &ISteamUserStats::GetGlobalStat
1>40	| &ISteamUserStats::GetGlobalStat
1>41	| &ISteamUserStats::GetGlobalStatHistory
1>42	| &ISteamUserStats::GetGlobalStatHistory
1>
1>ISteamUserStats::RequestCurrentStats this adjustor: 0
1>ISteamUserStats::GetStat this adjustor: 0
1>ISteamUserStats::GetStat this adjustor: 0
1>ISteamUserStats::SetStat this adjustor: 0
1>ISteamUserStats::SetStat this adjustor: 0
1>ISteamUserStats::UpdateAvgRateStat this adjustor: 0
1>ISteamUserStats::GetAchievement this adjustor: 0
1>ISteamUserStats::SetAchievement this adjustor: 0
1>ISteamUserStats::ClearAchievement this adjustor: 0
1>ISteamUserStats::GetAchievementAndUnlockTime this adjustor: 0
1>ISteamUserStats::StoreStats this adjustor: 0
1>ISteamUserStats::GetAchievementIcon this adjustor: 0
1>ISteamUserStats::GetAchievementDisplayAttribute this adjustor: 0
1>ISteamUserStats::IndicateAchievementProgress this adjustor: 0
1>ISteamUserStats::GetNumAchievements this adjustor: 0
1>ISteamUserStats::GetAchievementName this adjustor: 0
1>ISteamUserStats::RequestUserStats this adjustor: 0
1>ISteamUserStats::GetUserStat this adjustor: 0
1>ISteamUserStats::GetUserStat this adjustor: 0
1>ISteamUserStats::GetUserAchievement this adjustor: 0
1>ISteamUserStats::GetUserAchievementAndUnlockTime this adjustor: 0
1>ISteamUserStats::ResetAllStats this adjustor: 0
1>ISteamUserStats::FindOrCreateLeaderboard this adjustor: 0
1>ISteamUserStats::FindLeaderboard this adjustor: 0
1>ISteamUserStats::GetLeaderboardName this adjustor: 0
1>ISteamUserStats::GetLeaderboardEntryCount this adjustor: 0
1>ISteamUserStats::GetLeaderboardSortMethod this adjustor: 0
1>ISteamUserStats::GetLeaderboardDisplayType this adjustor: 0
1>ISteamUserStats::DownloadLeaderboardEntries this adjustor: 0
1>ISteamUserStats::DownloadLeaderboardEntriesForUsers this adjustor: 0
1>ISteamUserStats::GetDownloadedLeaderboardEntry this adjustor: 0
1>ISteamUserStats::UploadLeaderboardScore this adjustor: 0
1>ISteamUserStats::AttachLeaderboardUGC this adjustor: 0
1>ISteamUserStats::GetNumberOfCurrentPlayers this adjustor: 0
1>ISteamUserStats::RequestGlobalAchievementPercentages this adjustor: 0
1>ISteamUserStats::GetMostAchievedAchievementInfo this adjustor: 0
1>ISteamUserStats::GetNextMostAchievedAchievementInfo this adjustor: 0
1>ISteamUserStats::GetAchievementAchievedPercent this adjustor: 0
1>ISteamUserStats::RequestGlobalStats this adjustor: 0
1>ISteamUserStats::GetGlobalStat this adjustor: 0
1>ISteamUserStats::GetGlobalStat this adjustor: 0
1>ISteamUserStats::GetGlobalStatHistory this adjustor: 0
1>ISteamUserStats::GetGlobalStatHistory this adjustor: 0
1>
1>class UserStatsReceived_t	size(24):
1>	+---
1> 0	| m_nGameID
1> 8	| EResult m_eResult
1>12	| CSteamID m_steamIDUser
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class UserStatsStored_t	size(16):
1>	+---
1> 0	| m_nGameID
1> 8	| EResult m_eResult
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class UserAchievementStored_t	size(152):
1>	+---
1> 0	| m_nGameID
1> 8	| m_bGroupAchievement
1> 9	| m_rgchAchievementName
1>  	| <alignment member> (size=3)
1>140	| m_nCurProgress
1>144	| m_nMaxProgress
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class LeaderboardFindResult_t	size(16):
1>	+---
1> 0	| m_hSteamLeaderboard
1> 8	| m_bLeaderboardFound
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class LeaderboardScoresDownloaded_t	size(24):
1>	+---
1> 0	| m_hSteamLeaderboard
1> 8	| m_hSteamLeaderboardEntries
1>16	| m_cEntryCount
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class LeaderboardScoreUploaded_t	size(32):
1>	+---
1> 0	| m_bSuccess
1>  	| <alignment member> (size=7)
1> 8	| m_hSteamLeaderboard
1>16	| m_nScore
1>20	| m_bScoreChanged
1>  	| <alignment member> (size=3)
1>24	| m_nGlobalRankNew
1>28	| m_nGlobalRankPrevious
1>	+---
1>
1>class NumberOfCurrentPlayers_t	size(8):
1>	+---
1> 0	| m_bSuccess
1>  	| <alignment member> (size=3)
1> 4	| m_cPlayers
1>	+---
1>
1>class UserStatsUnloaded_t	size(8):
1>	+---
1> 0	| CSteamID m_steamIDUser
1>	+---
1>
1>class UserAchievementIconFetched_t	size(144):
1>	+---
1> 0	| CGameID m_nGameID
1> 8	| m_rgchAchievementName
1>136	| m_bAchieved
1>  	| <alignment member> (size=3)
1>140	| m_nIconHandle
1>	+---
1>
1>class GlobalAchievementPercentagesReady_t	size(16):
1>	+---
1> 0	| m_nGameID
1> 8	| EResult m_eResult
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class LeaderboardUGCSet_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_hSteamLeaderboard
1>	+---
1>
1>class PS3TrophiesInstalled_t	size(24):
1>	+---
1> 0	| m_nGameID
1> 8	| EResult m_eResult
1>  	| <alignment member> (size=4)
1>16	| m_ulRequiredDiskSpace
1>	+---
1>
1>class GlobalStatsReceived_t	size(16):
1>	+---
1> 0	| m_nGameID
1> 8	| EResult m_eResult
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class ISteamApps	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamApps::$vftable@:
1>	| &ISteamApps_meta
1>	|  0
1> 0	| &ISteamApps::BIsSubscribed
1> 1	| &ISteamApps::BIsLowViolence
1> 2	| &ISteamApps::BIsCybercafe
1> 3	| &ISteamApps::BIsVACBanned
1> 4	| &ISteamApps::GetCurrentGameLanguage
1> 5	| &ISteamApps::GetAvailableGameLanguages
1> 6	| &ISteamApps::BIsSubscribedApp
1> 7	| &ISteamApps::BIsDlcInstalled
1> 8	| &ISteamApps::GetEarliestPurchaseUnixTime
1> 9	| &ISteamApps::BIsSubscribedFromFreeWeekend
1>10	| &ISteamApps::GetDLCCount
1>11	| &ISteamApps::BGetDLCDataByIndex
1>12	| &ISteamApps::InstallDLC
1>13	| &ISteamApps::UninstallDLC
1>14	| &ISteamApps::RequestAppProofOfPurchaseKey
1>15	| &ISteamApps::GetCurrentBetaName
1>16	| &ISteamApps::MarkContentCorrupt
1>17	| &ISteamApps::GetInstalledDepots
1>18	| &ISteamApps::GetAppInstallDir
1>19	| &ISteamApps::BIsAppInstalled
1>20	| &ISteamApps::GetAppOwner
1>21	| &ISteamApps::GetLaunchQueryParam
1>22	| &ISteamApps::GetDlcDownloadProgress
1>23	| &ISteamApps::GetAppBuildId
1>24	| &ISteamApps::RequestAllProofOfPurchaseKeys
1>25	| &ISteamApps::GetFileDetails
1>
1>ISteamApps::BIsSubscribed this adjustor: 0
1>ISteamApps::BIsLowViolence this adjustor: 0
1>ISteamApps::BIsCybercafe this adjustor: 0
1>ISteamApps::BIsVACBanned this adjustor: 0
1>ISteamApps::GetCurrentGameLanguage this adjustor: 0
1>ISteamApps::GetAvailableGameLanguages this adjustor: 0
1>ISteamApps::BIsSubscribedApp this adjustor: 0
1>ISteamApps::BIsDlcInstalled this adjustor: 0
1>ISteamApps::GetEarliestPurchaseUnixTime this adjustor: 0
1>ISteamApps::BIsSubscribedFromFreeWeekend this adjustor: 0
1>ISteamApps::GetDLCCount this adjustor: 0
1>ISteamApps::BGetDLCDataByIndex this adjustor: 0
1>ISteamApps::InstallDLC this adjustor: 0
1>ISteamApps::UninstallDLC this adjustor: 0
1>ISteamApps::RequestAppProofOfPurchaseKey this adjustor: 0
1>ISteamApps::GetCurrentBetaName this adjustor: 0
1>ISteamApps::MarkContentCorrupt this adjustor: 0
1>ISteamApps::GetInstalledDepots this adjustor: 0
1>ISteamApps::GetAppInstallDir this adjustor: 0
1>ISteamApps::BIsAppInstalled this adjustor: 0
1>ISteamApps::GetAppOwner this adjustor: 0
1>ISteamApps::GetLaunchQueryParam this adjustor: 0
1>ISteamApps::GetDlcDownloadProgress this adjustor: 0
1>ISteamApps::GetAppBuildId this adjustor: 0
1>ISteamApps::RequestAllProofOfPurchaseKeys this adjustor: 0
1>ISteamApps::GetFileDetails this adjustor: 0
1>
1>class DlcInstalled_t	size(4):
1>	+---
1> 0	| m_nAppID
1>	+---
1>
1>class RegisterActivationCodeResponse_t	size(8):
1>	+---
1> 0	| ERegisterActivationCodeResult m_eResult
1> 4	| m_unPackageRegistered
1>	+---
1>
1>class NewLaunchQueryParameters_t	size(1):
1>	+---
1>	+---
1>
1>class AppProofOfPurchaseKeyResponse_t	size(252):
1>	+---
1> 0	| EResult m_eResult
1> 4	| m_nAppID
1> 8	| m_cchKeyLength
1>12	| m_rgchKey
1>	+---
1>
1>class FileDetailsResult_t	size(40):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_ulFileSize
1>16	| m_FileSHA
1>36	| m_unFlags
1>	+---
1>
1>class P2PSessionState_t	size(20):
1>	+---
1> 0	| m_bConnectionActive
1> 1	| m_bConnecting
1> 2	| m_eP2PSessionError
1> 3	| m_bUsingRelay
1> 4	| m_nBytesQueuedForSend
1> 8	| m_nPacketsQueuedForSend
1>12	| m_nRemoteIP
1>16	| m_nRemotePort
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class ISteamNetworking	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamNetworking::$vftable@:
1>	| &ISteamNetworking_meta
1>	|  0
1> 0	| &ISteamNetworking::SendP2PPacket
1> 1	| &ISteamNetworking::IsP2PPacketAvailable
1> 2	| &ISteamNetworking::ReadP2PPacket
1> 3	| &ISteamNetworking::AcceptP2PSessionWithUser
1> 4	| &ISteamNetworking::CloseP2PSessionWithUser
1> 5	| &ISteamNetworking::CloseP2PChannelWithUser
1> 6	| &ISteamNetworking::GetP2PSessionState
1> 7	| &ISteamNetworking::AllowP2PPacketRelay
1> 8	| &ISteamNetworking::CreateListenSocket
1> 9	| &ISteamNetworking::CreateP2PConnectionSocket
1>10	| &ISteamNetworking::CreateConnectionSocket
1>11	| &ISteamNetworking::DestroySocket
1>12	| &ISteamNetworking::DestroyListenSocket
1>13	| &ISteamNetworking::SendDataOnSocket
1>14	| &ISteamNetworking::IsDataAvailableOnSocket
1>15	| &ISteamNetworking::RetrieveDataFromSocket
1>16	| &ISteamNetworking::IsDataAvailable
1>17	| &ISteamNetworking::RetrieveData
1>18	| &ISteamNetworking::GetSocketInfo
1>19	| &ISteamNetworking::GetListenSocketInfo
1>20	| &ISteamNetworking::GetSocketConnectionType
1>21	| &ISteamNetworking::GetMaxPacketSize
1>
1>ISteamNetworking::SendP2PPacket this adjustor: 0
1>ISteamNetworking::IsP2PPacketAvailable this adjustor: 0
1>ISteamNetworking::ReadP2PPacket this adjustor: 0
1>ISteamNetworking::AcceptP2PSessionWithUser this adjustor: 0
1>ISteamNetworking::CloseP2PSessionWithUser this adjustor: 0
1>ISteamNetworking::CloseP2PChannelWithUser this adjustor: 0
1>ISteamNetworking::GetP2PSessionState this adjustor: 0
1>ISteamNetworking::AllowP2PPacketRelay this adjustor: 0
1>ISteamNetworking::CreateListenSocket this adjustor: 0
1>ISteamNetworking::CreateP2PConnectionSocket this adjustor: 0
1>ISteamNetworking::CreateConnectionSocket this adjustor: 0
1>ISteamNetworking::DestroySocket this adjustor: 0
1>ISteamNetworking::DestroyListenSocket this adjustor: 0
1>ISteamNetworking::SendDataOnSocket this adjustor: 0
1>ISteamNetworking::IsDataAvailableOnSocket this adjustor: 0
1>ISteamNetworking::RetrieveDataFromSocket this adjustor: 0
1>ISteamNetworking::IsDataAvailable this adjustor: 0
1>ISteamNetworking::RetrieveData this adjustor: 0
1>ISteamNetworking::GetSocketInfo this adjustor: 0
1>ISteamNetworking::GetListenSocketInfo this adjustor: 0
1>ISteamNetworking::GetSocketConnectionType this adjustor: 0
1>ISteamNetworking::GetMaxPacketSize this adjustor: 0
1>
1>class P2PSessionRequest_t	size(8):
1>	+---
1> 0	| CSteamID m_steamIDRemote
1>	+---
1>
1>class P2PSessionConnectFail_t	size(9):
1>	+---
1> 0	| CSteamID m_steamIDRemote
1> 8	| m_eP2PSessionError
1>	+---
1>
1>class SocketStatusCallback_t	size(20):
1>	+---
1> 0	| m_hSocket
1> 4	| m_hListenSocket
1> 8	| CSteamID m_steamIDRemote
1>16	| m_eSNetSocketState
1>	+---
1>
1>class ISteamScreenshots	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamScreenshots::$vftable@:
1>	| &ISteamScreenshots_meta
1>	|  0
1> 0	| &ISteamScreenshots::WriteScreenshot
1> 1	| &ISteamScreenshots::AddScreenshotToLibrary
1> 2	| &ISteamScreenshots::TriggerScreenshot
1> 3	| &ISteamScreenshots::HookScreenshots
1> 4	| &ISteamScreenshots::SetLocation
1> 5	| &ISteamScreenshots::TagUser
1> 6	| &ISteamScreenshots::TagPublishedFile
1> 7	| &ISteamScreenshots::IsScreenshotsHooked
1> 8	| &ISteamScreenshots::AddVRScreenshotToLibrary
1>
1>ISteamScreenshots::WriteScreenshot this adjustor: 0
1>ISteamScreenshots::AddScreenshotToLibrary this adjustor: 0
1>ISteamScreenshots::TriggerScreenshot this adjustor: 0
1>ISteamScreenshots::HookScreenshots this adjustor: 0
1>ISteamScreenshots::SetLocation this adjustor: 0
1>ISteamScreenshots::TagUser this adjustor: 0
1>ISteamScreenshots::TagPublishedFile this adjustor: 0
1>ISteamScreenshots::IsScreenshotsHooked this adjustor: 0
1>ISteamScreenshots::AddVRScreenshotToLibrary this adjustor: 0
1>
1>class ScreenshotReady_t	size(8):
1>	+---
1> 0	| m_hLocal
1> 4	| EResult m_eResult
1>	+---
1>
1>class ScreenshotRequested_t	size(1):
1>	+---
1>	+---
1>
1>class ISteamMusic	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamMusic::$vftable@:
1>	| &ISteamMusic_meta
1>	|  0
1> 0	| &ISteamMusic::BIsEnabled
1> 1	| &ISteamMusic::BIsPlaying
1> 2	| &ISteamMusic::GetPlaybackStatus
1> 3	| &ISteamMusic::Play
1> 4	| &ISteamMusic::Pause
1> 5	| &ISteamMusic::PlayPrevious
1> 6	| &ISteamMusic::PlayNext
1> 7	| &ISteamMusic::SetVolume
1> 8	| &ISteamMusic::GetVolume
1>
1>ISteamMusic::BIsEnabled this adjustor: 0
1>ISteamMusic::BIsPlaying this adjustor: 0
1>ISteamMusic::GetPlaybackStatus this adjustor: 0
1>ISteamMusic::Play this adjustor: 0
1>ISteamMusic::Pause this adjustor: 0
1>ISteamMusic::PlayPrevious this adjustor: 0
1>ISteamMusic::PlayNext this adjustor: 0
1>ISteamMusic::SetVolume this adjustor: 0
1>ISteamMusic::GetVolume this adjustor: 0
1>
1>class PlaybackStatusHasChanged_t	size(1):
1>	+---
1>	+---
1>
1>class VolumeHasChanged_t	size(4):
1>	+---
1> 0	| m_flNewVolume
1>	+---
1>
1>class ISteamMusicRemote	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamMusicRemote::$vftable@:
1>	| &ISteamMusicRemote_meta
1>	|  0
1> 0	| &ISteamMusicRemote::RegisterSteamMusicRemote
1> 1	| &ISteamMusicRemote::DeregisterSteamMusicRemote
1> 2	| &ISteamMusicRemote::BIsCurrentMusicRemote
1> 3	| &ISteamMusicRemote::BActivationSuccess
1> 4	| &ISteamMusicRemote::SetDisplayName
1> 5	| &ISteamMusicRemote::SetPNGIcon_64x64
1> 6	| &ISteamMusicRemote::EnablePlayPrevious
1> 7	| &ISteamMusicRemote::EnablePlayNext
1> 8	| &ISteamMusicRemote::EnableShuffled
1> 9	| &ISteamMusicRemote::EnableLooped
1>10	| &ISteamMusicRemote::EnableQueue
1>11	| &ISteamMusicRemote::EnablePlaylists
1>12	| &ISteamMusicRemote::UpdatePlaybackStatus
1>13	| &ISteamMusicRemote::UpdateShuffled
1>14	| &ISteamMusicRemote::UpdateLooped
1>15	| &ISteamMusicRemote::UpdateVolume
1>16	| &ISteamMusicRemote::CurrentEntryWillChange
1>17	| &ISteamMusicRemote::CurrentEntryIsAvailable
1>18	| &ISteamMusicRemote::UpdateCurrentEntryText
1>19	| &ISteamMusicRemote::UpdateCurrentEntryElapsedSeconds
1>20	| &ISteamMusicRemote::UpdateCurrentEntryCoverArt
1>21	| &ISteamMusicRemote::CurrentEntryDidChange
1>22	| &ISteamMusicRemote::QueueWillChange
1>23	| &ISteamMusicRemote::ResetQueueEntries
1>24	| &ISteamMusicRemote::SetQueueEntry
1>25	| &ISteamMusicRemote::SetCurrentQueueEntry
1>26	| &ISteamMusicRemote::QueueDidChange
1>27	| &ISteamMusicRemote::PlaylistWillChange
1>28	| &ISteamMusicRemote::ResetPlaylistEntries
1>29	| &ISteamMusicRemote::SetPlaylistEntry
1>30	| &ISteamMusicRemote::SetCurrentPlaylistEntry
1>31	| &ISteamMusicRemote::PlaylistDidChange
1>
1>ISteamMusicRemote::RegisterSteamMusicRemote this adjustor: 0
1>ISteamMusicRemote::DeregisterSteamMusicRemote this adjustor: 0
1>ISteamMusicRemote::BIsCurrentMusicRemote this adjustor: 0
1>ISteamMusicRemote::BActivationSuccess this adjustor: 0
1>ISteamMusicRemote::SetDisplayName this adjustor: 0
1>ISteamMusicRemote::SetPNGIcon_64x64 this adjustor: 0
1>ISteamMusicRemote::EnablePlayPrevious this adjustor: 0
1>ISteamMusicRemote::EnablePlayNext this adjustor: 0
1>ISteamMusicRemote::EnableShuffled this adjustor: 0
1>ISteamMusicRemote::EnableLooped this adjustor: 0
1>ISteamMusicRemote::EnableQueue this adjustor: 0
1>ISteamMusicRemote::EnablePlaylists this adjustor: 0
1>ISteamMusicRemote::UpdatePlaybackStatus this adjustor: 0
1>ISteamMusicRemote::UpdateShuffled this adjustor: 0
1>ISteamMusicRemote::UpdateLooped this adjustor: 0
1>ISteamMusicRemote::UpdateVolume this adjustor: 0
1>ISteamMusicRemote::CurrentEntryWillChange this adjustor: 0
1>ISteamMusicRemote::CurrentEntryIsAvailable this adjustor: 0
1>ISteamMusicRemote::UpdateCurrentEntryText this adjustor: 0
1>ISteamMusicRemote::UpdateCurrentEntryElapsedSeconds this adjustor: 0
1>ISteamMusicRemote::UpdateCurrentEntryCoverArt this adjustor: 0
1>ISteamMusicRemote::CurrentEntryDidChange this adjustor: 0
1>ISteamMusicRemote::QueueWillChange this adjustor: 0
1>ISteamMusicRemote::ResetQueueEntries this adjustor: 0
1>ISteamMusicRemote::SetQueueEntry this adjustor: 0
1>ISteamMusicRemote::SetCurrentQueueEntry this adjustor: 0
1>ISteamMusicRemote::QueueDidChange this adjustor: 0
1>ISteamMusicRemote::PlaylistWillChange this adjustor: 0
1>ISteamMusicRemote::ResetPlaylistEntries this adjustor: 0
1>ISteamMusicRemote::SetPlaylistEntry this adjustor: 0
1>ISteamMusicRemote::SetCurrentPlaylistEntry this adjustor: 0
1>ISteamMusicRemote::PlaylistDidChange this adjustor: 0
1>
1>class MusicPlayerRemoteWillActivate_t	size(1):
1>	+---
1>	+---
1>
1>class MusicPlayerRemoteWillDeactivate_t	size(1):
1>	+---
1>	+---
1>
1>class MusicPlayerRemoteToFront_t	size(1):
1>	+---
1>	+---
1>
1>class MusicPlayerWillQuit_t	size(1):
1>	+---
1>	+---
1>
1>class MusicPlayerWantsPlay_t	size(1):
1>	+---
1>	+---
1>
1>class MusicPlayerWantsPause_t	size(1):
1>	+---
1>	+---
1>
1>class MusicPlayerWantsPlayPrevious_t	size(1):
1>	+---
1>	+---
1>
1>class MusicPlayerWantsPlayNext_t	size(1):
1>	+---
1>	+---
1>
1>class MusicPlayerWantsShuffled_t	size(1):
1>	+---
1> 0	| m_bShuffled
1>	+---
1>
1>class MusicPlayerWantsLooped_t	size(1):
1>	+---
1> 0	| m_bLooped
1>	+---
1>
1>class MusicPlayerWantsVolume_t	size(4):
1>	+---
1> 0	| m_flNewVolume
1>	+---
1>
1>class MusicPlayerSelectsQueueEntry_t	size(4):
1>	+---
1> 0	| nID
1>	+---
1>
1>class MusicPlayerSelectsPlaylistEntry_t	size(4):
1>	+---
1> 0	| nID
1>	+---
1>
1>class MusicPlayerWantsPlayingRepeatStatus_t	size(4):
1>	+---
1> 0	| m_nPlayingRepeatStatus
1>	+---
1>
1>class ISteamHTTP	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamHTTP::$vftable@:
1>	| &ISteamHTTP_meta
1>	|  0
1> 0	| &ISteamHTTP::CreateHTTPRequest
1> 1	| &ISteamHTTP::SetHTTPRequestContextValue
1> 2	| &ISteamHTTP::SetHTTPRequestNetworkActivityTimeout
1> 3	| &ISteamHTTP::SetHTTPRequestHeaderValue
1> 4	| &ISteamHTTP::SetHTTPRequestGetOrPostParameter
1> 5	| &ISteamHTTP::SendHTTPRequest
1> 6	| &ISteamHTTP::SendHTTPRequestAndStreamResponse
1> 7	| &ISteamHTTP::DeferHTTPRequest
1> 8	| &ISteamHTTP::PrioritizeHTTPRequest
1> 9	| &ISteamHTTP::GetHTTPResponseHeaderSize
1>10	| &ISteamHTTP::GetHTTPResponseHeaderValue
1>11	| &ISteamHTTP::GetHTTPResponseBodySize
1>12	| &ISteamHTTP::GetHTTPResponseBodyData
1>13	| &ISteamHTTP::GetHTTPStreamingResponseBodyData
1>14	| &ISteamHTTP::ReleaseHTTPRequest
1>15	| &ISteamHTTP::GetHTTPDownloadProgressPct
1>16	| &ISteamHTTP::SetHTTPRequestRawPostBody
1>17	| &ISteamHTTP::CreateCookieContainer
1>18	| &ISteamHTTP::ReleaseCookieContainer
1>19	| &ISteamHTTP::SetCookie
1>20	| &ISteamHTTP::SetHTTPRequestCookieContainer
1>21	| &ISteamHTTP::SetHTTPRequestUserAgentInfo
1>22	| &ISteamHTTP::SetHTTPRequestRequiresVerifiedCertificate
1>23	| &ISteamHTTP::SetHTTPRequestAbsoluteTimeoutMS
1>24	| &ISteamHTTP::GetHTTPRequestWasTimedOut
1>
1>ISteamHTTP::CreateHTTPRequest this adjustor: 0
1>ISteamHTTP::SetHTTPRequestContextValue this adjustor: 0
1>ISteamHTTP::SetHTTPRequestNetworkActivityTimeout this adjustor: 0
1>ISteamHTTP::SetHTTPRequestHeaderValue this adjustor: 0
1>ISteamHTTP::SetHTTPRequestGetOrPostParameter this adjustor: 0
1>ISteamHTTP::SendHTTPRequest this adjustor: 0
1>ISteamHTTP::SendHTTPRequestAndStreamResponse this adjustor: 0
1>ISteamHTTP::DeferHTTPRequest this adjustor: 0
1>ISteamHTTP::PrioritizeHTTPRequest this adjustor: 0
1>ISteamHTTP::GetHTTPResponseHeaderSize this adjustor: 0
1>ISteamHTTP::GetHTTPResponseHeaderValue this adjustor: 0
1>ISteamHTTP::GetHTTPResponseBodySize this adjustor: 0
1>ISteamHTTP::GetHTTPResponseBodyData this adjustor: 0
1>ISteamHTTP::GetHTTPStreamingResponseBodyData this adjustor: 0
1>ISteamHTTP::ReleaseHTTPRequest this adjustor: 0
1>ISteamHTTP::GetHTTPDownloadProgressPct this adjustor: 0
1>ISteamHTTP::SetHTTPRequestRawPostBody this adjustor: 0
1>ISteamHTTP::CreateCookieContainer this adjustor: 0
1>ISteamHTTP::ReleaseCookieContainer this adjustor: 0
1>ISteamHTTP::SetCookie this adjustor: 0
1>ISteamHTTP::SetHTTPRequestCookieContainer this adjustor: 0
1>ISteamHTTP::SetHTTPRequestUserAgentInfo this adjustor: 0
1>ISteamHTTP::SetHTTPRequestRequiresVerifiedCertificate this adjustor: 0
1>ISteamHTTP::SetHTTPRequestAbsoluteTimeoutMS this adjustor: 0
1>ISteamHTTP::GetHTTPRequestWasTimedOut this adjustor: 0
1>
1>class HTTPRequestCompleted_t	size(32):
1>	+---
1> 0	| m_hRequest
1>  	| <alignment member> (size=4)
1> 8	| m_ulContextValue
1>16	| m_bRequestSuccessful
1>  	| <alignment member> (size=3)
1>20	| EHTTPStatusCode m_eStatusCode
1>24	| m_unBodySize
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class HTTPRequestHeadersReceived_t	size(16):
1>	+---
1> 0	| m_hRequest
1>  	| <alignment member> (size=4)
1> 8	| m_ulContextValue
1>	+---
1>
1>class HTTPRequestDataReceived_t	size(24):
1>	+---
1> 0	| m_hRequest
1>  	| <alignment member> (size=4)
1> 8	| m_ulContextValue
1>16	| m_cOffset
1>20	| m_cBytesReceived
1>	+---
1>
1>class ControllerAnalogActionData_t	size(13):
1>	+---
1> 0	| EControllerSourceMode eMode
1> 4	| x
1> 8	| y
1>12	| bActive
1>	+---
1>
1>class ControllerDigitalActionData_t	size(2):
1>	+---
1> 0	| bState
1> 1	| bActive
1>	+---
1>
1>class ControllerMotionData_t	size(40):
1>	+---
1> 0	| rotQuatX
1> 4	| rotQuatY
1> 8	| rotQuatZ
1>12	| rotQuatW
1>16	| posAccelX
1>20	| posAccelY
1>24	| posAccelZ
1>28	| rotVelX
1>32	| rotVelY
1>36	| rotVelZ
1>	+---
1>
1>class ISteamController	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamController::$vftable@:
1>	| &ISteamController_meta
1>	|  0
1> 0	| &ISteamController::Init
1> 1	| &ISteamController::Shutdown
1> 2	| &ISteamController::RunFrame
1> 3	| &ISteamController::GetConnectedControllers
1> 4	| &ISteamController::ShowBindingPanel
1> 5	| &ISteamController::GetActionSetHandle
1> 6	| &ISteamController::ActivateActionSet
1> 7	| &ISteamController::GetCurrentActionSet
1> 8	| &ISteamController::ActivateActionSetLayer
1> 9	| &ISteamController::DeactivateActionSetLayer
1>10	| &ISteamController::DeactivateAllActionSetLayers
1>11	| &ISteamController::GetActiveActionSetLayers
1>12	| &ISteamController::GetDigitalActionHandle
1>13	| &ISteamController::GetDigitalActionData
1>14	| &ISteamController::GetDigitalActionOrigins
1>15	| &ISteamController::GetAnalogActionHandle
1>16	| &ISteamController::GetAnalogActionData
1>17	| &ISteamController::GetAnalogActionOrigins
1>18	| &ISteamController::StopAnalogActionMomentum
1>19	| &ISteamController::TriggerHapticPulse
1>20	| &ISteamController::TriggerRepeatedHapticPulse
1>21	| &ISteamController::TriggerVibration
1>22	| &ISteamController::SetLEDColor
1>23	| &ISteamController::GetGamepadIndexForController
1>24	| &ISteamController::GetControllerForGamepadIndex
1>25	| &ISteamController::GetMotionData
1>26	| &ISteamController::ShowDigitalActionOrigins
1>27	| &ISteamController::ShowAnalogActionOrigins
1>28	| &ISteamController::GetStringForActionOrigin
1>29	| &ISteamController::GetGlyphForActionOrigin
1>30	| &ISteamController::GetInputTypeForHandle
1>
1>ISteamController::Init this adjustor: 0
1>ISteamController::Shutdown this adjustor: 0
1>ISteamController::RunFrame this adjustor: 0
1>ISteamController::GetConnectedControllers this adjustor: 0
1>ISteamController::ShowBindingPanel this adjustor: 0
1>ISteamController::GetActionSetHandle this adjustor: 0
1>ISteamController::ActivateActionSet this adjustor: 0
1>ISteamController::GetCurrentActionSet this adjustor: 0
1>ISteamController::ActivateActionSetLayer this adjustor: 0
1>ISteamController::DeactivateActionSetLayer this adjustor: 0
1>ISteamController::DeactivateAllActionSetLayers this adjustor: 0
1>ISteamController::GetActiveActionSetLayers this adjustor: 0
1>ISteamController::GetDigitalActionHandle this adjustor: 0
1>ISteamController::GetDigitalActionData this adjustor: 0
1>ISteamController::GetDigitalActionOrigins this adjustor: 0
1>ISteamController::GetAnalogActionHandle this adjustor: 0
1>ISteamController::GetAnalogActionData this adjustor: 0
1>ISteamController::GetAnalogActionOrigins this adjustor: 0
1>ISteamController::StopAnalogActionMomentum this adjustor: 0
1>ISteamController::TriggerHapticPulse this adjustor: 0
1>ISteamController::TriggerRepeatedHapticPulse this adjustor: 0
1>ISteamController::TriggerVibration this adjustor: 0
1>ISteamController::SetLEDColor this adjustor: 0
1>ISteamController::GetGamepadIndexForController this adjustor: 0
1>ISteamController::GetControllerForGamepadIndex this adjustor: 0
1>ISteamController::GetMotionData this adjustor: 0
1>ISteamController::ShowDigitalActionOrigins this adjustor: 0
1>ISteamController::ShowAnalogActionOrigins this adjustor: 0
1>ISteamController::GetStringForActionOrigin this adjustor: 0
1>ISteamController::GetGlyphForActionOrigin this adjustor: 0
1>ISteamController::GetInputTypeForHandle this adjustor: 0
1>
1>class SteamUGCDetails_t	size(9776):
1>	+---
1> 0	| m_nPublishedFileId
1> 8	| EResult m_eResult
1>12	| EWorkshopFileType m_eFileType
1>16	| m_nCreatorAppID
1>20	| m_nConsumerAppID
1>24	| m_rgchTitle
1>153	| m_rgchDescription
1>  	| <alignment member> (size=7)
1>8160	| m_ulSteamIDOwner
1>8168	| m_rtimeCreated
1>8172	| m_rtimeUpdated
1>8176	| m_rtimeAddedToUserList
1>8180	| ERemoteStoragePublishedFileVisibility m_eVisibility
1>8184	| m_bBanned
1>8185	| m_bAcceptedForUse
1>8186	| m_bTagsTruncated
1>8187	| m_rgchTags
1>  	| <alignment member> (size=4)
1>9216	| m_hFile
1>9224	| m_hPreviewFile
1>9232	| m_pchFileName
1>9492	| m_nFileSize
1>9496	| m_nPreviewFileSize
1>9500	| m_rgchURL
1>9756	| m_unVotesUp
1>9760	| m_unVotesDown
1>9764	| m_flScore
1>9768	| m_unNumChildren
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class ISteamUGC	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamUGC::$vftable@:
1>	| &ISteamUGC_meta
1>	|  0
1> 0	| &ISteamUGC::CreateQueryUserUGCRequest
1> 1	| &ISteamUGC::CreateQueryAllUGCRequest
1> 2	| &ISteamUGC::CreateQueryUGCDetailsRequest
1> 3	| &ISteamUGC::SendQueryUGCRequest
1> 4	| &ISteamUGC::GetQueryUGCResult
1> 5	| &ISteamUGC::GetQueryUGCPreviewURL
1> 6	| &ISteamUGC::GetQueryUGCMetadata
1> 7	| &ISteamUGC::GetQueryUGCChildren
1> 8	| &ISteamUGC::GetQueryUGCStatistic
1> 9	| &ISteamUGC::GetQueryUGCNumAdditionalPreviews
1>10	| &ISteamUGC::GetQueryUGCAdditionalPreview
1>11	| &ISteamUGC::GetQueryUGCNumKeyValueTags
1>12	| &ISteamUGC::GetQueryUGCKeyValueTag
1>13	| &ISteamUGC::ReleaseQueryUGCRequest
1>14	| &ISteamUGC::AddRequiredTag
1>15	| &ISteamUGC::AddExcludedTag
1>16	| &ISteamUGC::SetReturnOnlyIDs
1>17	| &ISteamUGC::SetReturnKeyValueTags
1>18	| &ISteamUGC::SetReturnLongDescription
1>19	| &ISteamUGC::SetReturnMetadata
1>20	| &ISteamUGC::SetReturnChildren
1>21	| &ISteamUGC::SetReturnAdditionalPreviews
1>22	| &ISteamUGC::SetReturnTotalOnly
1>23	| &ISteamUGC::SetReturnPlaytimeStats
1>24	| &ISteamUGC::SetLanguage
1>25	| &ISteamUGC::SetAllowCachedResponse
1>26	| &ISteamUGC::SetCloudFileNameFilter
1>27	| &ISteamUGC::SetMatchAnyTag
1>28	| &ISteamUGC::SetSearchText
1>29	| &ISteamUGC::SetRankedByTrendDays
1>30	| &ISteamUGC::AddRequiredKeyValueTag
1>31	| &ISteamUGC::RequestUGCDetails
1>32	| &ISteamUGC::CreateItem
1>33	| &ISteamUGC::StartItemUpdate
1>34	| &ISteamUGC::SetItemTitle
1>35	| &ISteamUGC::SetItemDescription
1>36	| &ISteamUGC::SetItemUpdateLanguage
1>37	| &ISteamUGC::SetItemMetadata
1>38	| &ISteamUGC::SetItemVisibility
1>39	| &ISteamUGC::SetItemTags
1>40	| &ISteamUGC::SetItemContent
1>41	| &ISteamUGC::SetItemPreview
1>42	| &ISteamUGC::RemoveItemKeyValueTags
1>43	| &ISteamUGC::AddItemKeyValueTag
1>44	| &ISteamUGC::AddItemPreviewFile
1>45	| &ISteamUGC::AddItemPreviewVideo
1>46	| &ISteamUGC::UpdateItemPreviewFile
1>47	| &ISteamUGC::UpdateItemPreviewVideo
1>48	| &ISteamUGC::RemoveItemPreview
1>49	| &ISteamUGC::SubmitItemUpdate
1>50	| &ISteamUGC::GetItemUpdateProgress
1>51	| &ISteamUGC::SetUserItemVote
1>52	| &ISteamUGC::GetUserItemVote
1>53	| &ISteamUGC::AddItemToFavorites
1>54	| &ISteamUGC::RemoveItemFromFavorites
1>55	| &ISteamUGC::SubscribeItem
1>56	| &ISteamUGC::UnsubscribeItem
1>57	| &ISteamUGC::GetNumSubscribedItems
1>58	| &ISteamUGC::GetSubscribedItems
1>59	| &ISteamUGC::GetItemState
1>60	| &ISteamUGC::GetItemInstallInfo
1>61	| &ISteamUGC::GetItemDownloadInfo
1>62	| &ISteamUGC::DownloadItem
1>63	| &ISteamUGC::BInitWorkshopForGameServer
1>64	| &ISteamUGC::SuspendDownloads
1>65	| &ISteamUGC::StartPlaytimeTracking
1>66	| &ISteamUGC::StopPlaytimeTracking
1>67	| &ISteamUGC::StopPlaytimeTrackingForAllItems
1>68	| &ISteamUGC::AddDependency
1>69	| &ISteamUGC::RemoveDependency
1>70	| &ISteamUGC::AddAppDependency
1>71	| &ISteamUGC::RemoveAppDependency
1>72	| &ISteamUGC::GetAppDependencies
1>73	| &ISteamUGC::DeleteItem
1>
1>ISteamUGC::CreateQueryUserUGCRequest this adjustor: 0
1>ISteamUGC::CreateQueryAllUGCRequest this adjustor: 0
1>ISteamUGC::CreateQueryUGCDetailsRequest this adjustor: 0
1>ISteamUGC::SendQueryUGCRequest this adjustor: 0
1>ISteamUGC::GetQueryUGCResult this adjustor: 0
1>ISteamUGC::GetQueryUGCPreviewURL this adjustor: 0
1>ISteamUGC::GetQueryUGCMetadata this adjustor: 0
1>ISteamUGC::GetQueryUGCChildren this adjustor: 0
1>ISteamUGC::GetQueryUGCStatistic this adjustor: 0
1>ISteamUGC::GetQueryUGCNumAdditionalPreviews this adjustor: 0
1>ISteamUGC::GetQueryUGCAdditionalPreview this adjustor: 0
1>ISteamUGC::GetQueryUGCNumKeyValueTags this adjustor: 0
1>ISteamUGC::GetQueryUGCKeyValueTag this adjustor: 0
1>ISteamUGC::ReleaseQueryUGCRequest this adjustor: 0
1>ISteamUGC::AddRequiredTag this adjustor: 0
1>ISteamUGC::AddExcludedTag this adjustor: 0
1>ISteamUGC::SetReturnOnlyIDs this adjustor: 0
1>ISteamUGC::SetReturnKeyValueTags this adjustor: 0
1>ISteamUGC::SetReturnLongDescription this adjustor: 0
1>ISteamUGC::SetReturnMetadata this adjustor: 0
1>ISteamUGC::SetReturnChildren this adjustor: 0
1>ISteamUGC::SetReturnAdditionalPreviews this adjustor: 0
1>ISteamUGC::SetReturnTotalOnly this adjustor: 0
1>ISteamUGC::SetReturnPlaytimeStats this adjustor: 0
1>ISteamUGC::SetLanguage this adjustor: 0
1>ISteamUGC::SetAllowCachedResponse this adjustor: 0
1>ISteamUGC::SetCloudFileNameFilter this adjustor: 0
1>ISteamUGC::SetMatchAnyTag this adjustor: 0
1>ISteamUGC::SetSearchText this adjustor: 0
1>ISteamUGC::SetRankedByTrendDays this adjustor: 0
1>ISteamUGC::AddRequiredKeyValueTag this adjustor: 0
1>ISteamUGC::RequestUGCDetails this adjustor: 0
1>ISteamUGC::CreateItem this adjustor: 0
1>ISteamUGC::StartItemUpdate this adjustor: 0
1>ISteamUGC::SetItemTitle this adjustor: 0
1>ISteamUGC::SetItemDescription this adjustor: 0
1>ISteamUGC::SetItemUpdateLanguage this adjustor: 0
1>ISteamUGC::SetItemMetadata this adjustor: 0
1>ISteamUGC::SetItemVisibility this adjustor: 0
1>ISteamUGC::SetItemTags this adjustor: 0
1>ISteamUGC::SetItemContent this adjustor: 0
1>ISteamUGC::SetItemPreview this adjustor: 0
1>ISteamUGC::RemoveItemKeyValueTags this adjustor: 0
1>ISteamUGC::AddItemKeyValueTag this adjustor: 0
1>ISteamUGC::AddItemPreviewFile this adjustor: 0
1>ISteamUGC::AddItemPreviewVideo this adjustor: 0
1>ISteamUGC::UpdateItemPreviewFile this adjustor: 0
1>ISteamUGC::UpdateItemPreviewVideo this adjustor: 0
1>ISteamUGC::RemoveItemPreview this adjustor: 0
1>ISteamUGC::SubmitItemUpdate this adjustor: 0
1>ISteamUGC::GetItemUpdateProgress this adjustor: 0
1>ISteamUGC::SetUserItemVote this adjustor: 0
1>ISteamUGC::GetUserItemVote this adjustor: 0
1>ISteamUGC::AddItemToFavorites this adjustor: 0
1>ISteamUGC::RemoveItemFromFavorites this adjustor: 0
1>ISteamUGC::SubscribeItem this adjustor: 0
1>ISteamUGC::UnsubscribeItem this adjustor: 0
1>ISteamUGC::GetNumSubscribedItems this adjustor: 0
1>ISteamUGC::GetSubscribedItems this adjustor: 0
1>ISteamUGC::GetItemState this adjustor: 0
1>ISteamUGC::GetItemInstallInfo this adjustor: 0
1>ISteamUGC::GetItemDownloadInfo this adjustor: 0
1>ISteamUGC::DownloadItem this adjustor: 0
1>ISteamUGC::BInitWorkshopForGameServer this adjustor: 0
1>ISteamUGC::SuspendDownloads this adjustor: 0
1>ISteamUGC::StartPlaytimeTracking this adjustor: 0
1>ISteamUGC::StopPlaytimeTracking this adjustor: 0
1>ISteamUGC::StopPlaytimeTrackingForAllItems this adjustor: 0
1>ISteamUGC::AddDependency this adjustor: 0
1>ISteamUGC::RemoveDependency this adjustor: 0
1>ISteamUGC::AddAppDependency this adjustor: 0
1>ISteamUGC::RemoveAppDependency this adjustor: 0
1>ISteamUGC::GetAppDependencies this adjustor: 0
1>ISteamUGC::DeleteItem this adjustor: 0
1>
1>class SteamUGCQueryCompleted_t	size(24):
1>	+---
1> 0	| m_handle
1> 8	| EResult m_eResult
1>12	| m_unNumResultsReturned
1>16	| m_unTotalMatchingResults
1>20	| m_bCachedData
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class SteamUGCRequestUGCDetailsResult_t	size(9784):
1>	+---
1> 0	| SteamUGCDetails_t m_details
1>9776	| m_bCachedData
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class CreateItemResult_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_bUserNeedsToAcceptWorkshopLegalAgreement
1>  	| <alignment member> (size=7)
1>	+---
1>
1>class SubmitItemUpdateResult_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1> 4	| m_bUserNeedsToAcceptWorkshopLegalAgreement
1>  	| <alignment member> (size=3)
1> 8	| m_nPublishedFileId
1>	+---
1>
1>class ItemInstalled_t	size(16):
1>	+---
1> 0	| m_unAppID
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>	+---
1>
1>class DownloadItemResult_t	size(24):
1>	+---
1> 0	| m_unAppID
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| EResult m_eResult
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class UserFavoriteItemsListChanged_t	size(16):
1>	+---
1> 0	| m_nPublishedFileId
1> 8	| EResult m_eResult
1>12	| m_bWasAddRequest
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class SetUserItemVoteResult_t	size(16):
1>	+---
1> 0	| m_nPublishedFileId
1> 8	| EResult m_eResult
1>12	| m_bVoteUp
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class GetUserItemVoteResult_t	size(16):
1>	+---
1> 0	| m_nPublishedFileId
1> 8	| EResult m_eResult
1>12	| m_bVotedUp
1>13	| m_bVotedDown
1>14	| m_bVoteSkipped
1>  	| <alignment member> (size=1)
1>	+---
1>
1>class StartPlaytimeTrackingResult_t	size(4):
1>	+---
1> 0	| EResult m_eResult
1>	+---
1>
1>class StopPlaytimeTrackingResult_t	size(4):
1>	+---
1> 0	| EResult m_eResult
1>	+---
1>
1>class AddUGCDependencyResult_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_nChildPublishedFileId
1>	+---
1>
1>class RemoveUGCDependencyResult_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_nChildPublishedFileId
1>	+---
1>
1>class AddAppDependencyResult_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_nAppID
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class RemoveAppDependencyResult_t	size(24):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_nAppID
1>  	| <alignment member> (size=4)
1>	+---
1>
1>class GetAppDependenciesResult_t	size(152):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>16	| m_rgAppIDs
1>144	| m_nNumAppDependencies
1>148	| m_nTotalNumAppDependencies
1>	+---
1>
1>class DeleteItemResult_t	size(16):
1>	+---
1> 0	| EResult m_eResult
1>  	| <alignment member> (size=4)
1> 8	| m_nPublishedFileId
1>	+---
1>
1>class ISteamAppList	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamAppList::$vftable@:
1>	| &ISteamAppList_meta
1>	|  0
1> 0	| &ISteamAppList::GetNumInstalledApps
1> 1	| &ISteamAppList::GetInstalledApps
1> 2	| &ISteamAppList::GetAppName
1> 3	| &ISteamAppList::GetAppInstallDir
1> 4	| &ISteamAppList::GetAppBuildId
1>
1>ISteamAppList::GetNumInstalledApps this adjustor: 0
1>ISteamAppList::GetInstalledApps this adjustor: 0
1>ISteamAppList::GetAppName this adjustor: 0
1>ISteamAppList::GetAppInstallDir this adjustor: 0
1>ISteamAppList::GetAppBuildId this adjustor: 0
1>
1>class SteamAppInstalled_t	size(4):
1>	+---
1> 0	| m_nAppID
1>	+---
1>
1>class SteamAppUninstalled_t	size(4):
1>	+---
1> 0	| m_nAppID
1>	+---
1>
1>class ISteamHTMLSurface	size(4):
1>	+---
1> 0	| {vfptr}
1>	+---
1>
1>ISteamHTMLSurface::$vftable@:
1>	| &ISteamHTMLSurface_meta
1>	|  0
1> 0	| &ISteamHTMLSurface::{dtor}
1> 1	| &ISteamHTMLSurface::Init
1> 2	| &ISteamHTMLSurface::Shutdown
1> 3	| &ISteamHTMLSurface::CreateBrowser
1> 4	| &ISteamHTMLSurface::RemoveBrowser
1> 5	| &ISteamHTMLSurface::LoadURL
1> 6	| &ISteamHTMLSurface::SetSize
1> 7	| &ISteamHTMLSurface::StopLoad
1> 8	| &ISteamHTMLSurface::Reload
1> 9	| &ISteamHTMLSurface::GoBack
1>10	| &ISteamHTMLSurface::GoForward
1>11	| &ISteamHTMLSurface::AddHeader
1>12	| &ISteamHTMLSurface::ExecuteJavascript
1>13	| &ISteamHTMLSurface::MouseUp
1>14	| &ISteamHTMLSurface::MouseDown
1>15	| &ISteamHTMLSurface::MouseDoubleClick
1>16	| &ISteamHTMLSurface::MouseMove
1>17	| &ISteamHTMLSurface::MouseWheel
1>18	| &ISteamHTMLSurface::KeyDown
1>19	| &ISteamHTMLSurface::KeyUp
1>20	| &ISteamHTMLSurface::KeyChar
1>21	| &ISteamHTMLSurface::SetHorizontalScroll
1>22	| &ISteamHTMLSurface::SetVerticalScroll
1>23	| &ISteamHTMLSurface::SetKeyFocus
1>24	| &ISteamHTMLSurface::ViewSource
1>25	| &ISteamHTMLSurface::CopyToClipboard
1>26	| &ISteamHTMLSurface::PasteFromClipboard
1>27	| &ISteamHTMLSurface::Find
1>28	| &ISteamHTMLSurface::StopFind
1>29	| &ISteamHTMLSurface::GetLinkAtPosition
1>30	| &ISteamHTMLSurface::SetCookie
1>31	| &ISteamHTMLSurface::SetPageScaleFactor
1>32	| &ISteamHTMLSurface::SetBackgroundMode
1>33	| &ISteamHTMLSurface::SetDPIScalingFactor
1>34	| &ISteamHTMLSurface::AllowStartRequest
1>35	| &ISteamHTMLSurface::JSDialogResponse
1>36	| &ISteamHTMLSurface::FileLoadDialogResponse
1>
1>ISteamHTMLSurface::{dtor} this adjustor: 0
1>ISteamHTMLSurface::Init this adjustor: 0
1>ISteamHTMLSurface::Shutdown this adjustor: 0
1>ISteamHTMLSurface::CreateBrowser this adjustor: 0
1>ISteamHTMLSurface::RemoveBrowser this adjustor: 0
1>ISteamHTMLSurface::LoadURL this adjustor: 0
1>ISteamHTMLSurface::SetSize this adjustor: 0
1>ISteamHTMLSurface::StopLoad this adjustor: 0
1>ISteamHTMLSurface::Reload this adjustor: 0
1>ISteamHTMLSurface::GoBack this adjustor: 0
1>ISteamHTMLSurface::GoForward this adjustor: 0
1>ISteamHTMLSurface::AddHeader this adjustor: 0
1>ISteamHTMLSurface::ExecuteJavascript this adjustor: 0
1>ISteamHTMLSurface::MouseUp this adjustor: 0
1>ISteamHTMLSurface::MouseDown this adjustor: 0
1>ISteamHTMLSurface::MouseDoubleClick this adjustor: 0
1>ISteamHTMLSurface::MouseMove this adjustor: 0
1>ISteamHTMLSurface::MouseWheel this adjustor: 0
1>ISteamHTMLSurface::KeyDown this adjustor: 0
1>ISteamHTMLSurface::KeyUp this adjustor: 0
1>ISteamHTMLSurface::KeyChar this adjustor: 0
1>ISteamHTMLSurface::SetHorizontalScroll this adjustor: 0
1>ISteamHTMLSurface::SetVerticalScroll this adjustor: 0
1>ISteamHTMLSurface::SetKeyFocus this adjustor: 0
1>ISteamHTMLSurface::ViewSource this adjustor: 0
1>ISteamHTMLSurface::CopyToClipboard this adjustor: 0
1>ISteamHTMLSurface::PasteFromClipboard this adjustor: 0
1>ISteamHTMLSurface::Find this adjustor: 0
1>ISteamHTMLSurface::StopFind this adjustor: 0
1>ISteamHTMLSurface::GetLinkAtPosition this adjustor: 0
1>ISteamHTMLSurface::SetCookie this adjustor: 0
1>ISteamHTMLSurface::SetPageScaleFactor this adjustor: 0
1>ISteamHTMLSurface::SetBackgroundMode this adjustor: 0
1>ISteamHTMLSurface::SetDPIScalingFactor this adjustor: 0
1>ISteamHTMLSurface::AllowStartRequest this adjustor: 0
1>ISteamHTMLSurface::JSDialogResponse this adjustor: 0
1>ISteamHTMLSurface::FileLoadDialogResponse this adjustor: 0
1>ISteamHTMLSurface::__delDtor this adjustor: 0
1>ISteamHTMLSurface::__vecDelDtor this adjustor: 0
1>
1>class HTML_BrowserReady_t	size(4):
1>	+---
1> 0	| unBrowserHandle
1>	+---
1>
1>class HTML_NeedsPaint_t	size(48):
1>	+---
1> 0	| unBrowserHandle
1> 4	| pBGRA
1> 8	| unWide
1>12	| unTall
1>16	| unUpdateX
1>20	| unUpdateY
1>24	| unUpdateWide
1>28	| unUpdateTall
1>32	| unScrollX
1>36	| unScrollY
1>40	| flPageScale
1>44	| unPageSerial
1>	+---
1>
1>class HTML_StartRequest_t	size(20):
1>	+---
1> 0	| unBrowserHandle
1> 4	| pchURL
1> 8	| pchTarget
1>12	| pchPostData
1>16	| bIsRedirect
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class HTML_CloseBrowser_t	size(4):
1>	+---
1> 0	| unBrowserHandle
1>	+---
1>
1>class HTML_URLChanged_t	size(24):
1>	+---
1> 0	| unBrowserHandle
1> 4	| pchURL
1> 8	| pchPostData
1>12	| bIsRedirect
1>  	| <alignment member> (size=3)
1>16	| pchPageTitle
1>20	| bNewNavigation
1>  	| <alignment member> (size=3)
1>	+---
1>
1>class HTML_FinishedRequest_t	size(12):
1>	+---
1> 0	| unBrowserHandle
1> 4	| pchURL
1> 8	| pchPageTitle
1>	+---
1>
1>class HTML_OpenLinkInNewTab_t	size(8):
1>	+---
1> 0	| unBrowserHandle
1> 4	| pchURL
1>	+---
1>
1>class HTML_ChangedTitle_t	size(8):
1>	+---
1> 0	| unBrowserHandle
1> 4	| pchTitle
1>	+---
1>
1>class HTML_SearchResults_t	size(12):
1>	+---
1> 0	| unBrowserHandle
1> 4	| unResults
1> 8	| unCurrentMatch
1>	+---
1>
1>class HTML_CanGoBackAndForward_t	size(8):
1>	+---
1> 0	| unBrowserHandle
1> 4	| bCanGoBack
1> 5	| bCanGoForward
1>  	| <alignment member> (size=2)
1>	+---
1>
1>class HTML_HorizontalScroll_t	size(24):
1>	+---
1> 0	| unBrowserHandle
1> 4	| unScrollMax
1> 8	| unScrollCurrent
1>12	| flPageScale
1>16	| bVisible
1>  	| <alignment member> (size=3)
1>20	| unPageSize
1>	+---
1>
1>class HTML_VerticalScroll_t	size(24):
1>	+---
1> 0	| unBrowserHandle
1> 4	| unScrollMax
1> 8	| unScrollCurrent
1>12	| flPageScale
1>16	| bVisible
1>  	| <alignment member> (size=3)
1>20	| unPageSize
1>	+---
1>
